{
    "common": {
        "name": "zwave2",
        "version": "1.4.2",
        "news": {
            "1.4.2": {
                "en": "During the interview, endpoint associations are now converted to node associations if required\nThe interview process no longer fails if a node supports `Notification CC V2`",
                "de": "Während des Interviews werden Endpunktzuordnungen jetzt bei Bedarf in Knotenzuordnungen konvertiert\nDer Interviewprozess schlägt nicht mehr fehl, wenn ein Knoten \"Notification CC V2\" unterstützt",
                "ru": "Во время интервью связи конечных точек теперь преобразуются в связи узлов при необходимости\nПроцесс интервью больше не завершается ошибкой, если узел поддерживает `Notification CC V2`",
                "pt": "Durante a entrevista, as associações de terminais agora são convertidas em associações de nós, se necessário\nO processo de entrevista não falha mais se um nó suportar `Notification CC V2`",
                "nl": "Tijdens het interview worden eindpuntassociaties nu indien nodig omgezet in knooppuntassociaties\nHet interviewproces mislukt niet langer als een knooppunt `Notification CC V2` ondersteunt",
                "fr": "Au cours de l'entretien, les associations de noeuds finaux sont désormais converties en associations de nœuds si nécessaire\nLe processus d'entretien n'échoue plus si un nœud prend en charge «Notification CC V2»",
                "it": "Durante l'intervista, le associazioni degli endpoint vengono ora convertite in associazioni di nodi, se necessario\nIl processo di intervista non fallisce più se un nodo supporta `Notification CC V2`",
                "es": "Durante la entrevista, las asociaciones de punto final ahora se convierten en asociaciones de nodos si es necesario\nEl proceso de entrevista ya no falla si un nodo admite `Notification CC V2`",
                "pl": "Podczas wywiadu skojarzenia punktów końcowych są w razie potrzeby konwertowane na powiązania węzłów\nProces wywiadu nie kończy się niepowodzeniem, jeśli węzeł obsługuje `Notification CC V2`",
                "zh-cn": "采访期间，如果需要，端点关联现在会转换为节点关联\n如果节点支持`Notification CC V2`，则访问过程不再失败。"
            },
            "1.4.1": {
                "en": "If a node fails to respond to `Multi Channel Endpoint Find`, the interview is no longer aborted and sequential endpoints are assumed instead\nRenamed the manufacturer Goap to Qubino\nFor many Qubino devices, the lifeline now uses a node association",
                "de": "Wenn ein Knoten nicht auf \"Mehrkanal-Endpunktsuche\" reagiert, wird das Interview nicht mehr abgebrochen und stattdessen werden sequentielle Endpunkte angenommen\nDer Hersteller Goap wurde in Qubino umbenannt\nFür viele Qubino-Geräte verwendet die Rettungsleine jetzt eine Knotenzuordnung",
                "ru": "Если узел не отвечает на «Многоканальный поиск конечной точки», интервью больше не прерывается и вместо него предполагаются последовательные конечные точки\nПереименован производитель Goap в Qubino\nДля многих устройств Qubino линия жизни теперь использует ассоциацию узлов",
                "pt": "Se um nó falhar em responder à `Localização de ponto de extremidade multicanal ', a entrevista não será mais interrompida e os pontos de extremidade sequenciais serão assumidos.\nRenomeou o fabricante Goap para Qubino\nPara muitos dispositivos Qubino, a linha de vida agora usa uma associação de nó",
                "nl": "Als een knooppunt niet reageert op `Multi Channel Endpoint Find`, wordt het interview niet langer afgebroken en worden in plaats daarvan sequentiële eindpunten aangenomen\nOmgedoopt tot fabrikant Goap to Qubino\nVoor veel Qubino-apparaten gebruikt de levenslijn nu een knooppuntassociatie",
                "fr": "Si un nœud ne répond pas à la recherche de points de terminaison multicanaux, l'interview n'est plus abandonnée et les points de terminaison séquentiels sont supposés à la place.\nRenomme le fabricant Goap en Qubino\nPour de nombreux appareils Qubino, la ligne de vie utilise désormais une association de nœuds",
                "it": "Se un nodo non risponde a \"Ricerca endpoint multicanale\", l'intervista non viene più interrotta e si ipotizzano invece endpoint sequenziali\nRinominato il produttore Goap in Qubino\nPer molti dispositivi Qubino, la linea di vita ora utilizza un'associazione di nodi",
                "es": "Si un nodo no responde a la 'Búsqueda de punto final multicanal', la entrevista ya no se cancela y se suponen puntos finales secuenciales.\nRenombrado el fabricante Goap a Qubino\nPara muchos dispositivos Qubino, la línea de vida ahora usa una asociación de nodos",
                "pl": "Jeśli węzeł nie zareaguje na „Multi Channel Endpoint Find”, wywiad nie jest już przerywany i zamiast tego przyjmowane są kolejne punkty końcowe\nZmieniono nazwę producenta Goap na Qubino\nW przypadku wielu urządzeń Qubino linia życia używa teraz powiązania węzła",
                "zh-cn": "如果节点无法响应“多通道端点查找”，则访问不再中止，而是采用顺序端点\n将制造商Goap重命名为Qubino\n对于许多Qubino设备，生命线现在使用节点关联"
            },
            "1.4.0": {
                "en": "Updated `zwave-js` to v4.0.1. This includes the following features:\n* Improved support for legacy devices that don't include all CCs in the NIF, like `Fibaro FGRM 222`.\n* Added support for `Sound Switch CC`\n* Added support for `Alarm Sensor CC`. This CC will only be used if `Notification CC` is not supported.",
                "de": "`Zwave-js` wurde auf v4.0.1 aktualisiert. Dies umfasst die folgenden Funktionen:\n* Verbesserte Unterstützung für ältere Geräte, die nicht alle CCs im NIF enthalten, wie z. B. \"Fibaro FGRM 222\".\n* Unterstützung für \"Sound Switch CC\" hinzugefügt\n* Unterstützung für \"Alarm Sensor CC\" hinzugefügt. Dieser CC wird nur verwendet, wenn \"Benachrichtigungs-CC\" nicht unterstützt wird.",
                "ru": "Обновлен `zwave-js` до v4.0.1. Это включает в себя следующие функции:\n* Улучшена поддержка устаревших устройств, которые не включают все CC в NIF, например, `Fibaro FGRM 222`.\n* Добавлена поддержка `Sound Switch CC`\n* Добавлена поддержка `Alarm Sensor CC`. Этот CC будет использоваться только в том случае, если `Notification CC` не поддерживается.",
                "pt": "Atualizado `zwave-js` para a v4.0.1. Isso inclui os seguintes recursos:\n* Suporte aprimorado para dispositivos legados que não incluem todos os CCs no NIF, como o `Fibaro FGRM 222`.\n* Adicionado suporte para o `Sound Switch CC`\n* Adicionado suporte para `Alarm Sensor CC`. Este CC será usado apenas se o `Notification CC` não for suportado.",
                "nl": "`Zwave-js` bijgewerkt naar v4.0.1. Dit omvat de volgende kenmerken:\n* Verbeterde ondersteuning voor oudere apparaten die niet alle CC's in de NIF bevatten, zoals `Fibaro FGRM 222`.\n* Ondersteuning toegevoegd voor `Sound Switch CC`\n* Ondersteuning toegevoegd voor `Alarm Sensor CC`. Deze CC wordt alleen gebruikt als `Notification CC` niet wordt ondersteund.",
                "fr": "Mise à jour de `zwave-js` vers v4.0.1. Cela inclut les fonctionnalités suivantes:\n* Prise en charge améliorée des appareils hérités qui n'incluent pas tous les CC dans le NIF, comme `Fibaro FGRM 222`.\n* Ajout de la prise en charge de «Sound Switch CC»\n* Ajout de la prise en charge de «Alarm Sensor CC». Ce CC ne sera utilisé que si «Notification CC» n'est pas pris en charge.",
                "it": "Aggiornato `zwave-js` a v4.0.1. Ciò include le seguenti funzionalità:\n* Supporto migliorato per i dispositivi legacy che non includono tutti i CC nel NIF, come `Fibaro FGRM 222`.\n* Aggiunto supporto per `Sound Switch CC`\n* Aggiunto supporto per `Alarm Sensor CC`. Questo CC verrà utilizzato solo se \"Notifica CC\" non è supportato.",
                "es": "Actualizado `zwave-js` a v4.0.1. Esto incluye las siguientes características:\n* Soporte mejorado para dispositivos heredados que no incluyen todos los CC en el NIF, como `Fibaro FGRM 222`.\n* Soporte agregado para `Sound Switch CC`\n* Se agregó soporte para `Alarm Sensor CC`. Este CC solo se utilizará si no se admite `Notificación CC`.",
                "pl": "Zaktualizowano `zwave-js` do wersji 4.0.1. Obejmuje to następujące funkcje:\n* Poprawiona obsługa starszych urządzeń, które nie zawierają wszystkich CC w NIF, takich jak `Fibaro FGRM 222`.\n* Dodano wsparcie dla `Sound Switch CC`\n* Dodano obsługę `Alarm Sensor CC`. To CC będzie używane tylko wtedy, gdy „Notification CC” nie jest obsługiwane.",
                "zh-cn": "将`zwave-js`更新为v4.0.1。这包括以下功能：\n*改进了对不包含NIF中所有CC的旧式设备的支持，例如“ Fibaro FGRM 222”。\n*添加了对“声音开关CC”的支持\n*增加了对“警报传感器CC”的支持。仅当不支持`Notification CC`时，才使用此CC。"
            },
            "1.3.8": {
                "en": "Fixed transmission issues caused by overlapped secure transactions",
                "de": "Übertragungsprobleme behoben, die durch überlappende sichere Transaktionen verursacht wurden",
                "ru": "Исправлены проблемы передачи, вызванные перекрытыми безопасными транзакциями",
                "pt": "Corrigidos problemas de transmissão causados por transações seguras sobrepostas",
                "nl": "Vaste transmissieproblemen veroorzaakt door overlappende beveiligde transacties",
                "fr": "Correction de problèmes de transmission causés par des transactions sécurisées se chevauchant",
                "it": "Risolti i problemi di trasmissione causati da transazioni sicure sovrapposte",
                "es": "Se corrigieron problemas de transmisión causados por transacciones seguras superpuestas",
                "pl": "Naprawiono problemy z transmisją spowodowane nakładającymi się bezpiecznymi transakcjami",
                "zh-cn": "固定交易重叠引起的传输问题"
            },
            "1.3.7": {
                "en": "Fixed transmission issues caused by overlapped secure transactions",
                "de": "Übertragungsprobleme behoben, die durch überlappende sichere Transaktionen verursacht wurden",
                "ru": "Исправлены проблемы передачи, вызванные перекрытыми безопасными транзакциями",
                "pt": "Corrigidos problemas de transmissão causados por transações seguras sobrepostas",
                "nl": "Vaste transmissieproblemen veroorzaakt door overlappende beveiligde transacties",
                "fr": "Correction de problèmes de transmission causés par des transactions sécurisées se chevauchant",
                "it": "Risolti i problemi di trasmissione causati da transazioni sicure sovrapposte",
                "es": "Se corrigieron problemas de transmisión causados por transacciones seguras superpuestas",
                "pl": "Naprawiono problemy z transmisją spowodowane nakładającymi się bezpiecznymi transakcjami",
                "zh-cn": "固定交易重叠引起的传输问题"
            },
            "1.3.6": {
                "en": "Added some details to the `Multi Channel Association CC` interview logging\nConfigured lifeline node associations of newer devices should now be set correctly\n`CRC-16`-encapsulated commands can now be received\nThe log file is complete again",
                "de": "Einige Details zur Interviewprotokollierung der \"Multi Channel Association CC\" hinzugefügt\nKonfigurierte Lifeline-Knotenzuordnungen neuerer Geräte sollten jetzt korrekt eingestellt werden\nCRC-16-gekapselte Befehle können jetzt empfangen werden\nDie Protokolldatei ist wieder vollständig",
                "ru": "Добавлены некоторые детали в журнал интервью Multi Channel Association CC\nСконфигурированные ассоциации узлов жизнеобеспечения более новых устройств теперь должны быть установлены правильно\nИнкапсулированные команды `CRC-16` теперь могут быть получены\nФайл журнала снова завершен",
                "pt": "Adicionados alguns detalhes ao registro de entrevista `Multi Channel Association CC`\nAssociações de nó de linha de vida configuradas de dispositivos mais novos agora devem ser definidas corretamente\nComandos encapsulados `CRC-16` agora podem ser recebidos\nO arquivo de log está completo novamente",
                "nl": "Enkele details toegevoegd aan de gespreksregistratie van de `Multi Channel Association CC`\nDe geconfigureerde levenslijnknooppuntassociaties van nieuwere apparaten moeten nu correct worden ingesteld\nIn CRC-16 ingekapselde opdrachten kunnen nu worden ontvangen\nHet logbestand is weer compleet",
                "fr": "Ajout de quelques détails à la journalisation des interviews `Multi Channel Association CC`\nLes associations de nœuds de ligne de vie configurées pour les nouveaux appareils doivent maintenant être définies correctement\nLes commandes encapsulées `CRC-16` peuvent maintenant être reçues\nLe fichier journal est à nouveau complet",
                "it": "Aggiunti alcuni dettagli alla registrazione dell'intervista con `Multi Channel Association CC`\nLe associazioni dei nodi di linea di vita configurate dei dispositivi più recenti dovrebbero ora essere impostate correttamente\nOra è possibile ricevere comandi incapsulati `CRC-16`\nIl file di registro è di nuovo completo",
                "es": "Se agregaron algunos detalles al registro de entrevistas de la 'Asociación de canales múltiples CC'\nLas asociaciones de nodos de línea de vida configuradas de dispositivos más nuevos ahora se deben configurar correctamente\nAhora se pueden recibir comandos encapsulados `CRC-16`\nEl archivo de registro está completo nuevamente.",
                "pl": "Dodano pewne szczegóły do rejestrowania wywiadu `Multi Channel Association CC`\nSkonfigurowane skojarzenia węzłów linii życia nowszych urządzeń powinny być teraz ustawione poprawnie\nMożna teraz odbierać komendy w formacie `CRC-16`\nPlik dziennika jest ponownie gotowy",
                "zh-cn": "在“多渠道协会CC”采访记录中添加了一些详细信息\n现在应正确设置较新设备的已配置生命线节点关联\n现在可以接收CRC-16封装的命令\n日志文件再次完成"
            },
            "1.3.5": {
                "en": "Added some details to the `Multi Channel Association CC` interview logging\nConfigured lifeline node associations of newer devices should now be set correctly\nThe `CRC-16 Command Encapsulation CC` is now correctly detected as implemented\nThe log file is complete again",
                "de": "Einige Details zur Interviewprotokollierung der \"Multi Channel Association CC\" hinzugefügt\nKonfigurierte Lifeline-Knotenzuordnungen neuerer Geräte sollten jetzt korrekt eingestellt werden\nDer \"CRC-16 Command Encapsulation CC\" wird jetzt korrekt als implementiert erkannt\nDie Protokolldatei ist wieder vollständig",
                "ru": "Добавлены некоторые детали в журнал интервью Multi Channel Association CC\nСконфигурированные ассоциации узлов жизнеобеспечения более новых устройств теперь должны быть установлены правильно\n`CRC-16 Command Encapsulation CC` теперь правильно определяется как реализованный\nФайл журнала снова завершен",
                "pt": "Adicionados alguns detalhes ao registro de entrevista `Multi Channel Association CC`\nAssociações de nó de linha de vida configuradas de dispositivos mais novos agora devem ser definidas corretamente\nO `CRC-16 Command Encapsulation CC` agora está corretamente detectado como implementado\nO arquivo de log está completo novamente",
                "nl": "Enkele details toegevoegd aan de gespreksregistratie van de `Multi Channel Association CC`\nDe geconfigureerde levenslijnknooppuntassociaties van nieuwere apparaten moeten nu correct worden ingesteld\nDe `CRC-16 Command Encapsulation CC` wordt nu correct gedetecteerd als geïmplementeerd\nHet logbestand is weer compleet",
                "fr": "Ajout de quelques détails à la journalisation des interviews `Multi Channel Association CC`\nLes associations de nœuds de ligne de vie configurées pour les nouveaux appareils doivent maintenant être définies correctement\nLe `CRC-16 Command Encapsulation CC` est maintenant correctement détecté comme implémenté\nLe fichier journal est à nouveau complet",
                "it": "Aggiunti alcuni dettagli alla registrazione dell'intervista con `Multi Channel Association CC`\nLe associazioni dei nodi di linea di vita configurate dei dispositivi più recenti dovrebbero ora essere impostate correttamente\nIl `CRC-16 Command Encapsulation CC` è ora correttamente rilevato come implementato\nIl file di registro è di nuovo completo",
                "es": "Se agregaron algunos detalles al registro de entrevistas de la 'Asociación de canales múltiples CC'\nLas asociaciones de nodos de línea de vida configuradas de dispositivos más nuevos ahora se deben configurar correctamente\nEl `CRC-16 Command Encapsulation CC` ahora se detecta correctamente como implementado\nEl archivo de registro está completo nuevamente.",
                "pl": "Dodano pewne szczegóły do rejestrowania wywiadu `Multi Channel Association CC`\nSkonfigurowane skojarzenia węzłów linii życia nowszych urządzeń powinny być teraz ustawione poprawnie\n`CRC-16 Command Encapsulation CC` jest teraz poprawnie wykrywany jako zaimplementowany\nPlik dziennika jest ponownie gotowy",
                "zh-cn": "在“多渠道协会CC”采访记录中添加了一些详细信息\n现在应正确设置较新设备的已配置生命线节点关联\n现在已正确检测到“ CRC-16命令封装CC”已实现\n日志文件再次完成"
            },
            "1.3.4": {
                "en": "The association UI no longer crashes if an empty association object is returned\nThe target endpoint selection for associations is now hidden if an association does not support multiple target endpoints\nFixed an incompatibility with nodes that have a different number of \"normal\" associations than multi channel associations, e.g. _FGRM-222_\nThe association UI now distinguishes between associations to the device and the root endpoint\nMany fixes related to handling associations and multi channel associations\nCreating a log file works again\nAdded support for Devolo Dimmer (MT2760) and Shutter (MT2761) (thanks @nicoh88)\nWhen the interview process fails to set a lifeline association with `Multi Channel Association CC`, it now tries again with `Association CC`",
                "de": "Die Assoziations-Benutzeroberfläche stürzt nicht mehr ab, wenn ein leeres Assoziationsobjekt zurückgegeben wird\nDie Auswahl des Zielendpunkts für Zuordnungen ist jetzt ausgeblendet, wenn eine Zuordnung nicht mehrere Zielendpunkte unterstützt\nEs wurde eine Inkompatibilität mit Knoten behoben, die eine andere Anzahl von \"normalen\" Assoziationen als Mehrkanalassoziationen aufweisen, z. _FGRM-222_\nDie Zuordnungs-Benutzeroberfläche unterscheidet jetzt zwischen Zuordnungen zum Gerät und zum Stammendpunkt\nViele Korrekturen im Zusammenhang mit der Behandlung von Assoziationen und Mehrkanalassoziationen\nDas Erstellen einer Protokolldatei funktioniert erneut\nUnterstützung für Devolo Dimmer (MT2760) und Shutter (MT2761) hinzugefügt (danke @ nicoh88)\nWenn der Interviewprozess keine Lifeline-Zuordnung zu \"Multi Channel Association CC\" festlegen kann, wird er es jetzt erneut mit \"Association CC\" versuchen",
                "ru": "Пользовательский интерфейс ассоциации больше не падает, если возвращается пустой объект ассоциации\nВыбор целевой конечной точки для ассоциаций теперь скрыт, если ассоциация не поддерживает несколько целевых конечных точек.\nИсправлена несовместимость с узлами, которые имеют другое количество «нормальных» ассоциаций, чем многоканальные ассоциации, например _FGRM-222_\nПользовательский интерфейс ассоциации теперь различает ассоциации с устройством и корневой конечной точкой\nМного исправлений, связанных с обработкой ассоциаций и многоканальных ассоциаций\nСоздание файла журнала снова работает\nДобавлена поддержка Devolo Dimmer (MT2760) и Shutter (MT2761) (спасибо @ nicoh88)\nКогда в процессе собеседования не удается установить связь с каналом «Многоканальная ассоциация CC», он снова пытается выполнить «Ассоциация CC»",
                "pt": "A interface do usuário da associação não trava mais se um objeto de associação vazio for retornado\nA seleção do terminal de destino para associações agora está oculta se uma associação não suportar vários terminais de destino\nCorrigida uma incompatibilidade com os nós que têm um número diferente de associações \"normais\" das associações multicanal, por exemplo _FGRM-222_\nA interface do usuário da associação agora distingue entre associações ao dispositivo e o ponto de extremidade raiz\nMuitas correções relacionadas ao tratamento de associações e associações multicanal\nCriar um arquivo de log funciona novamente\nAdicionado suporte para o Devolo Dimmer (MT2760) e o Shutter (MT2761) (obrigado @ nicoh88)\nQuando o processo de entrevista falha ao definir uma associação da linha de vida com a `Associação Multicanal CC`, agora tenta novamente com a` Associação CC`",
                "nl": "De associatie-UI loopt niet meer vast als een leeg associatieobject wordt geretourneerd\nDe doeleindpuntselectie voor koppelingen is nu verborgen als een koppeling niet meerdere doeleindpunten ondersteunt\nEen incompatibiliteit opgelost met knooppunten die een ander aantal \"normale\" associaties hebben dan multi-kanaalassociaties, b.v. _FGRM-222_\nDe associatie-UI maakt nu onderscheid tussen associaties met het apparaat en het root-eindpunt\nVeel oplossingen hebben betrekking op het omgaan met associaties en multi-channel associaties\nHet aanmaken van een logbestand werkt weer\nOndersteuning toegevoegd voor Devolo Dimmer (MT2760) en Shutter (MT2761) (bedankt @ nicoh88)\nWanneer het interviewproces er niet in slaagt een levenslijnassociatie in te stellen met `Multi Channel Association CC`, probeert het nu opnieuw met` Association CC`",
                "fr": "L'interface utilisateur d'association ne se bloque plus si un objet d'association vide est renvoyé\nLa sélection de point de terminaison cible pour les associations est désormais masquée si une association ne prend pas en charge plusieurs points de terminaison cible\nCorrection d'une incompatibilité avec les nœuds qui ont un nombre d'associations \"normal\" différent de celui des associations multicanaux, par ex. _FGRM-222_\nL'interface utilisateur d'association distingue désormais les associations avec le périphérique et le point de terminaison racine\nDe nombreux correctifs liés à la gestion des associations et des associations multicanaux\nLa création d'un fichier journal fonctionne à nouveau\nPrise en charge supplémentaire de Devolo Dimmer (MT2760) et Shutter (MT2761) (merci @ nicoh88)\nLorsque le processus d'entrevue ne parvient pas à définir une association de ligne de vie avec «Multi Channel Association CC», il essaie à nouveau avec «Association CC»",
                "it": "L'interfaccia utente dell'associazione non si arresta più in modo anomalo se viene restituito un oggetto associazione vuoto\nLa selezione dell'endpoint di destinazione per le associazioni è ora nascosta se un'associazione non supporta più endpoint di destinazione\nRisolta un'incompatibilità con nodi con un numero diverso di associazioni \"normali\" rispetto alle associazioni multicanale, ad es. _FGRM-222_\nL'interfaccia utente dell'associazione ora distingue tra le associazioni al dispositivo e l'endpoint radice\nMolte correzioni legate alla gestione delle associazioni e delle associazioni multicanale\nLa creazione di un file di registro funziona di nuovo\nAggiunto supporto per Devolo Dimmer (MT2760) e Shutter (MT2761) (grazie @ nicoh88)\nQuando il processo di intervista non riesce a stabilire un'associazione di sicurezza con `Multi Channel Association CC`, ora riprova con` Association CC`",
                "es": "La IU de asociación ya no se bloquea si se devuelve un objeto de asociación vacío\nLa selección del punto final objetivo para las asociaciones ahora está oculta si una asociación no admite múltiples puntos finales objetivo\nSe corrigió una incompatibilidad con nodos que tienen un número diferente de asociaciones \"normales\" que las asociaciones multicanal, p. _FGRM-222_\nLa interfaz de usuario de asociación ahora distingue entre asociaciones con el dispositivo y el punto final raíz\nMuchas correcciones relacionadas con el manejo de asociaciones y asociaciones multicanal\nCrear un archivo de registro funciona nuevamente\nSoporte adicional para Devolo Dimmer (MT2760) y Shutter (MT2761) (gracias @ nicoh88)\nCuando el proceso de la entrevista no puede establecer una asociación de línea de vida con `Multi Channel Association CC`, ahora intenta nuevamente con` Association CC`",
                "pl": "Interfejs interfejsu asocjacji nie ulega już awarii, jeśli zwracany jest pusty obiekt asocjacji\nWybór docelowego punktu końcowego dla powiązań jest teraz ukryty, jeśli powiązanie nie obsługuje wielu docelowych punktów końcowych\nNaprawiono niezgodność z węzłami, które mają inną liczbę „normalnych” skojarzeń niż skojarzenia wielokanałowe, np. _FGRM-222_\nInterfejs użytkownika skojarzenia rozróżnia teraz powiązania z urządzeniem i głównym punktem końcowym\nWiele poprawek związanych z obsługą skojarzeń i powiązań wielokanałowych\nTworzenie pliku dziennika działa ponownie\nDodano obsługę Devolo Dimmer (MT2760) i Shutter (MT2761) (dzięki @ nicoh88)\nKiedy proces wywiadu nie ustanawia powiązania z linią życia z `Multi Channel Association CC`, teraz próbuje ponownie z` Association CC`",
                "zh-cn": "如果返回空的关联对象，则关联UI不再崩溃\n如果关联不支持多个目标端点，则将隐藏关联的目标端点选择\n修复了与“正常”关联数比多通道关联数不同的节点的不兼容问题。 _FGRM-222_\n现在，关联UI可以区分与设备和根端点的关联\n与处理关联和多渠道关联有关的许多修复\n创建日志文件再次起作用\n增加了对Devolo调光器（MT2760）和快门（MT2761）的支持（感谢@ nicoh88）\n当采访过程无法通过“多渠道关联CC”设置生命线关联时，现在会再次尝试使用“关联CC”。"
            },
            "1.3.3": {
                "en": "Logfiles are now logged in the correct order and some unnecessary logging was removed\nFixed an error when using the DoorLockCC setValue API when not all configuration values have been received\nErrors while sending firmware fragments are now caught and logged\nThe adapter no longer crashes when the serial device exists but does not respond\nImproved compatibility with some devices that send invalid `Multi Channel Endpoint Find Reports`, e.g. _TKB Home TZ74 Dual Switch_",
                "de": "Protokolldateien werden jetzt in der richtigen Reihenfolge protokolliert und einige unnötige Protokollierungen wurden entfernt\nEin Fehler bei der Verwendung der DoorLockCC setValue-API wurde behoben, wenn nicht alle Konfigurationswerte empfangen wurden\nFehler beim Senden von Firmware-Fragmenten werden jetzt abgefangen und protokolliert\nDer Adapter stürzt nicht mehr ab, wenn das serielle Gerät vorhanden ist, reagiert jedoch nicht\nVerbesserte Kompatibilität mit einigen Geräten, die ungültige \"Multi Channel Endpoint Find Reports\" senden, z. _TKB Home TZ74 Dual Switch_",
                "ru": "Лог-файлы теперь зарегистрированы в правильном порядке, и некоторые ненужные записи были удалены\nИсправлена ошибка при использовании DoorLockCC setValue API, когда не все значения конфигурации были получены\nОшибки при отправке фрагментов прошивки теперь отлавливаются и регистрируются\nАдаптер больше не падает, когда последовательное устройство существует, но не отвечает\nУлучшена совместимость с некоторыми устройствами, которые отправляют недопустимые «отчеты о поиске многоканальной конечной точки», например, _TKB Home TZ74 Dual Switch_",
                "pt": "Os arquivos de log agora estão registrados na ordem correta e algum log desnecessário foi removido\nCorrigido um erro ao usar a API doorLockCC setValue quando nem todos os valores de configuração foram recebidos\nErros ao enviar fragmentos de firmware agora são capturados e registrados\nO adaptador não trava mais quando o dispositivo serial existe, mas não responde\nMelhor compatibilidade com alguns dispositivos que enviam `Relatórios de localização de endpoint multicanal inválidos ', por exemplo _TKB Home TZ74 Comutador Duplo_",
                "nl": "Logbestanden worden nu in de juiste volgorde gelogd en sommige onnodige logging is verwijderd\nEen fout verholpen bij het gebruik van de DoorLockCC setValue API wanneer niet alle configuratiewaarden zijn ontvangen\nFouten bij het verzenden van firmwarefragmenten worden nu opgevangen en vastgelegd\nDe adapter crasht niet meer wanneer het seriële apparaat bestaat, maar reageert niet\nVerbeterde compatibiliteit met sommige apparaten die ongeldige `Multi Channel Endpoint Find Reports` verzenden, bijv. _TKB Home TZ74 Dual Switch_",
                "fr": "Les fichiers journaux sont désormais enregistrés dans le bon ordre et certains journaux inutiles ont été supprimés\nCorrection d'une erreur lors de l'utilisation de l'API setLalCC DoorLockCC lorsque toutes les valeurs de configuration n'avaient pas été reçues\nLes erreurs lors de l'envoi de fragments de firmware sont désormais détectées et enregistrées\nL'adaptateur ne se bloque plus lorsque le périphérique série existe mais ne répond pas\nAmélioration de la compatibilité avec certains appareils qui envoient des `` rapports de recherche de points de terminaison multicanaux '' invalides, par ex. _TKB Home TZ74 Dual Switch_",
                "it": "I file di registro vengono ora registrati nell'ordine corretto e alcuni log non necessari sono stati rimossi\nRisolto un errore quando si utilizzava l'API setValue DoorLockCC quando non sono stati ricevuti tutti i valori di configurazione\nGli errori durante l'invio dei frammenti del firmware vengono ora rilevati e registrati\nL'adattatore non si arresta più in modo anomalo quando esiste il dispositivo seriale ma non risponde\nMigliore compatibilità con alcuni dispositivi che inviano \"Rapporti di ricerca endpoint multicanale non validi\", ad es. _TKB Home TZ74 Dual Switch_",
                "es": "Los archivos de registro ahora están registrados en el orden correcto y se eliminaron algunos registros innecesarios\nSe corrigió un error al usar la API setLoal de DoorLockCC cuando no se han recibido todos los valores de configuración\nLos errores al enviar fragmentos de firmware ahora se detectan y registran\nEl adaptador ya no se bloquea cuando el dispositivo en serie existe pero no responde\nCompatibilidad mejorada con algunos dispositivos que envían informes de búsqueda de punto final multicanal no válidos, p. _TKB Home TZ74 Dual Switch_",
                "pl": "Pliki dziennika są teraz rejestrowane w prawidłowej kolejności, a niektóre niepotrzebne rejestrowanie zostało usunięte\nNaprawiono błąd podczas używania interfejsu API setValue DoorLockCC, gdy nie wszystkie wartości konfiguracji zostały odebrane\nBłędy podczas wysyłania fragmentów oprogramowania są teraz wychwytywane i rejestrowane\nAdapter przestaje się zawieszać, gdy istnieje urządzenie szeregowe, ale nie odpowiada\nPoprawiona kompatybilność z niektórymi urządzeniami, które wysyłają nieprawidłowe raporty „Multi Channel Endpoint Find Report”, np. _TKB Home TZ74 Podwójny przełącznik_",
                "zh-cn": "现在以正确的顺序记录日志文件，并删除了一些不必要的日志记录\n修复了在未收到所有配置值的情况下使用DoorLockCC setValue API时的错误\n现在捕获并记录了发送固件片段时的错误\n当串行设备存在但不响应时，适配器不再崩溃\n改善了与某些发送无效“多通道端点查找报告”的设备的兼容性，例如_TKB家用TZ74双开关_"
            },
            "1.3.2": {
                "en": "Fixed a crash that happens when a `Multi Command CC` is received",
                "de": "Es wurde ein Absturz behoben, der auftrat, wenn ein \"Multi Command CC\" empfangen wurde",
                "ru": "Исправлен сбой, возникающий при получении «Multi Command CC»",
                "pt": "Corrigida uma falha que acontece quando um `Multi Command CC` é recebido",
                "nl": "Een crash gerepareerd die optreedt wanneer een `Multi Command CC` wordt ontvangen",
                "fr": "Correction d'un plantage qui se produisait lors de la réception d'un CC multi-commandes",
                "it": "Risolto un crash che si verificava quando si riceve un `Multi Command CC`",
                "es": "Se corrigió un bloqueo que ocurre cuando se recibe un `Multi Command CC`",
                "pl": "Naprawiono awarię występującą po otrzymaniu „Multi Command CC”",
                "zh-cn": "修复了当收到“多命令抄送”时发生的崩溃"
            },
            "1.3.1": {
                "en": "Fixed an issue where secure Multi Channel Association Reports were not correctly deserialized\nFixed an issue where some associations to the root endpoint could not be removed",
                "de": "Es wurde ein Problem behoben, bei dem sichere Multi-Channel-Zuordnungsberichte nicht korrekt deserialisiert wurden\nEs wurde ein Problem behoben, durch das einige Zuordnungen zum Stammendpunkt nicht entfernt werden konnten",
                "ru": "Исправлена ошибка, из-за которой защищенные отчеты многоканальной ассоциации не были правильно десериализованы.\nИсправлена ошибка, из-за которой не удалось удалить некоторые ассоциации с корневой конечной точкой",
                "pt": "Corrigido um problema em que os Relatórios de associação multicanal seguros não eram desserializados corretamente\nCorrigido um problema em que algumas associações ao terminal raiz não podiam ser removidas",
                "nl": "Er is een probleem opgelost waarbij beveiligde Multi Channel Association-rapporten niet correct waren gedeserialiseerd\nEr is een probleem opgelost waarbij sommige koppelingen met het root-eindpunt niet konden worden verwijderd",
                "fr": "Correction d'un problème où les rapports d'association multicanaux sécurisés n'étaient pas correctement désérialisés\nCorrection d'un problème où certaines associations au point de terminaison racine ne pouvaient pas être supprimées",
                "it": "Risolto il problema per cui i report di associazione multicanale sicuri non venivano deserializzati correttamente\nRisolto il problema per cui alcune associazioni all'endpoint radice non potevano essere rimosse",
                "es": "Se solucionó un problema por el cual los informes seguros de asociación de canales múltiples no se deserializaban correctamente\nSe solucionó un problema por el cual algunas asociaciones con el punto final raíz no podían eliminarse",
                "pl": "Naprawiono problem polegający na tym, że bezpieczne raporty powiązań wielokanałowych nie były poprawnie usuwane z postaci szeregowej\nNaprawiono problem, w wyniku którego niektóre powiązania z głównym punktem końcowym nie mogły zostać usunięte",
                "zh-cn": "修复了安全的多渠道关联报告未正确反序列化的问题\n修复了无法删除与根端点的某些关联的问题"
            },
            "1.3.0": {
                "en": "Added support for firmware updates. WARNING: Use at your own risk!\n`Fibaro FGMS-001 Motion sensor`: All association groups are now configured to point to the controller\nWhen re-interviewing a node, the information about its command classes is also reset",
                "de": "Unterstützung für Firmware-Updates hinzugefügt. WARNUNG: Verwendung auf eigenes Risiko!\n`Fibaro FGMS-001 Bewegungssensor`: Alle Zuordnungsgruppen sind jetzt so konfiguriert, dass sie auf die Steuerung zeigen\nBei der erneuten Befragung eines Knotens werden auch die Informationen zu seinen Befehlsklassen zurückgesetzt",
                "ru": "Добавлена поддержка обновлений прошивки. ВНИМАНИЕ: Используйте на свой страх и риск!\n`Fibaro FGMS-001 Датчик движения`: все группы ассоциаций теперь настроены так, чтобы указывать на контроллер\nПри повторном опросе узла информация о его классах команд также сбрасывается",
                "pt": "Adicionado suporte para atualizações de firmware. AVISO: Use por sua conta e risco!\n`Fibaro FGMS-001 Motion sensor`: Todos os grupos de associações agora estão configurados para apontar para o controlador\nAo entrevistar novamente um nó, as informações sobre suas classes de comando também são redefinidas",
                "nl": "Ondersteuning toegevoegd voor firmware-updates. WAARSCHUWING: Gebruik op eigen risico!\n`Fibaro FGMS-001 Bewegingssensor`: Alle associatiegroepen zijn nu geconfigureerd om naar de controller te wijzen\nBij het opnieuw interviewen van een knooppunt wordt de informatie over de opdrachtklassen ook gereset",
                "fr": "Ajout de la prise en charge des mises à jour du firmware. AVERTISSEMENT: utilisez à vos risques et périls!\n`Fibaro FGMS-001 Motion sensor`: Tous les groupes d'association sont maintenant configurés pour pointer vers le contrôleur\nLors d'une nouvelle interview d'un nœud, les informations sur ses classes de commandes sont également réinitialisées",
                "it": "Aggiunto supporto per gli aggiornamenti del firmware. ATTENZIONE: utilizzare a proprio rischio!\n`Sensore di movimento Fibaro FGMS-001`: Tutti i gruppi di associazione sono ora configurati per puntare al controller\nQuando si intervista nuovamente un nodo, vengono ripristinate anche le informazioni sulle sue classi di comando",
                "es": "Soporte agregado para actualizaciones de firmware. ADVERTENCIA: ¡Utilícelo bajo su propio riesgo!\n`Sensor de movimiento Fibaro FGMS-001`: Todos los grupos de asociación ahora están configurados para apuntar al controlador\nAl volver a entrevistar un nodo, la información sobre sus clases de comando también se restablece",
                "pl": "Dodano obsługę aktualizacji oprogramowania układowego. OSTRZEŻENIE: Używaj na własne ryzyko!\n`Fibaro FGMS-001 Czujnik ruchu`: Wszystkie grupy asocjacyjne są teraz skonfigurowane tak, aby wskazywały na kontroler\nPodczas ponownej rozmowy z węzłem informacje o jego klasach poleceń są również resetowane",
                "zh-cn": "添加了对固件更新的支持。警告：使用风险自负！\n“ Fibaro FGMS-001运动传感器”：现在将所有关联组配置为指向控制器\n重新访问节点时，还将重置有关其命令类的信息"
            },
            "1.2.1": {
                "en": "The inclusion dropdown works again",
                "de": "Das Dropdown-Menü für die Aufnahme funktioniert wieder",
                "ru": "Раскрывающийся список включения снова работает",
                "pt": "O menu suspenso de inclusão funciona novamente",
                "nl": "De inclusie dropdown werkt weer",
                "fr": "La liste déroulante d'inclusion fonctionne à nouveau",
                "it": "Il menu a discesa dell'inclusione funziona di nuovo",
                "es": "El menú desplegable de inclusión funciona nuevamente",
                "pl": "Lista dołączeń działa ponownie",
                "zh-cn": "包含下拉列表再次起作用"
            },
            "1.2.0": {
                "en": "Added a possibility to restart the interview for single nodes\nThe cached lifeline associations (for `Multi Channel Association` and `Association` CCs) are now updated if they are changed during the interview",
                "de": "Es wurde die Möglichkeit hinzugefügt, das Interview für einzelne Knoten neu zu starten\nDie zwischengespeicherten Lifeline-Zuordnungen (für \"Multi Channel Association\" - und \"Association\" -CCs) werden jetzt aktualisiert, wenn sie während des Interviews geändert werden",
                "ru": "Добавлена возможность перезапустить интервью для отдельных узлов\nКэшированные ассоциации каналов жизни (для «Многоканальной ассоциации» и «Ассоциации» CC) теперь обновляются, если они изменяются во время интервью",
                "pt": "Foi adicionada a possibilidade de reiniciar a entrevista para nós únicos\nAs associações da linha de vida em cache (para os CCs `Multicanal Association` e` Association`) agora são atualizadas se forem alteradas durante a entrevista",
                "nl": "Mogelijkheid toegevoegd om het interview voor afzonderlijke knooppunten opnieuw te starten\nDe gecachete levenslijnassociaties (voor `Multi Channel Association` en` Association` CCs) worden nu bijgewerkt als ze tijdens het interview worden gewijzigd",
                "fr": "Ajout d'une possibilité de redémarrer l'interview pour les nœuds uniques\nLes associations de lignes de vie mises en cache (pour les CC «Multi Channel Association» et «Association») sont désormais mises à jour si elles sont modifiées pendant l'interview.",
                "it": "Aggiunta la possibilità di riavviare l'intervista per singoli nodi\nLe associazioni della linea di vita memorizzate nella cache (per i CC \"Associazione multi canale\" e \"Associazione\") sono ora aggiornate se cambiate durante l'intervista",
                "es": "Se agregó la posibilidad de reiniciar la entrevista para nodos individuales\nLas asociaciones de línea de vida almacenadas en caché (para CC de `Multi Association 'y` Association`) ahora se actualizan si se cambian durante la entrevista",
                "pl": "Dodano możliwość ponownego uruchomienia wywiadu dla pojedynczych węzłów\nPowiązane buforowane linie życia (dla `Multi Association Association` i` Association` CC) są teraz aktualizowane, jeśli zostaną zmienione podczas wywiadu",
                "zh-cn": "添加了重新启动单个节点的采访的可能性\n如果在访问期间更改了缓存的生命线关联（针对“多渠道关联”和“关联” CC），则将对其进行更新"
            },
            "1.1.0": {
                "en": "Added support for `Door Lock CC V4`\nAdded support for `Lock CC`\nFixed the `E5` issue with Danfoss thermostats (hopefully)\nFixed an issue where sleeping nodes could block the entire send queue\nFixed an issue where some CCs did not store the received values\nFixed an issue where the values of endpoint 1 of some multichannel devices were not updated\nThe node interview is no longer aborted if a response for the following requests times out:\nBattery status\nBattery health\nBinary Sensor status\nMultilevel Sensor status",
                "de": "Unterstützung für \"Türschloss CC V4\" hinzugefügt\nUnterstützung für \"Lock CC\" hinzugefügt\nDas E5-Problem mit Danfoss-Thermostaten wurde behoben (hoffentlich)\nEs wurde ein Problem behoben, durch das schlafende Knoten die gesamte Sendewarteschlange blockieren konnten\nEs wurde ein Problem behoben, bei dem einige CCs die empfangenen Werte nicht speicherten\nEs wurde ein Problem behoben, bei dem die Werte von Endpunkt 1 einiger Mehrkanalgeräte nicht aktualisiert wurden\nDas Knoteninterview wird nicht mehr abgebrochen, wenn eine Antwort auf die folgenden Anforderungen abläuft:\nBatteriestatus\nBatteriezustand\nStatus des binären Sensors\nStatus des mehrstufigen Sensors",
                "ru": "Добавлена поддержка `Door Lock CC V4`\nДобавлена поддержка `Lock CC`\nИсправлена проблема с `E5` с термостатами Danfoss (надеюсь)\nИсправлена ошибка, из-за которой спящие узлы могли блокировать всю очередь отправки.\nИсправлена проблема, когда некоторые CC не сохраняли полученные значения\nИсправлена ошибка, из-за которой значения конечной точки 1 некоторых многоканальных устройств не обновлялись\nИнтервью узла больше не прерывается, если время ожидания ответа на следующие запросы:\nЗаряд батареи\nЗдоровье батареи\nСостояние двоичного датчика\nСостояние многоуровневого датчика",
                "pt": "Adicionado suporte para `Door Lock CC V4`\nAdicionado suporte para o `Lock CC`\nCorrigido o problema `E5` com os termostatos Danfoss (espero)\nCorrigido um problema em que os nós inativos podiam bloquear toda a fila de envio\nCorrigido um problema em que alguns CCs não armazenavam os valores recebidos\nCorrigido um problema em que os valores do terminal 1 de alguns dispositivos multicanais não eram atualizados\nA entrevista do nó não será mais interrompida se o tempo limite de uma resposta para os seguintes pedidos:\nStatus da bateria\nFuncionamento da bateria\nStatus do sensor binário\nStatus do sensor multinível",
                "nl": "Ondersteuning toegevoegd voor `Door Lock CC V4`\nOndersteuning toegevoegd voor `Lock CC`\nHet 'E5'-probleem met Danfoss-thermostaten opgelost (hopelijk)\nEr is een probleem opgelost waarbij slaapknooppunten de hele verzendwachtrij konden blokkeren\nEr is een probleem opgelost waarbij sommige CC's de ontvangen waarden niet hadden opgeslagen\nEr is een probleem opgelost waarbij de waarden van eindpunt 1 van sommige meerkanaals apparaten niet werden bijgewerkt\nHet knooppuntinterview wordt niet meer afgebroken als er een time-out optreedt voor de volgende verzoeken:\nBatterij status\nBatterijstatus\nStatus binaire sensor\nStatus sensor op meerdere niveaus",
                "fr": "Ajout de la prise en charge de `Door Lock CC V4`\nAjout de la prise en charge de `Lock CC`\nCorrection du problème `E5` avec les thermostats Danfoss (avec un peu de chance)\nCorrection d'un problème où les nœuds en veille pouvaient bloquer toute la file d'attente d'envoi\nCorrection d'un problème où certains CC ne stockaient pas les valeurs reçues\nCorrection d'un problème où les valeurs du point de terminaison 1 de certains appareils multicanaux n'étaient pas mises à jour\nL'interview de noeud n'est plus abandonnée si une réponse pour les demandes suivantes expire:\nÉtat de la batterie\nSanté de la batterie\nÉtat du capteur binaire\nÉtat du capteur à plusieurs niveaux",
                "it": "Aggiunto supporto per `Door Lock CC V4`\nAggiunto supporto per `Lock CC`\nRisolto il problema `E5` con i termostati Danfoss (si spera)\nRisolto il problema per cui i nodi dormienti potevano bloccare l'intera coda di invio\nRisolto il problema per cui alcuni CC non memorizzavano i valori ricevuti\nRisolto il problema per cui i valori dell'endpoint 1 di alcuni dispositivi multicanale non venivano aggiornati\nL'intervista al nodo non viene più interrotta se scade una risposta per le seguenti richieste:\nStato della batteria\nSalute della batteria\nStato del sensore binario\nStato del sensore multilivello",
                "es": "Soporte agregado para `Door Lock CC V4`\nSoporte agregado para `Lock CC`\nSe solucionó el problema `E5` con los termostatos Danfoss (con suerte)\nSe solucionó un problema por el cual los nodos dormidos podían bloquear toda la cola de envío\nSe solucionó un problema por el cual algunos CC no almacenaban los valores recibidos\nSe solucionó un problema por el cual los valores del punto final 1 de algunos dispositivos multicanal no se actualizaban\nLa entrevista de nodo ya no se cancela si se agota el tiempo de espera de una respuesta a las siguientes solicitudes:\nEstado de la batería\nEstado de la batería\nEstado del sensor binario\nEstado del sensor multinivel",
                "pl": "Dodano obsługę „Door Lock CC V4”\nDodano obsługę `Lock CC`\nNaprawiono problem „E5” z termostatami Danfoss (mam nadzieję)\nNaprawiono problem, w którym uśpione węzły mogły blokować całą kolejkę wysyłania\nNaprawiono problem, w którym niektóre CC nie zapisywały otrzymanych wartości\nNaprawiono problem polegający na tym, że wartości punktu końcowego 1 niektórych urządzeń wielokanałowych nie były aktualizowane\nWywiad z węzłem nie jest już przerywany, jeśli upłynie limit czasu odpowiedzi na następujące żądania:\nStan baterii\nKondycja baterii\nStatus czujnika binarnego\nStatus czujnika wielopoziomowego",
                "zh-cn": "增加了对“ Door Lock CC V4”的支持\n添加了对“ Lock CC”的支持\n修复了Danfoss温控器的“ E5”问题（希望如此）\n修复了休眠节点可能会阻塞整个发送队列的问题\n修复了某些抄送未存储接收到的值的问题\n修复了某些多通道设备的端点1的值未更新的问题\n如果对以下请求的响应超时，则节点采访不再中止：\n电池状态\n电池健康\n二进制传感器状态\n多级传感器状态"
            },
            "1.0.0": {
                "en": "Changed the compatibility config queries for Danfoss thermostats, so queued setpoint changes are not overwritten",
                "de": "Die Kompatibilitätskonfigurationsabfragen für Danfoss-Thermostate wurden geändert, sodass Änderungen der Sollwerte in der Warteschlange nicht überschrieben werden",
                "ru": "Изменены запросы конфигурации совместимости для термостатов Danfoss, поэтому изменения заданного значения в очереди не перезаписываются",
                "pt": "Foram alteradas as consultas de configuração de compatibilidade para termostatos Danfoss, para que as alterações no ponto de ajuste na fila não sejam substituídas",
                "nl": "De compatibiliteitsconfiguratievragen voor Danfoss-thermostaten gewijzigd, dus wijzigingen in instelpunten in de wachtrij worden niet overschreven",
                "fr": "Modification des requêtes de configuration de compatibilité pour les thermostats Danfoss, afin que les modifications de point de consigne en file d'attente ne soient pas écrasées",
                "it": "Modificate le query di configurazione della compatibilità per i termostati Danfoss, quindi le modifiche del setpoint in coda non vengono sovrascritte",
                "es": "Se modificaron las consultas de configuración de compatibilidad para los termostatos Danfoss, por lo que los cambios en el punto de referencia en cola no se sobrescriben",
                "pl": "Zmieniono zapytania konfiguracji zgodności dla termostatów Danfoss, więc zmiany wartości zadanej w kolejce nie są nadpisywane",
                "zh-cn": "更改了丹佛斯恒温器的兼容性配置查询，因此排队的设定值更改不会被覆盖"
            },
            "0.14.9": {
                "en": "Placeholder object names (e.g. `Node 003`) for non-reachable nodes are now overwritten with the correct name when the nodes are interviewed.",
                "de": "Platzhalterobjektnamen (z. B. \"Knoten 003\") für nicht erreichbare Knoten werden jetzt mit dem richtigen Namen überschrieben, wenn die Knoten befragt werden.",
                "ru": "Имена объектов-заполнителей (например, `Node 003`) для недоступных узлов теперь перезаписываются с правильным именем при опросе узлов.",
                "pt": "Os nomes de objetos de espaço reservado (por exemplo, \"Nó 003\") para nós inacessíveis agora são substituídos pelo nome correto quando os nós são entrevistados.",
                "nl": "Namen van tijdelijke aanduiding-objecten (bijv. `Knooppunt 003`) voor niet-bereikbare knooppunten worden nu overschreven met de juiste naam wanneer de knooppunten worden geïnterviewd.",
                "fr": "Les noms d'objet d'espace réservé (par exemple, `` Node 003`) pour les nœuds non accessibles sont désormais remplacés par le nom correct lorsque les nœuds sont interrogés.",
                "it": "I nomi degli oggetti segnaposto (ad es. \"Nodo 003\") per i nodi non raggiungibili ora vengono sovrascritti con il nome corretto quando vengono intervistati i nodi.",
                "es": "Los nombres de objeto de marcador de posición (por ejemplo, `Nodo 003`) para nodos no accesibles ahora se sobrescriben con el nombre correcto cuando se entrevistan los nodos.",
                "pl": "Nazwy obiektów zastępczych (np. „Węzeł 003”) dla nieosiągalnych węzłów są teraz zastępowane poprawną nazwą podczas przesłuchiwania węzłów.",
                "zh-cn": "现在，在访问节点时，不可达节点的占位符对象名称（例如，“节点003”）将被正确的名称覆盖。"
            },
            "0.14.8": {
                "en": "Fixed an issue where secure sleeping nodes could block all communication with other nodes",
                "de": "Es wurde ein Problem behoben, durch das sichere schlafende Knoten die gesamte Kommunikation mit anderen Knoten blockieren konnten",
                "ru": "Исправлена ошибка, из-за которой безопасные спящие узлы могли блокировать все коммуникации с другими узлами.",
                "pt": "Corrigido um problema em que nós inativos seguros podiam bloquear toda a comunicação com outros nós",
                "nl": "Er is een probleem opgelost waarbij veilige slaapknooppunten alle communicatie met andere knooppunten konden blokkeren",
                "fr": "Correction d'un problème où les nœuds de sommeil sécurisés pouvaient bloquer toutes les communications avec d'autres nœuds",
                "it": "Risolto il problema per cui i nodi dormienti sicuri potevano bloccare tutte le comunicazioni con altri nodi",
                "es": "Se corrigió un problema por el cual los nodos dormidos seguros podían bloquear toda comunicación con otros nodos",
                "pl": "Naprawiono problem, w którym bezpieczne uśpione węzły mogły blokować całą komunikację z innymi węzłami",
                "zh-cn": "修复了安全的睡眠节点可能会阻止与其他节点进行所有通信的问题"
            },
            "0.14.7": {
                "en": "Fixed an issue where interviews could get stuck for sleeping nodes\nFixed a crash that happened when decoding a secure message with an unsupported payload",
                "de": "Es wurde ein Problem behoben, durch das Interviews für schlafende Knoten hängen blieben\nEs wurde ein Absturz behoben, der beim Dekodieren einer sicheren Nachricht mit einer nicht unterstützten Nutzlast auftrat",
                "ru": "Исправлена ошибка, из-за которой интервью могли застрять в спящих узлах.\nИсправлен сбой, возникающий при декодировании защищенного сообщения с неподдерживаемой полезной нагрузкой.",
                "pt": "Corrigido um problema em que as entrevistas podiam ficar paralisadas para nós adormecidos\nCorrigida uma falha que acontecia ao decodificar uma mensagem segura com uma carga útil não suportada",
                "nl": "Er is een probleem opgelost waarbij interviews vast konden lopen voor slaapknooppunten\nEen crash verholpen die zich voordeed bij het decoderen van een beveiligd bericht met een niet-ondersteunde payload",
                "fr": "Correction d'un problème où les interviews pouvaient se bloquer pour les nœuds endormis\nCorrection d'un plantage qui se produisait lors du décodage d'un message sécurisé avec une charge utile non prise en charge",
                "it": "Risolto il problema per cui le interviste potevano rimanere bloccate per i nodi dormienti\nRisolto un crash che si verificava durante la decodifica di un messaggio sicuro con un payload non supportato",
                "es": "Se solucionó un problema por el cual las entrevistas podían atascarse para nodos dormidos\nSe corrigió un bloqueo que ocurría al decodificar un mensaje seguro con una carga útil no compatible",
                "pl": "Naprawiono problem, w wyniku którego wywiady mogły zacinać się w węzłach uśpionych\nNaprawiono awarię występującą podczas dekodowania bezpiecznej wiadomości o nieobsługiwanym ładunku",
                "zh-cn": "修复了采访可能陷入睡眠节点的问题\n修复了在解码不支持有效负载的安全消息时发生的崩溃"
            },
            "0.14.6": {
                "en": "Added support for `Protection CC`\nFixed several bugs in `Security CC`\nUpdates from a node that span multiple messages are now correctly decoded\nDuring the startup, device objects are created for asleep and dead nodes. This allows removing failed devices from the network even after the cache was cleared.",
                "de": "Unterstützung für \"Protection CC\" hinzugefügt\nMehrere Fehler in \"Security CC\" wurden behoben\nAktualisierungen von einem Knoten, der mehrere Nachrichten umfasst, werden jetzt korrekt dekodiert\nWährend des Startvorgangs werden Geräteobjekte für schlafende und tote Knoten erstellt. Auf diese Weise können ausgefallene Geräte auch nach dem Löschen des Caches aus dem Netzwerk entfernt werden.",
                "ru": "Добавлена поддержка `Protection CC`\nИсправлено несколько ошибок в `Security CC`\nОбновления с узла, охватывающего несколько сообщений, теперь правильно декодируются\nВо время запуска объекты устройства создаются для спящих и мертвых узлов. Это позволяет удалять неисправные устройства из сети даже после очистки кэша.",
                "pt": "Adicionado suporte para o `Protection CC`\nCorrigidos vários erros no `Security CC`\nAtualizações de um nó que abrangem várias mensagens agora são decodificadas corretamente\nDurante a inicialização, os objetos do dispositivo são criados para nós inativos e inativos. Isso permite remover dispositivos com falha da rede, mesmo após a limpeza do cache.",
                "nl": "Ondersteuning toegevoegd voor `Protection CC`\nVerschillende bugs in `Security CC` opgelost\nUpdates van een knooppunt dat meerdere berichten omvat, worden nu correct gedecodeerd\nTijdens het opstarten worden apparaatobjecten gemaakt voor in slaap en dode knooppunten. Hierdoor kunnen defecte apparaten van het netwerk worden verwijderd, zelfs nadat de cache is gewist.",
                "fr": "Ajout du support pour `Protection CC`\nCorrection de plusieurs bugs dans `Security CC`\nLes mises à jour à partir d'un nœud qui couvrent plusieurs messages sont désormais correctement décodées\nAu démarrage, des objets d'appareil sont créés pour les nœuds endormis et morts. Cela permet de supprimer les périphériques défaillants du réseau même après la suppression du cache.",
                "it": "Aggiunto supporto per `Protection CC`\nRisolti diversi bug in `Security CC`\nGli aggiornamenti da un nodo che si estendono su più messaggi sono ora decodificati correttamente\nDurante l'avvio, vengono creati oggetti dispositivo per nodi dormienti e morti. Ciò consente di rimuovere i dispositivi guasti dalla rete anche dopo aver svuotato la cache.",
                "es": "Soporte agregado para `Protection CC`\nSe corrigieron varios errores en `Security CC`\nLas actualizaciones de un nodo que abarcan varios mensajes ahora se decodifican correctamente\nDurante el inicio, los objetos del dispositivo se crean para los nodos dormidos y muertos. Esto permite eliminar dispositivos fallidos de la red incluso después de que se borró la memoria caché.",
                "pl": "Dodano obsługę `Protection CC`\nNaprawiono kilka błędów w „Security CC”\nAktualizacje z węzła obejmujące wiele wiadomości są teraz poprawnie dekodowane\nPodczas uruchamiania tworzone są obiekty urządzeń dla uśpionych i martwych węzłów. Pozwala to na usunięcie uszkodzonych urządzeń z sieci nawet po wyczyszczeniu pamięci podręcznej.",
                "zh-cn": "添加了对“保护CC”的支持\n修复了“安全CC”中的几个错误\n跨多个消息的节点更新现在可以正确解码\n在启动过程中，将为睡眠节点和死节点创建设备对象。即使清除了缓存，这也可以从网络中删除故障设备。"
            }
        },
        "title": "Z-Wave 2",
        "titleLang": {
            "en": "Z-Wave 2",
            "de": "Z-Wave 2",
            "ru": "Z-Wave 2",
            "pt": "Z-Wave 2",
            "nl": "Z-Wave 2",
            "fr": "Z-Wave 2",
            "it": "Z-Wave 2",
            "es": "Z-Wave 2",
            "pl": "Z-Wave 2",
            "zh-cn": "Z-Wave 2"
        },
        "desc": {
            "en": "The better Z-Wave integration",
            "de": "Die bessere Z-Wave-Integration",
            "ru": "Лучшая интеграция Z-Wave",
            "pt": "A melhor integração do Z-Wave",
            "nl": "De betere Z-Wave-integratie",
            "fr": "La meilleure intégration Z-Wave",
            "it": "La migliore integrazione di Z-Wave",
            "es": "La mejor integración de Z-Wave",
            "pl": "Lepsza integracja Z-Wave",
            "zh-cn": "更好的Z-Wave集成"
        },
        "authors": [
            "AlCalzone <d.griesel@gmx.net>"
        ],
        "keywords": [
            "zwave",
            "z-wave",
            "zwave2",
            "z-wave 2"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "build/main.js",
        "icon": "zwave2.svg",
        "enabled": true,
        "dataFolder": "zwave2.%INSTANCE%",
        "extIcon": "https://raw.githubusercontent.com/AlCalzone/ioBroker.zwave2/master/admin/zwave2.svg?sanitize=true",
        "readme": "https://github.com/AlCalzone/ioBroker.zwave2/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "hardware",
        "compact": true,
        "materialize": true,
        "messagebox": true,
        "connectionType": "local",
        "dataSource": "push",
        "dependencies": [
            {
                "js-controller": ">=2.0.0"
            }
        ]
    },
    "native": {
        "serialport": "",
        "writeLogFile": false,
        "networkKey": ""
    },
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info",
            "type": "channel",
            "common": {
                "name": "Information"
            },
            "native": {}
        },
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "Whether the Z-Wave driver is ready",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.inclusion",
            "type": "state",
            "common": {
                "role": "state",
                "name": "Which state the inclusion of nodes is in",
                "type": "number",
                "read": true,
                "write": true,
                "def": 0,
                "states": {
                    "0": "Idle",
                    "1": "Non-secure",
                    "2": "Secure"
                }
            },
            "native": {}
        },
        {
            "_id": "info.exclusion",
            "type": "state",
            "common": {
                "role": "state",
                "name": "Whether the exclusion of nodes is active",
                "type": "boolean",
                "read": true,
                "write": true,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.healingNetwork",
            "type": "state",
            "common": {
                "role": "state",
                "name": "Whether a network heal is currently in progress",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}