{
    "common": {
        "name": "zwave2",
        "version": "1.10.1",
        "news": {
            "1.10.1": {
                "en": "Removed some warnings about wrong state value types in JS-Controller 3.3\nUpgraded to `zwave-js` version `7.5.1`. Notable changes include:\n* Improved stability\n* Improved healing strategy\n* Several config file changes",
                "de": "Einige Warnungen zu falschen Statuswerttypen in JS-Controller 3.3 wurden entfernt\nUpgrade auf `zwave-js` Version` 7.5.1`. Bemerkenswerte Änderungen umfassen:\n* Verbesserte Stabilität\n* Verbesserte Heilungsstrategie\n* Mehrere Änderungen an der Konfigurationsdatei",
                "ru": "Удалены некоторые предупреждения о неправильных типах значений состояния в JS-Controller 3.3.\nОбновлен до `zwave-js` версии` 7.5.1`. Заметные изменения включают:\n* Повышена стабильность\n* Улучшенная стратегия исцеления\n* Несколько изменений конфигурационного файла",
                "pt": "Removidos alguns avisos sobre tipos de valor de estado incorretos no JS-Controller 3.3\nAtualizado para `zwave-js` versão` 7.5.1`. Mudanças notáveis incluem:\n* Estabilidade aprimorada\n* Estratégia de cura aprimorada\n* Várias mudanças no arquivo de configuração",
                "nl": "Enkele waarschuwingen verwijderd over verkeerde statuswaardetypes in JS-Controller 3.3\nOpgewaardeerd naar `zwave-js` versie` 7.5.1`. Opmerkelijke veranderingen zijn onder meer:\n* Verbeterde stabiliteit\n* Verbeterde genezingsstrategie\n* Verschillende wijzigingen in het configuratiebestand",
                "fr": "Suppression de certains avertissements concernant les types de valeurs d'état incorrects dans JS-Controller 3.3\nMise à jour vers la version `7.5.1` de` zwave-js`. Les changements notables incluent:\n* Amélioration de la stabilité\n* Stratégie de guérison améliorée\n* Plusieurs changements de fichier de configuration",
                "it": "Rimossi alcuni avvisi sui tipi di valore di stato errati in JS-Controller 3.3\nAggiornato alla versione `zwave-js`` 7.5.1`. Notevoli cambiamenti includono:\n* Migliore stabilità\n* Strategia di guarigione migliorata\n* Diverse modifiche al file di configurazione",
                "es": "Se eliminaron algunas advertencias sobre tipos de valores de estado incorrectos en JS-Controller 3.3\nActualizado a la versión `7.5.1` de` zwave-js`. Los cambios notables incluyen:\n* Estabilidad mejorada\n* Estrategia de curación mejorada\n* Varios cambios en el archivo de configuración",
                "pl": "Usunięto niektóre ostrzeżenia o błędnych typach wartości stanu w JS-Controller 3.3\nZaktualizowano do wersji „zwave-js” „7.5.1”. Istotne zmiany obejmują:\n* Poprawiona stabilność\n* Ulepszona strategia leczenia\n* Kilka zmian w pliku konfiguracyjnym",
                "zh-cn": "删除了有关JS-Controller 3.3中错误的状态值类型的一些警告\n升级到`zwave-js`版本`7.5.1`。显着的变化包括：\n*提高稳定性\n*改善治疗策略\n*几个配置文件更改"
            },
            "1.10.0": {
                "en": "The associations tab now shows the name of devices along with their node ID\nAssociations can now also be managed on the endpoints of a node\nExperimental support for updating the embedded configuration files from the adapter configuration\nSupport firmware updates with `*.hec` files\nReduced traffic after controlling devices that report automatically\nFixed an issue where `Basic CC` values were not stored correctly\nAdded and updated many device configuration files\nStability improvements\nDependency updates",
                "de": "Auf der Registerkarte Zuordnungen wird jetzt der Name der Geräte zusammen mit ihrer Knoten-ID angezeigt\nZuordnungen können jetzt auch auf den Endpunkten eines Knotens verwaltet werden\nExperimentelle Unterstützung für die Aktualisierung der eingebetteten Konfigurationsdateien aus der Adapterkonfiguration\nUnterstützt Firmware-Updates mit `* .hec`-Dateien\nReduzierter Datenverkehr nach Steuerung von Geräten, die automatisch Bericht erstatten\nEs wurde ein Problem behoben, bei dem \"Basis-CC\" -Werte nicht korrekt gespeichert wurden\nViele Gerätekonfigurationsdateien wurden hinzugefügt und aktualisiert\nStabilitätsverbesserungen\nAbhängigkeitsaktualisierungen",
                "ru": "На вкладке ассоциаций теперь отображаются имена устройств вместе с идентификаторами их узлов.\nСвязями теперь также можно управлять на конечных точках узла.\nЭкспериментальная поддержка обновления встроенных файлов конфигурации из конфигурации адаптера.\nПоддержка обновлений прошивки с помощью файлов `* .hec`\nСнижение трафика после управления устройствами, которые отчитываются автоматически\nИсправлена ошибка, из-за которой значения `Basic CC` не сохранялись правильно.\nДобавлено и обновлено множество файлов конфигурации устройства.\nУлучшения стабильности\nОбновления зависимостей",
                "pt": "A guia de associações agora mostra o nome dos dispositivos junto com sua ID de nó\nAs associações agora também podem ser gerenciadas nos terminais de um nó\nSuporte experimental para atualizar os arquivos de configuração integrados da configuração do adaptador\nSuporta atualizações de firmware com arquivos `* .hec`\nTráfego reduzido após controlar dispositivos que relatam automaticamente\nCorrigido um problema em que os valores `CC básico` não eram armazenados corretamente\nAdicionados e atualizados muitos arquivos de configuração de dispositivos\nMelhorias de estabilidade\nAtualizações de dependência",
                "nl": "Het tabblad Koppelingen toont nu de naam van de apparaten samen met hun knooppunt-ID\nKoppelingen kunnen nu ook worden beheerd op de eindpunten van een knooppunt\nExperimentele ondersteuning voor het bijwerken van de ingesloten configuratiebestanden vanuit de adapterconfiguratie\nOndersteuning van firmware-updates met `* .hec` -bestanden\nMinder verkeer na het besturen van apparaten die automatisch rapporteren\nProbleem opgelost waarbij `Basic CC`-waarden niet correct werden opgeslagen\nVeel apparaatconfiguratiebestanden toegevoegd en bijgewerkt\nStabiliteitsverbeteringen\nAfhankelijkheid updates",
                "fr": "L'onglet Associations affiche maintenant le nom des appareils ainsi que leur ID de nœud\nLes associations peuvent désormais également être gérées sur les extrémités d'un nœud\nPrise en charge expérimentale de la mise à jour des fichiers de configuration intégrés à partir de la configuration de l'adaptateur\nPrise en charge des mises à jour du micrologiciel avec les fichiers `* .hec`\nRéduction du trafic après le contrôle des appareils qui signalent automatiquement\nCorrection d'un problème où les valeurs «Basic CC» n'étaient pas stockées correctement\nAjout et mise à jour de nombreux fichiers de configuration de périphérique\nAméliorations de la stabilité\nMises à jour des dépendances",
                "it": "La scheda Associazioni ora mostra il nome dei dispositivi insieme al loro ID nodo\nLe associazioni possono ora essere gestite anche sugli endpoint di un nodo\nSupporto sperimentale per l'aggiornamento dei file di configurazione incorporati dalla configurazione dell'adattatore\nSupporta gli aggiornamenti del firmware con i file `* .hec`\nRiduzione del traffico dopo il controllo dei dispositivi che segnalano automaticamente\nRisolto un problema per cui i valori di \"CC di base\" non venivano memorizzati correttamente\nAggiunti e aggiornati molti file di configurazione del dispositivo\nMiglioramenti della stabilità\nAggiornamenti delle dipendenze",
                "es": "La pestaña de asociaciones ahora muestra el nombre de los dispositivos junto con su ID de nodo\nLas asociaciones ahora también se pueden administrar en los puntos finales de un nodo\nSoporte experimental para actualizar los archivos de configuración integrados desde la configuración del adaptador\nAdmite actualizaciones de firmware con archivos `* .hec`\nReducción del tráfico después de controlar los dispositivos que informan automáticamente\nSe solucionó un problema por el cual los valores de `Basic CC` no se almacenaban correctamente\nSe agregaron y actualizaron muchos archivos de configuración de dispositivos\nMejoras de estabilidad\nActualizaciones de dependencia",
                "pl": "Karta asocjacji wyświetla teraz nazwy urządzeń wraz z ich identyfikatorami węzłów\nAsocjacjami można teraz zarządzać również na punktach końcowych węzła\nEksperymentalna obsługa aktualizowania osadzonych plików konfiguracyjnych z konfiguracji adaptera\nObsługa aktualizacji oprogramowania układowego za pomocą plików `* .hec`\nZmniejszony ruch po sterowaniu urządzeniami, które raportują automatycznie\nNaprawiono problem polegający na tym, że wartości „Basic CC” nie były poprawnie przechowywane\nDodano i zaktualizowano wiele plików konfiguracyjnych urządzeń\nPoprawa stabilności\nAktualizacje zależności",
                "zh-cn": "现在，“关联”选项卡显示设备的名称及其节点ID\n现在也可以在节点的端点上管理关联\n实验性支持，可从适配器配置中更新嵌入式配置文件\n支持带有* .hec文件的固件更新\n控制自动报告的设备后流量减少\n修复了“基本CC”值未正确存储的问题\n添加并更新了许多设备配置文件\n稳定性提高\n依赖关系更新"
            },
            "1.9.3": {
                "en": "Restored the old behavior for devices that report their values via the root endpoint\nSome minor config file changes",
                "de": "Das alte Verhalten für Geräte wiederhergestellt, die ihre Werte über den Root-Endpunkt melden\nEinige kleinere Änderungen an der Konfigurationsdatei",
                "ru": "Восстановлено старое поведение для устройств, которые сообщают свои значения через корневую конечную точку.\nНекоторые незначительные изменения файла конфигурации",
                "pt": "Restaurado o comportamento antigo para dispositivos que relatam seus valores por meio do endpoint raiz\nAlgumas pequenas alterações no arquivo de configuração",
                "nl": "Het oude gedrag hersteld voor apparaten die hun waarden rapporteren via het root-eindpunt\nEnkele kleine wijzigingen in het configuratiebestand",
                "fr": "Restauration de l'ancien comportement des appareils qui signalent leurs valeurs via le point de terminaison racine\nQuelques modifications mineures du fichier de configuration",
                "it": "Ripristinato il vecchio comportamento per i dispositivi che riportano i propri valori tramite l'endpoint root\nAlcune modifiche minori al file di configurazione",
                "es": "Se restauró el comportamiento anterior para los dispositivos que informan sus valores a través del punto final raíz.\nAlgunos cambios menores en el archivo de configuración",
                "pl": "Przywrócono stare zachowanie urządzeń, które zgłaszają swoje wartości za pośrednictwem głównego punktu końcowego\nDrobne zmiany w pliku konfiguracyjnym",
                "zh-cn": "恢复了通过根端点报告其值的设备的旧行为\n一些小的配置文件更改"
            },
            "1.9.2": {
                "en": "Upgraded to `zwave-js` version `7.1.0`. Notable changes include:\n* Added reporting of usage statistics. For details, refer to the `node-zwave-js` documentation.\n* Better support for 700-series Z-Wave sticks\n* Notification values are no longer auto-reset to idle after 5 minutes by default. This behavior can now be enabled per device if necessary.\n* Several stability improvements\n\nFor a full list of changes, check out https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md",
                "de": "Upgrade auf `zwave-js` Version` 7.1.0`. Bemerkenswerte Änderungen umfassen:\n* Berichterstattung über Nutzungsstatistiken hinzugefügt. Einzelheiten finden Sie in der Dokumentation zu \"node-zwave-js\".\n* Bessere Unterstützung für Z-Wave-Sticks der Serie 700\n* Benachrichtigungswerte werden standardmäßig nach 5 Minuten nicht mehr automatisch auf Leerlauf zurückgesetzt. Dieses Verhalten kann jetzt bei Bedarf pro Gerät aktiviert werden.\n* Mehrere Stabilitätsverbesserungen\n\nEine vollständige Liste der Änderungen finden Sie unter https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md",
                "ru": "Обновлен до `zwave-js` версии` 7.1.0`. Заметные изменения включают:\n* Добавлен отчет по статистике использования. За подробностями обращайтесь к документации по `node-zwave-js`.\n* Лучшая поддержка стиков Z-Wave серии 700\n* Значения уведомлений больше не сбрасываются автоматически до состояния бездействия по умолчанию через 5 минут. Теперь при необходимости это поведение можно включить для каждого устройства.\n* Несколько улучшений стабильности\n\nПолный список изменений см. На https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md.",
                "pt": "Atualizado para `zwave-js` versão` 7.1.0`. Mudanças notáveis incluem:\n* Adicionado relatório de estatísticas de uso. Para obter detalhes, consulte a documentação `node-zwave-js`.\n* Melhor suporte para sticks Z-Wave da série 700\n* Os valores de notificação não são mais redefinidos automaticamente para ocioso após 5 minutos por padrão. Este comportamento agora pode ser habilitado por dispositivo, se necessário.\n* Várias melhorias de estabilidade\n\nPara uma lista completa de mudanças, confira https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md",
                "nl": "Opgewaardeerd naar `zwave-js` versie` 7.1.0`. Opmerkelijke veranderingen zijn onder meer:\n* Rapportage van gebruiksstatistieken toegevoegd. Voor details, refereer je naar de `node-zwave-js` documentatie.\n* Betere ondersteuning voor Z-Wave-sticks uit de 700-serie\n* Meldingswaarden worden standaard niet langer automatisch gereset naar inactief na 5 minuten. Dit gedrag kan nu indien nodig per apparaat worden ingeschakeld.\n* Diverse stabiliteitsverbeteringen\n\nGa voor een volledige lijst met wijzigingen naar https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md",
                "fr": "Mise à jour vers la version `zwave-js` 7.1.0`. Les changements notables incluent:\n* Ajout de rapports sur les statistiques d'utilisation. Pour plus de détails, reportez-vous à la documentation de `node-zwave-js`.\n* Meilleur support pour les bâtons Z-Wave de la série 700\n* Les valeurs de notification ne sont plus automatiquement réinitialisées au repos après 5 minutes par défaut. Ce comportement peut désormais être activé par appareil si nécessaire.\n* Plusieurs améliorations de stabilité\n\nPour une liste complète des modifications, consultez https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md",
                "it": "Aggiornato alla versione `zwave-js`` 7.1.0`. Notevoli cambiamenti includono:\n* Aggiunto report sulle statistiche di utilizzo. Per i dettagli, fare riferimento alla documentazione `node-zwave-js`.\n* Migliore supporto per gli stick Z-Wave della serie 700\n* Per impostazione predefinita, i valori di notifica non vengono più ripristinati automaticamente allo stato di inattività dopo 5 minuti. Questo comportamento può ora essere abilitato per dispositivo, se necessario.\n* Diversi miglioramenti alla stabilità\n\nPer un elenco completo delle modifiche, visita https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md",
                "es": "Actualizado a `zwave-js` versión` 7.1.0`. Los cambios notables incluyen:\n* Añadidos informes de estadísticas de uso. Para obtener más información, consulte la documentación de `node-zwave-js`.\n* Mejor soporte para sticks Z-Wave de la serie 700\n* Los valores de notificación ya no se restablecen automáticamente a inactivo después de 5 minutos de forma predeterminada. Este comportamiento ahora se puede habilitar por dispositivo si es necesario.\n* Varias mejoras de estabilidad\n\nPara obtener una lista completa de cambios, consulte https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md",
                "pl": "Zaktualizowano do wersji „zwave-js” „7.1.0”. Istotne zmiany obejmują:\n* Dodano raportowanie statystyk użytkowania. Aby uzyskać szczegółowe informacje, zapoznaj się z dokumentacją `node-zwave-js`.\n* Lepsza obsługa drążków Z-Wave z serii 700\n* Wartości powiadomień nie są już domyślnie resetowane do stanu bezczynności po 5 minutach. W razie potrzeby to zachowanie można teraz włączyć dla każdego urządzenia.\n* Kilka ulepszeń stabilności\n\nPełną listę zmian można znaleźć pod adresem https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md",
                "zh-cn": "升级到zwave-js版本7.1.0。显着的变化包括：\n*添加了使用情况统计报告。有关详细信息，请参阅`node-zwave-js`文档。\n*更好地支持700系列Z-Wave摇杆\n*默认情况下，通知值不会在5分钟后自动重置为空闲状态。现在可以根据需要为每个设备启用此行为。\n*多项稳定性改进\n\n有关更改的完整列表，请查看https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md"
            },
            "1.9.0": {
                "en": "Upgraded to `zwave-js` version 7\nNodes with a completed interview are no longer queried for all their values when restarting. As a result the adapter is now ready much much faster after a restart, but you'll see many yellow values until the devices have sent updated data.\nThe device list in the configuration dialog now displays a better type for the devices, for example `Wall Controller` instead of `Routing Slave`\nNetwork heal no longer times out early in large networks\nFixed a crash: `supportedCCs is not iterable`. If this happens to you, re-interview affected devices.\nRelaxed the checks when a report gets mapped from the root endpoint to higher endpoints\nSome encrypted messages that were previously dropped are now accepted\nPrevent the interview of sleeping nodes to get stuck until a re-interview under certain circumstances\nAfter a restart, sleeping nodes have their status correctly determined even if they weren't interviewed completely before\nNotification variables are now auto-idled after 5 minutes as it was intended, not after 5 hours\nThe `deltaTime` and `previousValue` values for the Meter CC are now hidden\nFixed a crash that could happen after node inclusion\nTons of new and improved device configuration files",
                "de": "Upgrade auf `zwave-js` Version 7\nKnoten mit einem abgeschlossenen Interview werden beim Neustart nicht mehr nach allen Werten abgefragt. Infolgedessen ist der Adapter nach einem Neustart jetzt viel schneller einsatzbereit, es werden jedoch viele Gelbwerte angezeigt, bis die Geräte aktualisierte Daten gesendet haben.\nIn der Geräteliste im Konfigurationsdialog wird jetzt ein besserer Typ für die Geräte angezeigt, z. B. \"Wall Controller\" anstelle von \"Routing Slave\"\nIn großen Netzwerken läuft die Netzwerkheilung nicht mehr frühzeitig ab\nEin Absturz wurde behoben: \"Unterstützte CCs sind nicht iterierbar\". Wenn Ihnen dies passiert, befragen Sie die betroffenen Geräte erneut.\nDie Überprüfungen wurden gelockert, wenn ein Bericht vom Stammendpunkt höheren Endpunkten zugeordnet wird\nEinige verschlüsselte Nachrichten, die zuvor gelöscht wurden, werden jetzt akzeptiert\nVerhindern Sie, dass das Interview mit schlafenden Knoten unter bestimmten Umständen bis zu einem erneuten Interview hängen bleibt\nNach einem Neustart wird der Status von schlafenden Knoten korrekt ermittelt, auch wenn sie zuvor nicht vollständig befragt wurden\nBenachrichtigungsvariablen werden jetzt nach 5 Minuten wie vorgesehen automatisch und nicht nach 5 Stunden automatisch inaktiv\nDie Werte für \"deltaTime\" und \"previousValue\" für das Messgerät CC sind jetzt ausgeblendet\nEs wurde ein Absturz behoben, der nach dem Einschließen des Knotens auftreten konnte\nTonnenweise neue und verbesserte Gerätekonfigurationsdateien",
                "ru": "Обновился до `zwave-js` версии 7\nУзлы с завершенным интервью больше не запрашивают все их значения при перезапуске. В результате адаптер теперь готов намного быстрее после перезапуска, но вы увидите много желтых значений, пока устройства не отправят обновленные данные.\nВ списке устройств в диалоговом окне конфигурации теперь отображается более подходящий тип устройств, например «Wall Controller» вместо «Routing Slave».\nВосстановление сети больше не прерывается раньше времени в больших сетях\nИсправлен сбой: «supportedCCs не повторяется». Если это произойдет с вами, повторно опросите затронутые устройства.\nОслаблены проверки, когда отчет сопоставляется от корневой конечной точки к конечным точкам более высокого уровня.\nНекоторые зашифрованные сообщения, которые ранее были отброшены, теперь принимаются\nНе допускайте, чтобы опрос спящих узлов застрял до повторного опроса при определенных обстоятельствах\nПосле перезапуска состояние спящих узлов определено правильно, даже если до этого они не были полностью опрошены.\nПеременные уведомления теперь автоматически отключаются через 5 минут, как предполагалось, а не через 5 часов.\nЗначения deltaTime и previousValue для Meter CC теперь скрыты.\nИсправлен сбой, который мог произойти после включения узла\nТонны новых и улучшенных файлов конфигурации устройства",
                "pt": "Atualizado para `zwave-js` versão 7\nOs nós com uma entrevista concluída não são mais consultados por todos os seus valores ao reiniciar. Como resultado, o adaptador agora está pronto muito mais rápido após uma reinicialização, mas você verá muitos valores amarelos até que os dispositivos tenham enviado os dados atualizados.\nA lista de dispositivos na caixa de diálogo de configuração agora exibe um tipo melhor para os dispositivos, por exemplo `Wall Controller` em vez de` Routing Slave`\nO reparo da rede não atinge mais o tempo limite em grandes redes\nCorrigido um travamento: `supportedCCs não é iterável`. Se isso acontecer com você, entreviste novamente os dispositivos afetados.\nRelaxou as verificações quando um relatório é mapeado do ponto de extremidade raiz para pontos de extremidade superiores\nAlgumas mensagens criptografadas que foram descartadas anteriormente agora são aceitas\nEvite que a entrevista de nós adormecidos fique presa até uma nova entrevista sob certas circunstâncias\nApós uma reinicialização, os nós em espera têm seu status determinado corretamente, mesmo se não foram entrevistados completamente antes\nAs variáveis de notificação agora são desativadas automaticamente após 5 minutos conforme pretendido, não após 5 horas\nOs valores `deltaTime` e` previousValue` para o Meter CC agora estão ocultos\nCorrigida uma falha que poderia acontecer após a inclusão do nó\nToneladas de arquivos de configuração de dispositivos novos e aprimorados",
                "nl": "Opgewaardeerd naar `zwave-js` versie 7\nKnooppunten met een voltooid interview worden bij het opnieuw opstarten niet langer naar al hun waarden gevraagd. Als gevolg hiervan is de adapter nu veel sneller klaar na een herstart, maar je zult veel gele waarden zien totdat de apparaten bijgewerkte gegevens hebben verzonden.\nDe apparatenlijst in de configuratiedialoog toont nu een beter type voor de apparaten, bijvoorbeeld 'Wall Controller' in plaats van 'Routing Slave'\nNetwerkherstel treedt niet langer vroegtijdig op in grote netwerken\nEen crash verholpen: `supportedCCs is niet itereerbaar`. Als u dit overkomt, interview de betrokken apparaten dan opnieuw.\nDe controles versoepeld wanneer een rapport wordt toegewezen van het root-eindpunt naar hogere eindpunten\nSommige versleutelde berichten die eerder werden verwijderd, worden nu geaccepteerd\nVoorkom dat het interview met slaapknopen vastloopt tot een herinterview onder bepaalde omstandigheden\nNa een herstart wordt de status van de slaapknooppunten correct bepaald, zelfs als ze niet eerder volledig zijn geïnterviewd\nMeldingsvariabelen worden nu automatisch inactief gemaakt na 5 minuten zoals het bedoeld was, niet na 5 uur\nDe waarden `deltaTime` en` previousValue` voor de Meter CC zijn nu verborgen\nEen crash verholpen die kon optreden na het opnemen van een knooppunt\nTal van nieuwe en verbeterde apparaatconfiguratiebestanden",
                "fr": "Mise à jour vers la version 7 de `zwave-js`\nLes nœuds avec une interview terminée ne sont plus interrogés pour toutes leurs valeurs lors du redémarrage. En conséquence, l'adaptateur est maintenant prêt beaucoup plus rapidement après un redémarrage, mais vous verrez de nombreuses valeurs jaunes jusqu'à ce que les appareils aient envoyé des données mises à jour.\nLa liste des appareils dans la boîte de dialogue de configuration affiche maintenant un meilleur type pour les appareils, par exemple `Wall Controller` au lieu de` Routing Slave`\nLa guérison du réseau n'expire plus tôt dans les grands réseaux\nCorrection d'un crash: `supportedCCs n'est pas itérable`. Si cela vous arrive, interrogez à nouveau les appareils concernés.\nAssouplissement des vérifications lorsqu'un rapport est mappé du point de terminaison racine vers les points de terminaison supérieurs\nCertains messages chiffrés précédemment supprimés sont désormais acceptés\nEmpêcher l'interview des nœuds endormis de rester bloqués jusqu'à une réinterview dans certaines circonstances\nAprès un redémarrage, l'état des nœuds endormis est correctement déterminé même s'ils n'ont pas été interrogés complètement avant\nLes variables de notification sont désormais automatiquement inactives après 5 minutes comme prévu, pas après 5 heures\nLes valeurs `deltaTime` et` previousValue` du Meter CC sont maintenant masquées\nCorrection d'un crash pouvant survenir après l'inclusion du nœud\nDes tonnes de fichiers de configuration de périphérique nouveaux et améliorés",
                "it": "Aggiornato alla versione 7 di `zwave-js`\nI nodi con un'intervista completata non vengono più interrogati per tutti i loro valori al riavvio. Di conseguenza, l'adattatore è ora pronto molto più velocemente dopo un riavvio, ma vedrai molti valori gialli fino a quando i dispositivi non avranno inviato dati aggiornati.\nL'elenco dei dispositivi nella finestra di configurazione ora mostra un tipo migliore per i dispositivi, ad esempio \"Wall Controller\" invece di \"Routing Slave\"\nLa riparazione della rete non si interrompe più presto nelle reti di grandi dimensioni\nRisolto un crash: `supportedCCs non è iterabile`. Se questo accade a te, riesamina i dispositivi interessati.\nRilassati i controlli quando un report viene mappato dall'endpoint radice agli endpoint superiori\nAlcuni messaggi crittografati precedentemente ignorati vengono ora accettati\nEvita che l'intervista dei nodi addormentati rimanga bloccata fino a una nuova intervista in determinate circostanze\nDopo un riavvio, lo stato dei nodi inattivi viene determinato correttamente anche se non sono stati intervistati completamente prima\nLe variabili di notifica ora vengono disattivate automaticamente dopo 5 minuti come previsto, non dopo 5 ore\nI valori `deltaTime` e` previousValue` per Meter CC sono ora nascosti\nRisolto un crash che poteva verificarsi dopo l'inclusione del nodo\nTonnellate di file di configurazione del dispositivo nuovi e migliorati",
                "es": "Actualizado a la versión 7 de `zwave-js`\nLos nodos con una entrevista completada ya no son consultados por todos sus valores al reiniciar. Como resultado, el adaptador ahora está listo mucho más rápido después de un reinicio, pero verá muchos valores amarillos hasta que los dispositivos hayan enviado datos actualizados.\nLa lista de dispositivos en el cuadro de diálogo de configuración ahora muestra un tipo mejor para los dispositivos, por ejemplo, `Controlador de pared` en lugar de` Esclavo de enrutamiento`\nLa recuperación de la red ya no se agota al principio en redes grandes\nSe corrigió un bloqueo: `los CC compatibles no son iterables`. Si esto le sucede a usted, vuelva a entrevistar a los dispositivos afectados.\nSe relajaron las comprobaciones cuando un informe se asigna desde el punto final raíz a puntos finales superiores.\nAhora se aceptan algunos mensajes cifrados que antes se descartaban\nEvitar que la entrevista de los nodos durmientes se atasque hasta una nueva entrevista en determinadas circunstancias\nDespués de un reinicio, los nodos durmientes tienen su estado correctamente determinado incluso si no fueron entrevistados completamente antes\nLas variables de notificación ahora se desactivan automáticamente después de 5 minutos como estaba previsto, no después de 5 horas\nLos valores `deltaTime` y` previousValue` para el CC del medidor ahora están ocultos\nSe corrigió un bloqueo que podía ocurrir después de la inclusión del nodo.\nToneladas de archivos de configuración de dispositivos nuevos y mejorados",
                "pl": "Zaktualizowano do `zwave-js` w wersji 7\nWęzły z zakończonym wywiadem nie są już pytane o wszystkie ich wartości podczas ponownego uruchamiania. W rezultacie adapter jest teraz gotowy znacznie szybciej po ponownym uruchomieniu, ale zobaczysz wiele żółtych wartości, dopóki urządzenia nie wyślą zaktualizowanych danych.\nLista urządzeń w oknie dialogowym konfiguracji wyświetla teraz lepszy typ dla urządzeń, na przykład „Wall Controller” zamiast „Routing Slave”\nW dużych sieciach naprawa sieci nie przekracza już limitu czasu\nNaprawiono awarię: „obsługiwane CCs nie są iterowalne”. Jeśli tak się stanie, ponownie przeprowadź wywiad z urządzeniami, których dotyczy ten problem.\nZłagodzono sprawdzanie, gdy raport zostanie zmapowany z głównego punktu końcowego do wyższych punktów końcowych\nNiektóre zaszyfrowane wiadomości, które zostały wcześniej upuszczone, są teraz akceptowane\nZapobiegaj utknięciu przesłuchania śpiących węzłów do czasu ponownego przesłuchania w określonych okolicznościach\nPo ponownym uruchomieniu stan uśpionych węzłów jest poprawnie określony, nawet jeśli wcześniej nie przeprowadzono z nimi pełnego wywiadu\nZmienne powiadomień są teraz automatycznie bezczynne po 5 minutach, zgodnie z przeznaczeniem, a nie po 5 godzinach\nWartości „deltaTime” i „previousValue” dla CC licznika są teraz ukryte\nNaprawiono awarię, która mogła wystąpić po włączeniu węzła\nMnóstwo nowych i ulepszonych plików konfiguracyjnych urządzeń",
                "zh-cn": "升级到`zwave-js`版本7\n重新启动后，将不再查询已完成采访的节点的所有值。结果，适配器现在可以在重新启动后以更快的速度准备就绪，但是在设备发送更新的数据之前，您会看到许多黄色值。\n现在，配置对话框中的设备列表会为设备显示更好的类型，例如，“墙控制器”而不是“路由从站”。\n在大型网络中，网络修复不再超时\n修复了崩溃：“ supportedCCs不可迭代”。如果您遇到这种情况，请重新采访受影响的设备。\n当报告从根端点映射到更高的端点时，放宽了检查\n现在可以接受以前丢弃的一些加密邮件\n在某些情况下，防止对睡眠节点的访问陷入阻塞，直到重新访问为止\n重新启动后，即使在未完全访问睡眠节点的情况下，也正确确定了睡眠节点的状态\n现在，通知变量会按预期在5分钟后自动空闲，而不是在5小时后\nMeter CC的`deltaTime`和`previousValue`值现已隐藏\n修复了包含节点后可能发生的崩溃\n大量新的和改进的设备配置文件"
            },
            "1.8.12": {
                "en": "Implemented `Scene Actuator Configuration CC` and `Scene Controller Configuration CC`\nFixed an issue where sleeping nodes could block the send queue when it is not yet known whether they support `Wake Up CC`\nFixed a crash that could happen while logging a message while the driver is not ready yet\nFixed a crash that could happen while trying to bootstrap a device that does not respond after inclusion\nThe state value in `Thermostat Fan Mode CC` is now readonly\nConfiguration parameters may now have a unit\nTons of new and improved device configuration files\nUnsolicited reports are no longer incorrectly mapped to all endpoints",
                "de": "Implementiert \"Scene Actuator Configuration CC\" und \"Scene Controller Configuration CC\"\nEs wurde ein Problem behoben, durch das schlafende Knoten die Sendewarteschlange blockieren konnten, wenn noch nicht bekannt ist, ob sie \"Wake Up CC\" unterstützen\nEs wurde ein Absturz behoben, der beim Protokollieren einer Nachricht auftreten konnte, während der Treiber noch nicht bereit war\nEs wurde ein Absturz behoben, der beim Versuch auftreten konnte, ein Gerät zu booten, das nach der Aufnahme nicht reagiert\nDer Statuswert im \"Thermostat-Lüftermodus CC\" ist jetzt schreibgeschützt\nKonfigurationsparameter können jetzt eine Einheit haben\nTonnenweise neue und verbesserte Gerätekonfigurationsdateien\nUnerwünschte Berichte werden nicht mehr allen Endpunkten falsch zugeordnet",
                "ru": "Реализованы CC Конфигурация исполнительного механизма сцены и CC Конфигурация контроллера сцены.\nИсправлена ошибка, из-за которой спящие узлы могли блокировать очередь отправки, когда еще не известно, поддерживают ли они `Wake Up CC`.\nИсправлен сбой, который мог произойти при регистрации сообщения, когда драйвер еще не готов\nИсправлен сбой, который мог произойти при попытке загрузить устройство, которое не отвечает после включения\nЗначение состояния в «Режиме вентилятора термостата CC» теперь доступно только для чтения.\nПараметры конфигурации теперь могут иметь единицу\nТонны новых и улучшенных файлов конфигурации устройства\nНезапрошенные отчеты больше не отображаются неправильно для всех конечных точек.",
                "pt": "Implementado `Configuração de Atuador de Cena CC` e` Configuração de Controlador de Cena CC`\nCorrigido um problema em que os nós em espera podiam bloquear a fila de envio quando ainda não se sabia se eles suportam `Wake Up CC`\nCorrigida uma falha que poderia acontecer ao registrar uma mensagem enquanto o driver ainda não estava pronto\nCorrigida uma falha que poderia acontecer ao tentar inicializar um dispositivo que não respondia após a inclusão\nO valor do estado em `Modo Ventilador do Termostato CC` agora é somente leitura\nOs parâmetros de configuração agora podem ter uma unidade\nToneladas de arquivos de configuração de dispositivos novos e aprimorados\nRelatórios não solicitados não são mais mapeados incorretamente para todos os terminais",
                "nl": "Geïmplementeerd `Scene Actuator Configuratie CC` en` Scene Controller Configuratie CC`\nProbleem opgelost waarbij slapende knooppunten de verzendwachtrij konden blokkeren als het nog niet bekend is of ze `Wake Up CC` ondersteunen\nEen crash verholpen die kon optreden tijdens het loggen van een bericht terwijl de driver nog niet gereed was\nEen crash verholpen die kon optreden tijdens het opstarten van een apparaat dat niet reageert na opname\nDe statuswaarde in `Thermostat Fan Mode CC` is nu alleen-lezen\nConfiguratieparameters kunnen nu een eenheid hebben\nTal van nieuwe en verbeterde apparaatconfiguratiebestanden\nOngevraagde rapporten worden niet langer verkeerd toegewezen aan alle endpoints",
                "fr": "Implémentation de la configuration de l'actionneur de scène CC et de la configuration du contrôleur de scène CC\nCorrection d'un problème où les nœuds en sommeil pouvaient bloquer la file d'attente d'envoi quand on ne sait pas encore s'ils prennent en charge `Wake Up CC`\nCorrection d'un crash pouvant survenir lors de la journalisation d'un message alors que le pilote n'est pas encore prêt\nCorrection d'un crash qui pouvait survenir lors de la tentative de bootstrap d'un appareil qui ne répondait pas après l'inclusion\nLa valeur de l'état dans `Thermostat Fan Mode CC` est maintenant en lecture seule\nLes paramètres de configuration peuvent maintenant avoir une unité\nDes tonnes de fichiers de configuration de périphérique nouveaux et améliorés\nLes rapports non sollicités ne sont plus correctement mappés à tous les points de terminaison",
                "it": "Implementato \"Scene Actuator Configuration CC\" e \"Scene Controller Configuration CC\"\nRisolto un problema per cui i nodi dormienti potevano bloccare la coda di invio quando non è ancora noto se supportano `Wake Up CC`\nRisolto un crash che poteva verificarsi durante la registrazione di un messaggio mentre il driver non era ancora pronto\nRisolto un crash che poteva verificarsi durante il tentativo di bootstrap di un dispositivo che non rispondeva dopo l'inclusione\nIl valore di stato in \"Thermostat Fan Mode CC\" è ora di sola lettura\nI parametri di configurazione possono ora avere un'unità\nTonnellate di file di configurazione del dispositivo nuovi e migliorati\nI rapporti non richiesti non vengono più mappati in modo errato a tutti gli endpoint",
                "es": "Implementado \"Scene Actuator Configuration CC\" y \"Scene Controller Configuration CC\"\nSe solucionó un problema por el cual los nodos durmientes podían bloquear la cola de envío cuando aún no se sabe si son compatibles con `Wake Up CC`\nSe corrigió un bloqueo que podría ocurrir al registrar un mensaje cuando el controlador aún no está listo\nSe corrigió un bloqueo que podría ocurrir al intentar arrancar un dispositivo que no responde después de la inclusión\nEl valor de estado en \"Termostato Fan Mode CC\" ahora es de solo lectura\nLos parámetros de configuración ahora pueden tener una unidad\nToneladas de archivos de configuración de dispositivos nuevos y mejorados\nLos informes no solicitados ya no se asignan incorrectamente a todos los puntos finales",
                "pl": "Zaimplementowano `` Scene Actuator Configuration CC` i `Scene Controller Configuration CC`\nNaprawiono problem polegający na tym, że śpiące węzły mogły blokować kolejkę wysyłania, gdy nie wiadomo jeszcze, czy obsługują funkcję „Wake Up CC”\nNaprawiono awarię, która mogła się zdarzyć podczas rejestrowania wiadomości, gdy sterownik nie jest jeszcze gotowy\nNaprawiono awarię, która mogła się zdarzyć podczas próby załadowania urządzenia, które nie reaguje po włączeniu\nWartość stanu w „Thermostat Fan Mode CC” jest teraz tylko do odczytu\nParametry konfiguracyjne mogą teraz mieć jednostkę\nMnóstwo nowych i ulepszonych plików konfiguracyjnych urządzeń\nNiezamówione raporty nie są już nieprawidłowo mapowane na wszystkie punkty końcowe",
                "zh-cn": "实现了“场景执行器配置CC”和“场景控制器配置CC”\n修复了一个休眠节点可能尚不清楚其是否支持“唤醒CC”的情况下阻塞发送队列的问题。\n修复了驱动程序尚未就绪时记录消息时可能发生的崩溃\n修复了尝试引导包含设备后无响应的设备时可能发生的崩溃\n“恒温风扇模式CC”中的状态值现在为只读\n配置参数现在可以有一个单位\n大量新的和改进的设备配置文件\n不请自来的报告不再错误地映射到所有端点"
            },
            "1.8.11": {
                "en": "Implemented `Thermostat Fan Mode CC` and `Thermostat Fan State CC`\nFixed several sources of crashes\nFixed incorrect detection of secure nodes\nCertain `.hex` firmware files are now parsed correctly\nAdded support for `.bin` firmware files\nAvoid an infinite interview loop when devices don't advertise the end of the parameter list correctly\nSleeping nodes are now immediately marked as ready when restarting from cache\nUnsolicited reports are no longer mapped from the root endpoint to endpoint 1 if that endpoint does not support the CC\nTons of new and improved device configuration files",
                "de": "Implementiert `Thermostat Fan Mode CC` und` Thermostat Fan State CC`\nMehrere Absturzquellen wurden behoben\nFehlerhafte Erkennung sicherer Knoten behoben\nBestimmte \".hex\" -Firmware-Dateien werden jetzt korrekt analysiert\nUnterstützung für \".bin\" -Firmware-Dateien hinzugefügt\nVermeiden Sie eine unendliche Interviewschleife, wenn Geräte das Ende der Parameterliste nicht korrekt ankündigen\nRuhende Knoten werden jetzt beim Neustart aus dem Cache sofort als bereit markiert\nUnaufgeforderte Berichte werden nicht mehr vom Stammendpunkt auf Endpunkt 1 abgebildet, wenn dieser Endpunkt den CC nicht unterstützt\nTonnenweise neue und verbesserte Gerätekonfigurationsdateien",
                "ru": "Реализованы «Режим вентилятора термостата CC» и «Состояние вентилятора термостата CC».\nИсправлено несколько источников сбоев\nИсправлено некорректное определение защищенных узлов\nНекоторые файлы прошивки `.hex` теперь анализируются правильно\nДобавлена поддержка файлов прошивки `.bin`\nИзбегайте бесконечного цикла интервью, когда устройства неправильно объявляют конец списка параметров\nСпящие узлы теперь сразу помечаются как готовые при перезапуске из кеша.\nНезапрошенные отчеты больше не сопоставляются от корневой конечной точки до конечной точки 1, если эта конечная точка не поддерживает CC\nТонны новых и улучшенных файлов конфигурации устройства",
                "pt": "Implementado `Termostato Modo Ventilador CC` e` Termostato Ventilador Estado CC`\nVárias fontes de falhas corrigidas\nDetecção incorreta corrigida de nós seguros\nCertos arquivos de firmware `.hex` agora são analisados corretamente\nAdicionado suporte para arquivos de firmware `.bin`\nEvite um loop infinito de entrevistas quando os dispositivos não anunciam o fim da lista de parâmetros corretamente\nOs nós em suspensão agora são imediatamente marcados como prontos ao reiniciar do cache\nOs relatórios não solicitados não são mais mapeados do ponto de extremidade raiz para o ponto de extremidade 1 se esse ponto de extremidade não suportar o CC\nToneladas de arquivos de configuração de dispositivos novos e aprimorados",
                "nl": "Geïmplementeerd 'Thermostat Fan Mode CC' en 'Thermostat Fan State CC'\nVerschillende bronnen van crashes opgelost\nOnjuiste detectie van beveiligde knooppunten opgelost\nBepaalde `.hex` firmwarebestanden worden nu correct geparseerd\nOndersteuning toegevoegd voor `.bin` firmwarebestanden\nVermijd een oneindige interviewlus wanneer apparaten het einde van de parameterlijst niet correct adverteren\nSlapende knooppunten worden nu onmiddellijk gemarkeerd als gereed bij het opnieuw opstarten vanuit de cache\nOngevraagde rapporten worden niet langer toegewezen van het root-eindpunt naar eindpunt 1 als dat eindpunt de CC niet ondersteunt\nTal van nieuwe en verbeterde apparaatconfiguratiebestanden",
                "fr": "Mise en œuvre du «Mode de ventilateur du thermostat CC» et «État du ventilateur du thermostat CC»\nCorrection de plusieurs sources de plantages\nCorrection de la détection incorrecte des nœuds sécurisés\nCertains fichiers de firmware `.hex` sont maintenant analysés correctement\nAjout de la prise en charge des fichiers du firmware `.bin`\nÉvitez une boucle d'interview infinie lorsque les appareils n'annoncent pas correctement la fin de la liste de paramètres\nLes nœuds en veille sont désormais immédiatement marqués comme prêts lors du redémarrage à partir du cache\nLes rapports non sollicités ne sont plus mappés du point de terminaison racine au point de terminaison 1 si ce point de terminaison ne prend pas en charge le CC\nDes tonnes de fichiers de configuration de périphérique nouveaux et améliorés",
                "it": "Implementato \"Thermostat Fan Mode CC\" e \"Thermostat Fan State CC\"\nRisolte diverse fonti di arresti anomali\nRisolto il problema con il rilevamento errato dei nodi protetti\nAlcuni file del firmware \".hex\" vengono ora analizzati correttamente\nAggiunto supporto per i file del firmware `.bin`\nEvita un ciclo di interviste infinito quando i dispositivi non annunciano correttamente la fine dell'elenco dei parametri\nI nodi in sospensione ora vengono immediatamente contrassegnati come pronti al riavvio dalla cache\nI rapporti non richiesti non vengono più mappati dall'endpoint radice all'endpoint 1 se tale endpoint non supporta CC\nTonnellate di file di configurazione del dispositivo nuovi e migliorati",
                "es": "Implementado \"Termostato Fan Mode CC\" y \"Termostato Fan State CC\"\nSe corrigieron varias fuentes de fallas.\nSe corrigió la detección incorrecta de nodos seguros.\nCiertos archivos de firmware `.hex` ahora se analizan correctamente\nSe agregó soporte para archivos de firmware `.bin`\nEvite un ciclo de entrevista infinito cuando los dispositivos no anuncian correctamente el final de la lista de parámetros\nLos nodos durmientes ahora se marcan inmediatamente como listos cuando se reinicia desde la caché\nLos informes no solicitados ya no se asignan desde el punto final raíz al punto final 1 si ese punto final no es compatible con CC\nToneladas de archivos de configuración de dispositivos nuevos y mejorados",
                "pl": "Zaimplementowano „Thermostat Fan Mode CC” i „Thermostat Fan State CC”\nNaprawiono kilka źródeł awarii\nNaprawiono nieprawidłowe wykrywanie bezpiecznych węzłów\nNiektóre pliki oprogramowania sprzętowego `.hex` są teraz poprawnie analizowane\nDodano obsługę plików firmware'u `.bin`\nUnikaj nieskończonej pętli wywiadów, gdy urządzenia nie ogłaszają poprawnie końca listy parametrów\nWęzły uśpione są teraz natychmiast oznaczane jako gotowe podczas ponownego uruchamiania z pamięci podręcznej\nNiezamawiane raporty nie są już mapowane z głównego punktu końcowego do punktu końcowego 1, jeśli ten punkt końcowy nie obsługuje CC\nMnóstwo nowych i ulepszonych plików konfiguracyjnych urządzeń",
                "zh-cn": "实现了“温控器风扇模式CC”和“温控器风扇状态CC”\n修复了多个崩溃原因\n修复了对安全节点的错误检测\n现在可以正确解析某些`.hex`固件文件\n添加了对.bin固件文件的支持\n当设备未正确宣传参数列表的结尾时，避免无限的采访循环\n现在，从高速缓存重新启动时，睡眠节点会立即标记为就绪\n如果该端点不支持CC，则不再将未经请求的报告从根端点映射到端点1\n大量新的和改进的设备配置文件"
            },
            "1.8.10": {
                "en": "The startup should now be faster, especially if there are many sleeping devices\nFixed an issue where devices were incorrectly displayed as secure\nImproved support for devices that use the legacy `Alarm CC`\nSeveral improvements for Zooz and GE devices",
                "de": "Der Start sollte jetzt schneller sein, insbesondere wenn viele Schlafgeräte vorhanden sind\nEs wurde ein Problem behoben, bei dem Geräte fälschlicherweise als sicher angezeigt wurden\nVerbesserte Unterstützung für Geräte, die das ältere \"Alarm CC\" verwenden\nMehrere Verbesserungen für Zooz- und GE-Geräte",
                "ru": "Теперь запуск должен быть быстрее, особенно если спящих устройств много.\nИсправлена проблема, из-за которой устройства некорректно отображались как безопасные.\nУлучшена поддержка устройств, использующих устаревшую версию Alarm CC.\nНесколько улучшений для устройств Zooz и GE",
                "pt": "A inicialização agora deve ser mais rápida, especialmente se houver muitos dispositivos em espera\nCorrigido um problema em que os dispositivos eram exibidos incorretamente como seguros\nSuporte aprimorado para dispositivos que usam o legado `Alarm CC`\nVárias melhorias para dispositivos Zooz e GE",
                "nl": "Het opstarten zou nu sneller moeten zijn, vooral als er veel slaapapparaten zijn\nProbleem opgelost waarbij apparaten ten onrechte als veilig werden weergegeven\nVerbeterde ondersteuning voor apparaten die de oude `Alarm CC` gebruiken\nDiverse verbeteringen voor Zooz- en GE-apparaten",
                "fr": "Le démarrage devrait maintenant être plus rapide, surtout s'il y a de nombreux appareils en veille\nCorrection d'un problème où les appareils n'étaient pas correctement affichés comme sécurisés\nAmélioration de la prise en charge des appareils utilisant l'ancien `Alarm CC`\nPlusieurs améliorations pour les appareils Zooz et GE",
                "it": "L'avvio dovrebbe ora essere più veloce, soprattutto se ci sono molti dispositivi in sospensione\nRisolto un problema per cui i dispositivi venivano visualizzati erroneamente come protetti\nSupporto migliorato per i dispositivi che utilizzano il vecchio \"Alarm CC\"\nDiversi miglioramenti per i dispositivi Zooz e GE",
                "es": "El inicio ahora debería ser más rápido, especialmente si hay muchos dispositivos para dormir\nSe solucionó un problema por el cual los dispositivos se mostraban incorrectamente como seguros\nSoporte mejorado para dispositivos que usan el antiguo \"Alarm CC\"\nVarias mejoras para dispositivos Zooz y GE",
                "pl": "Uruchamianie powinno być teraz szybsze, zwłaszcza jeśli jest wiele urządzeń do spania\nNaprawiono błąd, w wyniku którego urządzenia były nieprawidłowo wyświetlane jako bezpieczne\nUlepszona obsługa urządzeń korzystających ze starszej wersji „Alarm CC”\nKilka ulepszeń dla urządzeń Zooz i GE",
                "zh-cn": "现在启动应该会更快，尤其是在有许多睡眠设备的情况下\n修复了将设备错误地显示为安全的问题\n改进了对使用旧版“警报CC”的设备的支持\nZooz和GE设备的多项改进"
            },
            "1.8.9": {
                "en": "Labels for the Meter CC were improved to be unique\nMany config files were added and updated\nImproved compatibility with some devices, notably `ID Lock 150`, `Vision Security ZD2102-5`, `HomeSeer WD200+`\n`currentValue` and similar values are now updated immediately when a set-type command succeeds. Verification is done after a short delay.",
                "de": "Die Beschriftungen für das Messgerät CC wurden verbessert, um eindeutig zu sein\nViele Konfigurationsdateien wurden hinzugefügt und aktualisiert\nVerbesserte Kompatibilität mit einigen Geräten, insbesondere \"ID Lock 150\", \"Vision Security ZD2102-5\", \"HomeSeer WD200 +\"\n`currentValue` und ähnliche Werte werden jetzt sofort aktualisiert, wenn ein Befehl vom Typ set erfolgreich ist. Die Überprüfung erfolgt nach einer kurzen Verzögerung.",
                "ru": "Этикетки для Meter CC были улучшены и стали уникальными.\nБыло добавлено и обновлено множество файлов конфигурации\nУлучшена совместимость с некоторыми устройствами, в частности, ID Lock 150, Vision Security ZD2102-5, HomeSeer WD200 +.\n`currentValue` и подобные значения теперь обновляются сразу после успешного выполнения команды set-type. Проверка выполняется после небольшой задержки.",
                "pt": "As etiquetas para o Medidor CC foram aprimoradas para serem exclusivas\nMuitos arquivos de configuração foram adicionados e atualizados\nCompatibilidade aprimorada com alguns dispositivos, principalmente `ID Lock 150`,` Vision Security ZD2102-5`, `HomeSeer WD200 +`\n`currentValue` e valores semelhantes agora são atualizados imediatamente quando um comando set-type é bem-sucedido. A verificação é feita após um pequeno atraso.",
                "nl": "Labels voor de Meter CC zijn verbeterd om uniek te zijn\nEr zijn veel configuratiebestanden toegevoegd en bijgewerkt\nVerbeterde compatibiliteit met sommige apparaten, met name `ID Lock 150`,` Vision Security ZD2102-5`, `HomeSeer WD200 +`\n`currentValue` en vergelijkbare waarden worden nu onmiddellijk bijgewerkt wanneer een set-type commando slaagt. Verificatie vindt plaats na een korte vertraging.",
                "fr": "Les étiquettes du Meter CC ont été améliorées pour être uniques\nDe nombreux fichiers de configuration ont été ajoutés et mis à jour\nAmélioration de la compatibilité avec certains appareils, notamment «ID Lock 150», «Vision Security ZD2102-5», «HomeSeer WD200 +»\n`currentValue` et les valeurs similaires sont maintenant mises à jour immédiatement lorsqu'une commande de type set réussit. La vérification est effectuée après un court délai.",
                "it": "Le etichette per Meter CC sono state migliorate per essere uniche\nMolti file di configurazione sono stati aggiunti e aggiornati\nMigliore compatibilità con alcuni dispositivi, in particolare `ID Lock 150`,` Vision Security ZD2102-5`, `HomeSeer WD200 +`\n\"currentValue\" e valori simili vengono ora aggiornati immediatamente quando un comando di tipo set riesce. La verifica viene eseguita dopo un breve ritardo.",
                "es": "Se mejoraron las etiquetas del Meter CC para que sean únicas\nSe agregaron y actualizaron muchos archivos de configuración\nCompatibilidad mejorada con algunos dispositivos, en particular `ID Lock 150`,` Vision Security ZD2102-5`, `HomeSeer WD200 +`\n`currentValue` y valores similares ahora se actualizan inmediatamente cuando un comando de tipo set tiene éxito. La verificación se realiza tras un breve retraso.",
                "pl": "Etykiety CC miernika zostały poprawione, aby były unikalne\nWiele plików konfiguracyjnych zostało dodanych i zaktualizowanych\nPoprawiona kompatybilność z niektórymi urządzeniami, w szczególności z „ID Lock 150”, „Vision Security ZD2102-5”, „HomeSeer WD200 +„\n„currentValue” i podobne wartości są teraz aktualizowane natychmiast po pomyślnym wykonaniu polecenia set-type. Weryfikacja jest wykonywana po krótkim czasie.",
                "zh-cn": "Meter CC的标签经过改进，变得独一无二\n许多配置文件已添加和更新\n改进了与某些设备的兼容性，尤其是“ ID锁150”，“视觉安全ZD2102-5”，“ HomeSeer WD200 +”\n现在，当set-type命令成功执行时，会立即更新currentValue和类似的值。短暂的延迟后将完成验证。"
            },
            "1.8.8": {
                "en": "Fixed an issue where communication with sleeping secure nodes could get stuck\nAfter changing a value, the verification of the new value happens with a larger delay to avoid capturing intermediate and outdated values\nSeveral hundred device configuration files were added",
                "de": "Es wurde ein Problem behoben, durch das die Kommunikation mit schlafenden sicheren Knoten hängen bleiben konnte\nNach dem Ändern eines Werts erfolgt die Überprüfung des neuen Werts mit einer größeren Verzögerung, um zu vermeiden, dass Zwischen- und veraltete Werte erfasst werden\nEs wurden mehrere hundert Gerätekonfigurationsdateien hinzugefügt",
                "ru": "Исправлена ошибка, из-за которой связь со спящими защищенными узлами могла зависнуть.\nПосле изменения значения проверка нового значения происходит с большей задержкой, чтобы избежать захвата промежуточных и устаревших значений.\nДобавлено несколько сотен файлов конфигурации устройства.",
                "pt": "Corrigido um problema em que a comunicação com nós seguros em hibernação poderia travar\nApós a alteração de um valor, a verificação do novo valor ocorre com maior retardo para evitar a captura de valores intermediários e desatualizados\nVárias centenas de arquivos de configuração de dispositivo foram adicionados",
                "nl": "Probleem opgelost waarbij communicatie met slapende beveiligde knooppunten kon vastlopen\nNadat een waarde is gewijzigd, gebeurt de verificatie van de nieuwe waarde met een grotere vertraging om te voorkomen dat tussenliggende en verouderde waarden worden vastgelegd\nEr zijn honderden apparaatconfiguratiebestanden toegevoegd",
                "fr": "Correction d'un problème où la communication avec les nœuds sécurisés endormis pouvait rester bloquée\nAprès avoir changé une valeur, la vérification de la nouvelle valeur se produit avec un délai plus long pour éviter de capturer des valeurs intermédiaires et obsolètes\nPlusieurs centaines de fichiers de configuration de périphérique ont été ajoutés",
                "it": "Risolto un problema per cui la comunicazione con i nodi protetti dormienti poteva bloccarsi\nDopo aver modificato un valore, la verifica del nuovo valore avviene con un ritardo maggiore per evitare di acquisire valori intermedi e non aggiornati\nSono state aggiunte diverse centinaia di file di configurazione del dispositivo",
                "es": "Se solucionó un problema por el cual la comunicación con los nodos seguros dormidos podía atascarse\nDespués de cambiar un valor, la verificación del nuevo valor ocurre con un retraso mayor para evitar capturar valores intermedios y desactualizados\nSe agregaron varios cientos de archivos de configuración de dispositivos",
                "pl": "Naprawiono błąd, w wyniku którego komunikacja z uśpionymi bezpiecznymi węzłami mogła się zaciąć\nPo zmianie wartości weryfikacja nowej wartości odbywa się z większym opóźnieniem, aby uniknąć przechwytywania wartości pośrednich i nieaktualnych\nDodano kilkaset plików konfiguracyjnych urządzeń",
                "zh-cn": "修复了与睡眠的安全节点的通信可能卡住的问题\n更改值后，对新值的验证会延迟较大的时间，以避免捕获中间值和过时的值\n添加了数百个设备配置文件"
            },
            "1.8.7": {
                "en": "The scene ID of `Scene Activation CC` now gets reset automatically\nFixed an error that could occur while configuring associations\nFixed two potential sources of crashes\nThe values of the root endpoint of some legacy devices are now correctly updated\nAdded support for `Aeotec aerQ ZWA009-A` US/Canada/Mexico version\nFixed invalid parameter options in many config files",
                "de": "Die Szenen-ID von \"Scene Activation CC\" wird jetzt automatisch zurückgesetzt\nEs wurde ein Fehler behoben, der beim Konfigurieren von Zuordnungen auftreten konnte\nZwei mögliche Absturzquellen wurden behoben\nDie Werte des Root-Endpunkts einiger älterer Geräte werden jetzt korrekt aktualisiert\nUnterstützung für `Aeotec aerQ ZWA009-A` Version US / Kanada / Mexiko hinzugefügt\nIn vielen Konfigurationsdateien wurden ungültige Parameteroptionen behoben",
                "ru": "Идентификатор сцены Scene Activation CC теперь сбрасывается автоматически.\nИсправлена ошибка, которая могла возникнуть при настройке ассоциаций\nИсправлены два потенциальных источника сбоев.\nЗначения корневой конечной точки некоторых устаревших устройств теперь правильно обновляются.\nДобавлена поддержка версии Aeotec aerQ ZWA009-A для США / Канады / Мексики.\nИсправлены неверные параметры параметров во многих файлах конфигурации",
                "pt": "A ID da cena de `Scene Activation CC` agora é redefinida automaticamente\nCorrigido um erro que poderia ocorrer ao configurar associações\nConsertou duas fontes potenciais de falhas\nOs valores do endpoint raiz de alguns dispositivos legados agora são atualizados corretamente\nAdicionado suporte para a versão `Aeotec aerQ ZWA009-A` EUA / Canadá / México\nOpções de parâmetros inválidos corrigidos em muitos arquivos de configuração",
                "nl": "De scène-ID van `Scene Activation CC` wordt nu automatisch gereset\nEen fout verholpen die kon optreden tijdens het configureren van koppelingen\nTwee mogelijke bronnen van crashes opgelost\nDe waarden van het root-endpoint van sommige legacy-apparaten zijn nu correct bijgewerkt\nOndersteuning toegevoegd voor `Aeotec aerQ ZWA009-A` versie VS / Canada / Mexico\nOngeldige parameteropties in veel configuratiebestanden opgelost",
                "fr": "L'ID de scène de `Scene Activation CC` est maintenant réinitialisé automatiquement\nCorrection d'une erreur pouvant survenir lors de la configuration des associations\nCorrection de deux sources potentielles de plantages\nLes valeurs du point de terminaison racine de certains appareils hérités sont désormais correctement mises à jour\nAjout de la prise en charge de la version `Aeotec aerQ ZWA009-A` États-Unis / Canada / Mexique\nCorrection des options de paramètres invalides dans de nombreux fichiers de configuration",
                "it": "L'ID scena di \"Scene Activation CC\" ora viene ripristinato automaticamente\nRisolto un errore che poteva verificarsi durante la configurazione delle associazioni\nRisolte due potenziali fonti di arresti anomali\nI valori dell'endpoint radice di alcuni dispositivi legacy sono ora aggiornati correttamente\nAggiunto supporto per la versione `Aeotec aerQ ZWA009-A` per Stati Uniti / Canada / Messico\nRisolte opzioni di parametri non validi in molti file di configurazione",
                "es": "El ID de escena de `Scene Activation CC` ahora se restablece automáticamente\nSe corrigió un error que podía ocurrir al configurar asociaciones.\nSe corrigieron dos posibles fuentes de fallas.\nLos valores del punto final raíz de algunos dispositivos heredados ahora se actualizan correctamente\nSe agregó soporte para la versión `Aeotec aerQ ZWA009-A` para EE. UU., Canadá y México\nSe corrigieron las opciones de parámetros no válidos en muchos archivos de configuración",
                "pl": "Identyfikator sceny `Scene Activation CC` jest teraz resetowany automatycznie\nNaprawiono błąd, który mógł wystąpić podczas konfigurowania skojarzeń\nNaprawiono dwa potencjalne źródła awarii\nWartości głównego punktu końcowego niektórych starszych urządzeń są teraz poprawnie aktualizowane\nDodano obsługę wersji `Aeotec aerQ ZWA009-A` US / Canada / Mexico\nNaprawiono nieprawidłowe opcje parametrów w wielu plikach konfiguracyjnych",
                "zh-cn": "现在，“场景激活CC”的场景ID会自动重置\n修复了配置关联时可能发生的错误\n修复了两个潜在的崩溃原因\n现在，某些旧设备的根端点的值已正确更新\n添加了对`Aeotec aerQ ZWA009-A`美国/加拿大/墨西哥版本的支持\n修复了许多配置文件中的无效参数选项"
            },
            "1.8.6": {
                "en": "Many, many changes... See https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md#changelog for details",
                "de": "Viele, viele Änderungen ... Weitere Informationen finden Sie unter https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md#changelog",
                "ru": "Много-много изменений ... Подробнее см. Https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md#changelog.",
                "pt": "Muitas, muitas mudanças ... Consulte https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md#changelog para obter detalhes",
                "nl": "Heel veel veranderingen ... Zie https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md#changelog voor details",
                "fr": "Beaucoup, beaucoup de changements ... Voir https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md#changelog pour plus de détails",
                "it": "Molte, molte modifiche ... Vedi https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md#changelog per i dettagli",
                "es": "Muchos, muchos cambios ... Consulte https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md#changelog para obtener más detalles",
                "pl": "Wiele, wiele zmian ... Zobacz https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md#changelog po szczegóły",
                "zh-cn": "许多很多变化...有关详细信息，请参见https://github.com/zwave-js/node-zwave-js/blob/master/CHANGELOG.md#changelog"
            },
            "1.8.5": {
                "en": "The interview is no longer aborted when a device does not respond to the Wakeup Capability query\nFixed a crash that could happen when compressing the value DB with an existing backup file\nAdded and updated several config files",
                "de": "Das Interview wird nicht mehr abgebrochen, wenn ein Gerät nicht auf die Wakeup Capability-Abfrage antwortet\nEs wurde ein Absturz behoben, der beim Komprimieren der Wert-DB mit einer vorhandenen Sicherungsdatei auftreten konnte\nMehrere Konfigurationsdateien hinzugefügt und aktualisiert",
                "ru": "Интервью больше не прерывается, если устройство не отвечает на запрос возможности пробуждения.\nИсправлен сбой, который мог произойти при сжатии значения DB с существующим файлом резервной копии\nДобавлены и обновлены несколько файлов конфигурации",
                "pt": "A entrevista não é mais abortada quando um dispositivo não responde à consulta de capacidade de despertar\nCorrigida uma falha que poderia acontecer ao compactar o valor DB com um arquivo de backup existente\nAdicionados e atualizados vários arquivos de configuração",
                "nl": "Het interview wordt niet langer afgebroken wanneer een apparaat niet reageert op de Wakeup Capability-vraag\nEen crash verholpen die kon optreden bij het comprimeren van de waarde DB met een bestaand back-upbestand\nDiverse configuratiebestanden toegevoegd en bijgewerkt",
                "fr": "L'interview n'est plus interrompue lorsqu'un appareil ne répond pas à la requête de capacité de réveil\nCorrection d'un plantage pouvant survenir lors de la compression de la base de données de valeur avec un fichier de sauvegarde existant\nAjout et mise à jour de plusieurs fichiers de configuration",
                "it": "L'intervista non viene più interrotta quando un dispositivo non risponde alla query sulla capacità di risveglio\nRisolto un crash che poteva verificarsi durante la compressione del valore DB con un file di backup esistente\nAggiunti e aggiornati diversi file di configurazione",
                "es": "La entrevista ya no se cancela cuando un dispositivo no responde a la consulta de capacidad de activación.\nSe corrigió un bloqueo que podía ocurrir al comprimir la base de datos de valor con un archivo de respaldo existente\nSe agregaron y actualizaron varios archivos de configuración",
                "pl": "Rozmowa kwalifikacyjna nie jest już przerywana, gdy urządzenie nie odpowiada na zapytanie o funkcję Wakeup\nNaprawiono awarię, która mogła wystąpić podczas kompresowania wartości DB z istniejącym plikiem kopii zapasowej\nDodano i zaktualizowałem kilka plików konfiguracyjnych",
                "zh-cn": "当设备不响应唤醒功能查询时，访问不再中止\n修复了使用现有备份文件压缩值数据库时可能发生的崩溃\n添加并更新了几个配置文件"
            },
            "1.8.4": {
                "en": "Logfiles are created again",
                "de": "Protokolldateien werden erneut erstellt",
                "ru": "Лог-файлы создаются снова",
                "pt": "Os arquivos de log são criados novamente",
                "nl": "Logfiles worden opnieuw aangemaakt",
                "fr": "Les fichiers journaux sont à nouveau créés",
                "it": "I file di registro vengono creati di nuovo",
                "es": "Los archivos de registro se crean de nuevo",
                "pl": "Pliki dziennika są tworzone ponownie",
                "zh-cn": "再次创建日志文件"
            },
            "1.8.3": {
                "en": "Added a config file for `Technisat Dimmer and series switch`\nThe `level low` property of the `Battery CC` is now called `Battery Level Low`\nFixed a bug where the wrong `Binary Sensor` types were requested. To fix this, affected devices must be re-interviewed\nThe retry strategy for sending commands to nodes has been revised. This should improve communication with devices that take long to respond.\nSome event values like `Central Scene CC` scenes are now automatically cleared after 1 second.",
                "de": "Es wurde eine Konfigurationsdatei für \"Technisat Dimmer and Series Switch\" hinzugefügt\nDie Eigenschaft \"Level Low\" des \"Battery CC\" wird jetzt als \"Battery Level Low\" bezeichnet\nEs wurde ein Fehler behoben, durch den die falschen \"Binärsensor\" -Typen angefordert wurden. Um dies zu beheben, müssen betroffene Geräte erneut befragt werden\nDie Wiederholungsstrategie zum Senden von Befehlen an Knoten wurde überarbeitet. Dies sollte die Kommunikation mit Geräten verbessern, deren Reaktion lange dauert.\nEinige Ereigniswerte wie \"Central Scene CC\" -Szenen werden jetzt nach 1 Sekunde automatisch gelöscht.",
                "ru": "Добавлен файл конфигурации для `Technisat Dimmer and series switch`\nСвойство level low для Battery CC теперь называется Battery Level Low.\nИсправлена ошибка, из-за которой запрашивались неправильные типы двоичных датчиков. Чтобы исправить это, необходимо повторно опросить затронутые устройства.\nСтратегия повторных попыток отправки команд узлам была пересмотрена. Это должно улучшить связь с устройствами, которые долго не реагируют.\nНекоторые значения событий, такие как сцены «Central Scene CC», теперь автоматически очищаются через 1 секунду.",
                "pt": "Adicionado um arquivo de configuração para `Technisat Dimmer e troca de série`\nA propriedade `level low` do` Battery CC` agora é chamada de `Battery Level Low`\nCorrigido um bug onde os tipos errados de `Binary Sensor` eram solicitados. Para corrigir isso, os dispositivos afetados devem ser entrevistados novamente\nA estratégia de nova tentativa para enviar comandos aos nós foi revisada. Isso deve melhorar a comunicação com dispositivos que demoram muito para responder.\nAlguns valores de eventos como cenas de `Cena Central CC` agora são apagados automaticamente após 1 segundo.",
                "nl": "Een configuratiebestand toegevoegd voor `Technisat Dimmer and series switch`\nDe `level low` eigenschap van de` Battery CC` heet nu `Battery Level Low`\nEen bug verholpen waarbij de verkeerde 'Binaire Sensor'-typen werden aangevraagd. Om dit op te lossen, moeten de betrokken apparaten opnieuw worden geïnterviewd\nDe strategie voor opnieuw proberen voor het verzenden van opdrachten naar knooppunten is herzien. Dit zou de communicatie moeten verbeteren met apparaten die lang nodig hebben om te reageren.\nSommige gebeurteniswaarden zoals 'Central Scene CC'-scènes worden nu automatisch na 1 seconde gewist.",
                "fr": "Ajout d'un fichier de configuration pour `Technisat Dimmer and series switch`\nLa propriété `niveau bas` de` Battery CC` est maintenant appelée `Battery Level Low`\nCorrection d'un bug où les mauvais types de `Binary Sensor` étaient demandés. Pour résoudre ce problème, les appareils concernés doivent être réinterrogés\nLa stratégie de nouvelle tentative d'envoi de commandes aux nœuds a été revue. Cela devrait améliorer la communication avec les appareils qui mettent du temps à répondre.\nCertaines valeurs d'événement telles que les scènes «Central Scene CC» sont désormais automatiquement effacées après 1 seconde.",
                "it": "Aggiunto un file di configurazione per `Technisat Dimmer e switch di serie`\nLa proprietà `level low` di` Battery CC` è ora chiamata `Battery Level Low`\nRisolto un bug per cui venivano richiesti i tipi di \"sensore binario\" errati. Per risolvere questo problema, i dispositivi interessati devono essere riesaminati\nLa strategia di ripetizione dei tentativi per l'invio di comandi ai nodi è stata rivista. Ciò dovrebbe migliorare la comunicazione con i dispositivi che impiegano molto tempo a rispondere.\nAlcuni valori di eventi come le scene di \"Central Scene CC\" vengono ora cancellati automaticamente dopo 1 secondo.",
                "es": "Se agregó un archivo de configuración para `Technisat Dimmer and series switch`\nLa propiedad de \"nivel bajo\" de la \"Batería CC\" ahora se llama \"Nivel de batería bajo\"\nSe corrigió un error por el que se solicitaban los tipos de \"Sensor binario\" incorrectos. Para solucionar este problema, los dispositivos afectados deben volver a ser entrevistados\nSe ha revisado la estrategia de reintento para enviar comandos a los nodos. Esto debería mejorar la comunicación con los dispositivos que tardan en responder.\nAlgunos valores de eventos como las escenas de \"Central Scene CC\" ahora se borran automáticamente después de 1 segundo.",
                "pl": "Dodano plik konfiguracyjny dla `Technisat Dimmer and series switch`\nWłaściwość „niski poziom” elementu „Bateria CC” nazywa się teraz „Niski poziom baterii”\nNaprawiono błąd, który powodował, że żądano niewłaściwych typów czujników binarnych. Aby to naprawić, należy ponownie przesłuchać urządzenia, których dotyczy problem\nPoprawiono strategię ponawiania wysyłania poleceń do węzłów. Powinno to poprawić komunikację z urządzeniami, które długo reagują.\nNiektóre wartości zdarzeń, takie jak sceny `Central Scene CC`, są teraz automatycznie usuwane po 1 sekundzie.",
                "zh-cn": "为“ Technisat调光器和系列开关”添加了配置文件\n“ Battery CC”的“ level low”属性现在称为“ Battery Level Low”\n修复了错误的“二进制传感器”类型要求的错误。要解决此问题，必须重新采访受影响的设备\n用于向节点发送命令的重试策略已修改。这将改善与需要很长时间响应的设备的通信。\n现在，某些事件值（例如“ Central Scene CC”场景）将在1秒后自动清除。"
            },
            "1.8.2": {
                "en": "When a node does not respond because it is asleep, the message is no longer discarded. This should improve the interview behavior of sleeping nodes.\nAdded new config files\nFixed wrong label and description for Z-Wave.Me UZB\nAdded missing label to Binary Sensor CC\nAdded missing % unit to Battery level\nThe `targetValue` for the `Binary Switch`, `Multilevel Switch` and `Basic` CCs is no longer removed when a report without one is received\nSome more interview timeouts are ignored",
                "de": "Wenn ein Knoten nicht antwortet, weil er schläft, wird die Nachricht nicht mehr verworfen. Dies sollte das Interviewverhalten von schlafenden Knoten verbessern.\nNeue Konfigurationsdateien hinzugefügt\nFalsche Bezeichnung und Beschreibung für Z-Wave.Me UZB behoben\nFehlendes Etikett zum Binärsensor CC hinzugefügt\nFehlende% -Einheit zum Batteriestand hinzugefügt\nDer \"targetValue\" für die CCs \"Binary Switch\", \"Multilevel Switch\" und \"Basic\" wird nicht mehr entfernt, wenn ein Bericht ohne einen empfangen wird\nEinige weitere Interview-Timeouts werden ignoriert",
                "ru": "Когда узел не отвечает, потому что он спит, сообщение больше не отбрасывается. Это должно улучшить поведение спящих узлов при опросе.\nДобавлены новые файлы конфигурации\nИсправлена неправильная метка и описание для Z-Wave.Me UZB\nДобавлена недостающая метка для двоичного датчика CC\nДобавлен недостающий% юнита на уровень заряда батареи\nTargetValue для CC Binary Switch, Multilevel Switch и Basic больше не удаляется, если получен отчет без такового.\nЕще несколько тайм-аутов интервью игнорируются",
                "pt": "Quando um nó não responde porque está adormecido, a mensagem não é mais descartada. Isso deve melhorar o comportamento da entrevista de nós adormecidos.\nAdicionados novos arquivos de configuração\nRótulo e descrição incorretos corrigidos para Z-Wave.Me UZB\nAdicionada etiqueta ausente ao sensor binário CC\nAdicionada% unidade ausente ao nível da bateria\nO `targetValue` para o` Binary Switch`, `Multilevel Switch` e` Basic` CCs não é mais removido quando um relatório sem um é recebido\nMais alguns tempos limite de entrevista são ignorados",
                "nl": "Wanneer een knooppunt niet reageert omdat het slaapt, wordt het bericht niet langer weggegooid. Dit zou het interviewgedrag van slapende knooppunten moeten verbeteren.\nNieuwe configuratiebestanden toegevoegd\nVerkeerd label en beschrijving voor Z-Wave.Me UZB opgelost\nOntbrekend label toegevoegd aan binaire sensor CC\nOntbrekende% -eenheid toegevoegd aan batterijniveau\nDe `targetValue` voor de` Binary Switch`, `Multilevel Switch` en` Basic` CCs wordt niet langer verwijderd wanneer een rapport zonder een rapport wordt ontvangen\nSommige meer time-outs voor het interview worden genegeerd",
                "fr": "Lorsqu'un nœud ne répond pas parce qu'il est en veille, le message n'est plus ignoré. Cela devrait améliorer le comportement d'entretien des nœuds endormis.\nAjout de nouveaux fichiers de configuration\nCorrection d'une étiquette et d'une description erronées pour Z-Wave.Me UZB\nAjout d'une étiquette manquante au capteur binaire CC\nAjout de l'unité% manquante au niveau de la batterie\nLa `targetValue` pour les CC` Binary Switch`, `Multilevel Switch` et` Basic` n'est plus supprimée lorsqu'un rapport sans un est reçu\nD'autres délais d'interrogation sont ignorés",
                "it": "Quando un nodo non risponde perché è addormentato, il messaggio non viene più eliminato. Ciò dovrebbe migliorare il comportamento dell'intervista dei nodi addormentati.\nAggiunti nuovi file di configurazione\nCorretta etichetta e descrizione errate per Z-Wave.Me UZB\nAggiunta etichetta mancante al sensore binario CC\nAggiunta unità% mancante al livello della batteria\nIl `targetValue` per i CC` Binary Switch`, `Multilevel Switch` e` Basic` non viene più rimosso quando viene ricevuto un report senza uno\nAltri timeout dell'intervista vengono ignorati",
                "es": "Cuando un nodo no responde porque está dormido, el mensaje ya no se descarta. Esto debería mejorar el comportamiento de la entrevista de los nodos durmientes.\nSe agregaron nuevos archivos de configuración\nSe corrigió la etiqueta y descripción incorrectas para Z-Wave.Me UZB\nSe agregó la etiqueta faltante al CC del sensor binario\nSe agregó la unidad% faltante al nivel de la batería\nEl `targetValue` para los CC de` Binary Switch`, `Multilevel Switch` y` Basic` ya no se elimina cuando se recibe un informe sin uno\nSe ignoran algunos tiempos de espera de entrevistas más",
                "pl": "Gdy węzeł nie odpowiada, ponieważ śpi, wiadomość nie jest już odrzucana. Powinno to poprawić zachowanie podczas przesłuchiwania uśpionych węzłów.\nDodano nowe pliki konfiguracyjne\nNaprawiono błędną etykietę i opis dla Z-Wave.Me UZB\nDodano brakującą etykietę do Binary Sensor CC\nDodano brakujące% jednostki do poziomu baterii\n„TargetValue” dla „Binary Switch”, „Multilevel Switch” i „Basic” CCs nie jest już usuwana po otrzymaniu raportu bez niego\nNiektóre inne limity czasu rozmowy są ignorowane",
                "zh-cn": "当节点因为处于睡眠状态而没有响应时，该消息将不再被丢弃。这应该改善睡眠节点的访问行为。\n添加了新的配置文件\n修复了Z-Wave.Me UZB的错误标签和描述\n向Binary Sensor CC添加了丢失的标签\n在电池电量中添加了缺少的％单位\n当收到没有报告的报告时，不再删除“二进制开关”，“多级开关”和“基本” CC的“ targetValue”\n其他一些采访超时将被忽略"
            },
            "1.8.1": {
                "en": "The `targetValue` of switch-type CCs is no longer overwritten with `undefined` when a report without target value is received\nAdded a config file for `Jasco ZW3010`\nAdded a config file for `HeatIt Z-TRM3`\nAdded a config file for `Eurotronic Air quality sensor (Luftgütesensor)`\nImproved support for `Qubino Flush 2 Relay`\nThe `Multi Channel Association CC`, `Z-Wave+ CC` and `Node Naming and Location CC` values are now hidden\n`Color Switch CC`: Setting the **warm white** `targetValue` no longer falsely claims that the `propertyKey` is missing\nRemoved some debug logging which could blow up the log file size\nRemoving a node association no longer throws an error when both multi channel and normal associations are supported.\n`Notification CC Reports` are now parsed correctly when the `V1 Alarm` bytes are not zero\nAdded support for `*.gbl` firmware files and Aeotec updater executables which include a checksum and a target chip byte.\nFixed an issue where the wrong response could be mapped to some commands\n... and some more minor bugfixes",
                "de": "Der \"targetValue\" von CCs vom Switch-Typ wird nicht mehr mit \"undefined\" überschrieben, wenn ein Bericht ohne Zielwert empfangen wird\nEine Konfigurationsdatei für \"Jasco ZW3010\" wurde hinzugefügt\nEine Konfigurationsdatei für \"HeatIt Z-TRM3\" wurde hinzugefügt\nKonfigurationsdatei für \"Eurotronic Luftqualitätssensor (Luftgütesensor)\" hinzugefügt\nVerbesserte Unterstützung für \"Qubino Flush 2 Relay\"\nDie Werte für \"Multi Channel Association CC\", \"Z-Wave + CC\" und \"Node Naming and Location CC\" sind jetzt ausgeblendet\n`Color Switch CC`: Durch Einstellen des **warmweißen** targetValue` wird nicht mehr fälschlicherweise behauptet, dass der` propertyKey` fehlt \nEinige Debug-Protokollierungen wurden entfernt, die die Größe der Protokolldatei erhöhen könnten\nDas Entfernen einer Knotenzuordnung löst keinen Fehler mehr aus, wenn sowohl Mehrkanal- als auch normale Zuordnungen unterstützt werden.\n`Notification CC Reports` werden jetzt korrekt analysiert, wenn die` V1 Alarm`-Bytes nicht Null sind\nUnterstützung für `* .gbl` Firmware-Dateien und ausführbare Aeotec Updater-Dateien hinzugefügt, die eine Prüfsumme und ein Zielchip-Byte enthalten.\nEs wurde ein Problem behoben, bei dem einigen Befehlen die falsche Antwort zugeordnet werden konnte\n... und einige kleinere Bugfixes",
                "ru": "`TargetValue` CC переключаемого типа больше не перезаписывается на` undefined` при получении отчета без целевого значения.\nДобавлен файл конфигурации для `Jasco ZW3010`\nДобавлен файл конфигурации для `HeatIt Z-TRM3`\nДобавлен файл конфигурации для `Eurotronic Air quality sensor (Luftgütesensor)`\nУлучшена поддержка реле Qubino Flush 2 Relay.\nЗначения Multi Channel Association CC, Z-Wave + CC и Node Naming and Location CC теперь скрыты.\n`Color Switch CC`: установка **теплого белого** targetValue` больше не ложно утверждает, что `propertyKey` отсутствует \nУдалено ведение журнала отладки, которое могло привести к увеличению размера файла журнала.\nУдаление ассоциации узла больше не вызывает ошибку, если поддерживаются как многоканальные, так и нормальные ассоциации.\n«Notification CC Reports» теперь анализируется правильно, если байты «V1 Alarm» не равны нулю.\nДобавлена поддержка файлов прошивки `* .gbl` и исполняемых файлов программы обновления Aeotec, которые включают контрольную сумму и целевой байт микросхемы.\nИсправлена проблема, когда неправильный ответ мог быть сопоставлен с некоторыми командами.\n... и еще несколько мелких исправлений",
                "pt": "O `targetValue` dos CCs do tipo switch não é mais substituído por` undefined` quando um relatório sem valor alvo é recebido\nAdicionado um arquivo de configuração para `Jasco ZW3010`\nAdicionado um arquivo de configuração para `HeatIt Z-TRM3`\nAdicionado um arquivo de configuração para `sensor de qualidade Eurotronic Air (Luftgütesensor)`\nSuporte aprimorado para `Qubino Flush 2 Relay`\nOs valores `Multi Channel Association CC`,` Z-Wave + CC` e `Node Naming and Location CC` estão agora ocultos\n`Color Switch CC`: Definir o **branco quente** targetValue` não afirma mais que `propertyKey` está faltando \nRemovido algum registro de depuração que poderia aumentar o tamanho do arquivo de registro\nA remoção de uma associação de nó não gera mais um erro quando há suporte para associações multicanais e normais.\nOs `Relatórios CC de Notificação` agora são analisados corretamente quando os bytes do` Alarme V1` não são zero\nAdicionado suporte para arquivos de firmware `* .gbl` e executáveis atualizadores Aeotec que incluem uma soma de verificação e um byte de chip de destino.\nCorrigido um problema em que a resposta errada podia ser mapeada para alguns comandos\n... e mais algumas pequenas correções de bugs",
                "nl": "De `targetValue` van switch-type CCs wordt niet langer overschreven met` undefined` wanneer een rapport zonder doelwaarde wordt ontvangen\nEen configuratiebestand toegevoegd voor `Jasco ZW3010`\nEen configuratiebestand toegevoegd voor `HeatIt Z-TRM3`\nEen configuratiebestand toegevoegd voor `Eurotronic Air quality sensor (Luftgütesensor)`\nVerbeterde ondersteuning voor `Qubino Flush 2 Relay`\nDe waarden `Multi Channel Association CC`,` Z-Wave + CC` en `Node Naming and Location CC` zijn nu verborgen\n`Color Switch CC`: het instellen van de **warm witte** targetValue` beweert niet langer ten onrechte dat de `propertyKey` ontbreekt \nEnkele foutopsporingsregistratie verwijderd die de grootte van het logboekbestand zou kunnen vergroten\nHet verwijderen van een knooppuntassociatie genereert niet langer een fout wanneer zowel meerkanaals als normale associaties worden ondersteund.\n`Notification CC Reports` worden nu correct geparseerd wanneer de` V1 Alarm` bytes niet nul zijn\nOndersteuning toegevoegd voor `* .gbl` firmwarebestanden en Aeotec updater-uitvoerbare bestanden die een checksum en een doelchipbyte bevatten.\nEr is een probleem opgelost waarbij het verkeerde antwoord aan sommige opdrachten kon worden toegewezen\n... en wat meer kleine bugfixes",
                "fr": "La `targetValue` des CC de type commutateur n'est plus écrasée par` undefined` lorsqu'un rapport sans valeur cible est reçu\nAjout d'un fichier de configuration pour `Jasco ZW3010`\nAjout d'un fichier de configuration pour `HeatIt Z-TRM3`\nAjout d'un fichier de configuration pour `Eurotronic Air quality sensor (Luftgütesensor)`\nAmélioration de la prise en charge de `Qubino Flush 2 Relay`\nLes valeurs `Multi Channel Association CC`,` Z-Wave + CC` et `Node Naming and Location CC` sont maintenant masquées\n`Color Switch CC`: La définition du **blanc chaud** targetValue` ne prétend plus à tort que la `propertyKey` est manquante \nSuppression de la journalisation de débogage qui pouvait augmenter la taille du fichier journal\nLa suppression d'une association de nœuds ne génère plus d'erreur lorsque les associations multicanaux et normales sont prises en charge.\nLes `Notification CC Reports` sont maintenant correctement analysés lorsque les octets` V1 Alarm` ne sont pas à zéro\nAjout de la prise en charge des fichiers de firmware `* .gbl` et des exécutables de mise à jour Aeotec qui incluent une somme de contrôle et un octet de puce cible.\nCorrection d'un problème où la mauvaise réponse pouvait être mappée à certaines commandes\n... et quelques corrections de bugs mineurs",
                "it": "Il \"targetValue\" dei CC di tipo switch non viene più sovrascritto con \"undefined\" quando viene ricevuto un report senza valore target\nAggiunto un file di configurazione per `Jasco ZW3010`\nAggiunto un file di configurazione per `HeatIt Z-TRM3`\nAggiunto un file di configurazione per \"Eurotronic Air quality sensor (Luftgütesensor)\"\nSupporto migliorato per \"Qubino Flush 2 Relay\"\nI valori \"Multi Channel Association CC\", \"Z-Wave + CC\" e \"Node Naming and Location CC\" sono ora nascosti\n`Color Switch CC`: L'impostazione del **bianco caldo** targetValue` non afferma più falsamente che manca la `propertyKey` \nRimosse alcune registrazioni di debug che potevano far aumentare le dimensioni del file di registro\nLa rimozione di un'associazione di nodi non genera più un errore quando sono supportate sia le associazioni multicanale che quelle normali.\nI \"Report di notifica CC\" vengono ora analizzati correttamente quando i byte \"Allarme V1\" non sono zero\nAggiunto il supporto per i file del firmware `* .gbl` e gli eseguibili di aggiornamento Aeotec che includono un checksum e un byte del chip di destinazione.\nRisolto un problema per cui la risposta sbagliata poteva essere mappata ad alcuni comandi\n... e altre correzioni di bug minori",
                "es": "El \"targetValue\" de los CC de tipo switch ya no se sobrescribe con \"undefined\" cuando se recibe un informe sin un valor objetivo.\nSe agregó un archivo de configuración para `Jasco ZW3010`\nSe agregó un archivo de configuración para `HeatIt Z-TRM3`\nSe agregó un archivo de configuración para `Sensor de calidad del aire Eurotronic (Luftgütesensor)`\nSoporte mejorado para `Qubino Flush 2 Relay`\nLos valores `CC de asociación multicanal`,` Z-Wave + CC` y `Nomenclatura de nodo y ubicación CC` ahora están ocultos\n`Color Switch CC`: Establecer el **blanco cálido** targetValue` ya no afirma falsamente que falta la `propertyKey` \nSe eliminaron algunos registros de depuración que podrían aumentar el tamaño del archivo de registro\nLa eliminación de una asociación de nodo ya no arroja un error cuando se admiten asociaciones multicanal y normales.\nLos \"Informes CC de notificación\" ahora se analizan correctamente cuando los bytes de \"Alarma V1\" no son cero\nSe agregó soporte para archivos de firmware `* .gbl` y ejecutables de actualización Aeotec que incluyen una suma de comprobación y un byte de chip de destino.\nSe solucionó un problema por el cual la respuesta incorrecta podía asignarse a algunos comandos\n... y algunas correcciones de errores menores",
                "pl": "Wartość „targetValue” CC typu przełącznika nie jest już zastępowana wartością „undefined” po odebraniu raportu bez wartości docelowej\nDodano plik konfiguracyjny dla `Jasco ZW3010`\nDodano plik konfiguracyjny dla `HeatIt Z-TRM3`\nDodano plik konfiguracyjny dla `Eurotronic Air quality sensor (Luftgütesensor) '\nUlepszona obsługa `Qubino Flush 2 Relay`\nWartości `Multi Channel Association CC`,` Z-Wave + CC` oraz `Node Naming and Location CC` są teraz ukryte\n`Color Switch CC`: ustawienie **ciepłej bieli** parametru„ targetValue ”nie twierdzi już, że brakuje elementu„ propertyKey ” \nUsunięto logowanie do debugowania, które mogłoby spowodować zwiększenie rozmiaru pliku dziennika\nUsunięcie powiązania węzła nie powoduje już błędu, gdy obsługiwane są zarówno skojarzenia wielokanałowe, jak i normalne.\n„Raporty CC powiadomień” są teraz przetwarzane poprawnie, gdy bajty „Alarmu V1” nie są zerowe\nDodano obsługę plików oprogramowania układowego `* .gbl` i plików wykonywalnych aktualizatora Aeotec, które zawierają sumę kontrolną i bajt układu docelowego.\nNaprawiono błąd, w wyniku którego na niektóre polecenia można było przypisać niewłaściwą odpowiedź\n... i kilka innych drobnych poprawek",
                "zh-cn": "当收到没有目标值的报告时，开关类型CC的targetValue不再被undefined覆盖\n为Jasco ZW3010添加了一个配置文件\n为“ HeatIt Z-TRM3”添加了配置文件\n为“ Eurotronic空气质量传感器（Luftgütesensor）”添加了一个配置文件\n改进了对“ Qubino Flush 2 Relay”的支持\n多通道关联CC，Z-Wave + CC和节点命名和位置CC的值现已隐藏\n彩色开关CC：设置“暖白色” targetValue不再错误地声称缺少“ propertyKey”\n删除了一些调试日志记录，这可能会破坏日志文件的大小\n同时支持多通道关联和普通关联时，删除节点关联不再引发错误。\n现在，当“ V1警报”字节不为零时，可以正确解析“通知CC报告”\n增加了对* .gbl`固件文件和Aeotec更新程序可执行文件的支持，其中包括校验和和目标芯片字节。\n修复了错误响应可能会映射到某些命令的问题\n...以及其他一些小错误修正"
            },
            "1.8.0": {
                "en": "Improved config files for Fibaro Keyfob (no special chars anymore) and Shenzhen Neo PD03Z\nNon-critical steps during the interview of `Central Scene CC`, `Configuration CC V3+` and `Association Group Info CC` are now skipped when the node does not respond or responds incorrectly\nMulti Channel Lifeline Associations are no longer created automatically if the device does not support the `Multi Channel CC` - this should fix compatibility with most Qubino devices\nFixed an issue where marking nodes with active transaction as asleep would mess up the serial communication with the controller\nEmpty user codes are now also handled as strings instead of Buffer objects\nThe `targetValue` property for the `Binary Switch`, `Multilevel Switch` and `Basic` CCs is now created even if it has no value\nValues for Notification events (one-time events) are now created. Previously only Notification variables were available as states",
                "de": "Verbesserte Konfigurationsdateien für Fibaro Keyfob (keine Sonderzeichen mehr) und Shenzhen Neo PD03Z\nUnkritische Schritte während des Interviews mit \"Central Scene CC\", \"Configuration CC V3 +\" und \"Association Group Info CC\" werden jetzt übersprungen, wenn der Knoten nicht oder falsch reagiert\nMulti-Channel-Lifeline-Zuordnungen werden nicht mehr automatisch erstellt, wenn das Gerät den \"Multi-Channel-CC\" nicht unterstützt. Dies sollte die Kompatibilität mit den meisten Qubino-Geräten beheben\nEs wurde ein Problem behoben, durch das das Markieren von Knoten mit aktiver Transaktion als schlafend die serielle Kommunikation mit dem Controller beeinträchtigte\nLeere Benutzercodes werden jetzt auch als Zeichenfolgen anstelle von Pufferobjekten behandelt\nDie Eigenschaft \"targetValue\" für die CCs \"Binary Switch\", \"Multilevel Switch\" und \"Basic\" wird jetzt erstellt, auch wenn sie keinen Wert hat\nEs werden jetzt Werte für Benachrichtigungsereignisse (einmalige Ereignisse) erstellt. Bisher waren nur Benachrichtigungsvariablen als Status verfügbar",
                "ru": "Улучшены файлы конфигурации для Fibaro Keyfob (больше без специальных символов) и Shenzhen Neo PD03Z\nНекритические шаги во время интервью `Central Scene CC`,` Configuration CC V3 + `и` Association Group Info CC` теперь пропускаются, если узел не отвечает или отвечает неправильно.\nМногоканальные ассоциации Lifeline больше не создаются автоматически, если устройство не поддерживает многоканальную CC - это должно исправить совместимость с большинством устройств Qubino.\nИсправлена проблема, из-за которой маркировка узлов с активной транзакцией как спящих приводила к нарушению последовательной связи с контроллером.\nПустые коды пользователей теперь также обрабатываются как строки вместо объектов буфера.\nСвойство targetValue для CCs Binary Switch, Multilevel Switch и Basic теперь создается, даже если оно не имеет значения.\nЗначения для событий уведомлений (разовые события) теперь созданы. Раньше в качестве состояний были доступны только переменные уведомления.",
                "pt": "Arquivos de configuração aprimorados para Fibaro Keyfob (sem caracteres especiais) e Shenzhen Neo PD03Z\nPassos não críticos durante a entrevista de `Central Scene CC`,` Configuration CC V3 + `e` Association Group Info CC` agora são ignorados quando o nó não responde ou responde incorretamente\nMulti Channel Lifeline Associations não são mais criadas automaticamente se o dispositivo não suportar o `Multi Channel CC` - isso deve corrigir a compatibilidade com a maioria dos dispositivos Qubino\nCorrigido um problema em que marcar nós com transação ativa como adormecido atrapalhava a comunicação serial com o controlador\nCódigos de usuário vazios agora também são tratados como strings em vez de objetos Buffer\nA propriedade `targetValue` para o` Binary Switch`, `Multilevel Switch` e` Basic` CCs agora é criada, mesmo que não tenha valor\nValores para eventos de Notificação (eventos únicos) agora são criados. Anteriormente, apenas variáveis de notificação estavam disponíveis como estados",
                "nl": "Verbeterde configuratiebestanden voor Fibaro Keyfob (geen speciale tekens meer) en Shenzhen Neo PD03Z\nNiet-kritieke stappen tijdens het interview van `Central Scene CC`,` Configuration CC V3 + `en` Association Group Info CC` worden nu overgeslagen als de node niet of niet correct reageert\nMulti Channel Lifeline Associations worden niet langer automatisch aangemaakt als het apparaat de `Multi Channel CC` niet ondersteunt - dit zou de compatibiliteit met de meeste Qubino-apparaten moeten verhelpen\nProbleem opgelost waarbij het markeren van knooppunten met een actieve transactie als in slaap de seriële communicatie met de controller zou verstoren\nLege gebruikerscodes worden nu ook als strings behandeld in plaats van Buffer-objecten\nDe eigenschap `targetValue` voor de` Binary Switch`, `Multilevel Switch` en` Basic` CCs is nu gemaakt, zelfs als deze geen waarde heeft\nWaarden voor meldingsgebeurtenissen (eenmalige gebeurtenissen) worden nu aangemaakt. Voorheen waren alleen meldingsvariabelen beschikbaar als statussen",
                "fr": "Amélioration des fichiers de configuration pour Fibaro Keyfob (plus de caractères spéciaux) et Shenzhen Neo PD03Z\nLes étapes non critiques pendant l'interview de «Central Scene CC», «Configuration CC V3 +» et «Association Group Info CC» sont désormais ignorées lorsque le nœud ne répond pas ou répond de manière incorrecte\nLes associations de lignes de vie multicanaux ne sont plus créées automatiquement si l'appareil ne prend pas en charge le `Multi Channel CC` - cela devrait corriger la compatibilité avec la plupart des appareils Qubino\nCorrection d'un problème où le marquage des nœuds avec une transaction active comme étant endormis gâcherait la communication série avec le contrôleur\nLes codes utilisateur vides sont désormais également traités comme des chaînes au lieu d'objets Buffer\nLa propriété `targetValue` pour les CC` Binary Switch`, `Multilevel Switch` et` Basic` est maintenant créée même si elle n'a pas de valeur\nLes valeurs des événements de notification (événements uniques) sont désormais créées. Auparavant, seules les variables de notification étaient disponibles en tant qu'états",
                "it": "File di configurazione migliorati per Fibaro Keyfob (non più caratteri speciali) e Shenzhen Neo PD03Z\nI passaggi non critici durante l'intervista di `Central Scene CC`,` Configuration CC V3 + `e` Association Group Info CC` vengono ora saltati quando il nodo non risponde o risponde in modo errato\nLe associazioni di linee di vita multicanale non vengono più create automaticamente se il dispositivo non supporta \"CC multicanale\" - questo dovrebbe risolvere la compatibilità con la maggior parte dei dispositivi Qubino\nRisolto un problema per cui contrassegnare i nodi con la transazione attiva come addormentati rovinava la comunicazione seriale con il controller\nAnche i codici utente vuoti vengono ora gestiti come stringhe invece che come oggetti Buffer\nLa proprietà `targetValue` per i CC` Binary Switch`, `Multilevel Switch` e` Basic` è ora creata anche se non ha valore\nI valori per gli eventi di notifica (eventi occasionali) vengono ora creati. In precedenza solo le variabili di notifica erano disponibili come stati",
                "es": "Archivos de configuración mejorados para Fibaro Keyfob (ya no hay caracteres especiales) y Shenzhen Neo PD03Z\nLos pasos no críticos durante la entrevista de `Central Scene CC`,` Configuration CC V3 + `y` Association Group Info CC` ahora se omiten cuando el nodo no responde o responde incorrectamente\nLas asociaciones de línea de vida multicanal ya no se crean automáticamente si el dispositivo no es compatible con el `CC multicanal`; esto debería solucionar la compatibilidad con la mayoría de los dispositivos Qubino\nSe solucionó un problema por el cual marcar los nodos con transacciones activas como inactivos estropeaba la comunicación en serie con el controlador\nLos códigos de usuario vacíos ahora también se manejan como cadenas en lugar de objetos de búfer\nLa propiedad `targetValue` para los CC de` Binary Switch`, `Multilevel Switch` y` Basic` ahora se crea incluso si no tiene ningún valor\nAhora se crean los valores para los eventos de notificación (eventos únicos). Anteriormente, solo las variables de notificación estaban disponibles como estados",
                "pl": "Ulepszone pliki konfiguracyjne pilota Fibaro (bez znaków specjalnych) i Shenzhen Neo PD03Z\nNiekrytyczne kroki podczas wywiadu z `Central Scene CC`,` Configuration CC V3 + `i` Association Group Info CC` są teraz pomijane, gdy węzeł nie odpowiada lub odpowiada nieprawidłowo\nWielokanałowe powiązania Lifeline nie są już tworzone automatycznie, jeśli urządzenie nie obsługuje `Multi Channel CC` - powinno to naprawić kompatybilność z większością urządzeń Qubino\nNaprawiono problem polegający na tym, że oznaczanie węzłów z aktywną transakcją jako uśpionych powodowało zakłócenie komunikacji szeregowej z kontrolerem\nPuste kody użytkowników są teraz również obsługiwane jako ciągi znaków zamiast obiektów buforu\nWłaściwość „targetValue” dla przełączników „Binary Switch”, „Multilevel Switch” i „Basic” CCs jest teraz tworzona, nawet jeśli nie ma wartości\nUtworzono wartości dla zdarzeń powiadomień (zdarzeń jednorazowych). Wcześniej tylko zmienne powiadomień były dostępne jako stany",
                "zh-cn": "改进了Fibaro Keyfob（不再有特殊字符）和Shenzhen Neo PD03Z的配置文件\n现在，当节点没有响应或响应不正确时，将跳过“中央场景CC”，“配置CC V3 +”和“关联组信息CC”的访问过程中的非关键步骤。\n如果设备不支持“多通道CC”，则不再自动创建多通道生命线关联-这应该可以解决与大多数Qubino设备的兼容性\n修复了将活动事务的节点标记为睡眠状态会破坏与控制器的串行通信的问题\n现在，空用户代码也被当作字符串而不是缓冲区对象处理\n即使没有值，也已为“二进制开关”，“多级开关”和“基本” CC创建了“ targetValue”属性。\n现在创建通知事件（一次性事件）的值。以前只有Notification变量可用作状态"
            },
            "1.7.10": {
                "en": "Improved compatibility with devices that don't follow the `User Code CC` and `Notification CC` specifications correctly (like Zipato Keypad)\nAdded the ability to edit binary values (e.g. RFID codes) using hexadecimal strings, e.g. `0xbada55`.",
                "de": "Verbesserte Kompatibilität mit Geräten, die den Spezifikationen \"User Code CC\" und \"Notification CC\" nicht korrekt entsprechen (wie Zipato Keypad)\nEs wurde die Möglichkeit hinzugefügt, Binärwerte (z. B. RFID-Codes) unter Verwendung von hexadezimalen Zeichenfolgen, z. `0xbada55`.",
                "ru": "Улучшена совместимость с устройствами, которые не соответствуют спецификациям ʻUser Code CC` и `Notification CC` (например, Zipato Keypad).\nДобавлена возможность редактировать двоичные значения (например, коды RFID) с использованием шестнадцатеричных строк, например `0xbada55`.",
                "pt": "Compatibilidade aprimorada com dispositivos que não seguem as especificações do `Código de usuário CC` e` Notificação CC` corretamente (como teclado Zipato)\nAdicionada a capacidade de editar valores binários (por exemplo, códigos RFID) usando strings hexadecimais, por exemplo `0xbada55`.",
                "nl": "Verbeterde compatibiliteit met apparaten die de ʻUser Code CC` en `Notification CC` specificaties niet correct volgen (zoals Zipato Keypad)\nDe mogelijkheid toegevoegd om binaire waarden (bijv.RFID-codes) te bewerken met hexadecimale strings, bijv. `0xbada55`.",
                "fr": "Amélioration de la compatibilité avec les appareils qui ne respectent pas correctement les spécifications «User Code CC» et «Notification CC» (comme Zipato Keypad)\nAjout de la possibilité de modifier les valeurs binaires (par exemple, les codes RFID) à l'aide de chaînes hexadécimales, par exemple `0xbada55`.",
                "it": "Compatibilità migliorata con i dispositivi che non seguono correttamente le specifiche ʻAser Code CC` e `Notification CC` (come Zipato Keypad)\nAggiunta la possibilità di modificare i valori binari (ad es. Codici RFID) utilizzando stringhe esadecimali, ad es. \"0xbada55\".",
                "es": "Compatibilidad mejorada con dispositivos que no siguen las especificaciones de \"Código de usuario CC\" y \"Notificación CC\" correctamente (como el teclado Zipato)\nSe agregó la capacidad de editar valores binarios (por ejemplo, códigos RFID) utilizando cadenas hexadecimales, por ejemplo. `0xbada55`.",
                "pl": "Poprawiona kompatybilność z urządzeniami, które nie są zgodne ze specyfikacjami „User Code CC” i „Notification CC” (np. Zipato Keypad)\nDodano możliwość edycji wartości binarnych (np. Kodów RFID) za pomocą ciągów szesnastkowych, np. „0xbada55”.",
                "zh-cn": "改进了与未正确遵循“用户代码CC”和“通知CC”规范的设备的兼容性（例如Zipato键盘）\n新增了使用十六进制字符串（例如）编辑二进制值（例如RFID代码）的功能。 0xbada55。"
            },
            "1.7.9": {
                "en": "Fixed a crash in the adapter settings when a node's device type is not yet set",
                "de": "Ein Absturz in den Adaptereinstellungen wurde behoben, wenn der Gerätetyp eines Knotens noch nicht festgelegt wurde",
                "ru": "Исправлен сбой в настройках адаптера, когда тип устройства узла еще не установлен",
                "pt": "Corrigida uma falha nas configurações do adaptador quando o tipo de dispositivo de um nó ainda não foi definido",
                "nl": "Een crash verholpen in de adapterinstellingen wanneer het apparaattype van een knooppunt nog niet is ingesteld",
                "fr": "Correction d'un crash dans les paramètres de l'adaptateur lorsque le type de périphérique d'un nœud n'est pas encore défini",
                "it": "Risolto un arresto anomalo nelle impostazioni dell'adattatore quando il tipo di dispositivo di un nodo non è ancora impostato",
                "es": "Se corrigió un bloqueo en la configuración del adaptador cuando el tipo de dispositivo de un nodo aún no estaba configurado",
                "pl": "Naprawiono awarię w ustawieniach adaptera, gdy typ urządzenia węzła nie jest jeszcze ustawiony",
                "zh-cn": "修复了尚未设置节点的设备类型时适配器设置的崩溃"
            }
        },
        "title": "Z-Wave 2",
        "titleLang": {
            "en": "Z-Wave 2",
            "de": "Z-Wave 2",
            "ru": "Z-Wave 2",
            "pt": "Z-Wave 2",
            "nl": "Z-Wave 2",
            "fr": "Z-Wave 2",
            "it": "Z-Wave 2",
            "es": "Z-Wave 2",
            "pl": "Z-Wave 2",
            "zh-cn": "Z-Wave 2"
        },
        "desc": {
            "en": "The better Z-Wave integration",
            "de": "Die bessere Z-Wave-Integration",
            "ru": "Лучшая интеграция Z-Wave",
            "pt": "A melhor integração do Z-Wave",
            "nl": "De betere Z-Wave-integratie",
            "fr": "La meilleure intégration Z-Wave",
            "it": "La migliore integrazione di Z-Wave",
            "es": "La mejor integración de Z-Wave",
            "pl": "Lepsza integracja Z-Wave",
            "zh-cn": "更好的Z-Wave集成"
        },
        "authors": [
            "AlCalzone <d.griesel@gmx.net>"
        ],
        "keywords": [
            "zwave",
            "z-wave",
            "zwave2",
            "z-wave 2"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "build/main.js",
        "icon": "zwave2.svg",
        "enabled": true,
        "dataFolder": "zwave2.%INSTANCE%",
        "extIcon": "https://raw.githubusercontent.com/AlCalzone/ioBroker.zwave2/master/admin/zwave2.svg?sanitize=true",
        "readme": "https://github.com/AlCalzone/ioBroker.zwave2/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "hardware",
        "compact": true,
        "materialize": true,
        "messagebox": true,
        "connectionType": "local",
        "dataSource": "push",
        "dependencies": [
            {
                "js-controller": ">=2.0.0"
            }
        ]
    },
    "native": {
        "serialport": "",
        "writeLogFile": false,
        "networkKey": "",
        "driver_increaseTimeouts": false,
        "driver_increaseSendAttempts": false,
        "switchCompat": false,
        "preserveStateNames": false,
        "notificationEventValidity": 1000
    },
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info",
            "type": "channel",
            "common": {
                "name": "Information"
            },
            "native": {}
        },
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "Whether the Z-Wave driver is ready",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.inclusion",
            "type": "state",
            "common": {
                "role": "state",
                "name": "Which state the inclusion of nodes is in",
                "type": "number",
                "read": true,
                "write": true,
                "def": 0,
                "states": {
                    "0": "Idle",
                    "1": "Non-secure",
                    "2": "Secure"
                }
            },
            "native": {}
        },
        {
            "_id": "info.exclusion",
            "type": "state",
            "common": {
                "role": "state",
                "name": "Whether the exclusion of nodes is active",
                "type": "boolean",
                "read": true,
                "write": true,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.healingNetwork",
            "type": "state",
            "common": {
                "role": "state",
                "name": "Whether a network heal is currently in progress",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.configVersion",
            "type": "state",
            "common": {
                "role": "state",
                "name": "The installed version of the Z-Wave JS configuration DB",
                "type": "string",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.configUpdate",
            "type": "state",
            "common": {
                "role": "state",
                "name": "The version of an available update for the Z-Wave JS configuration DB",
                "type": "string",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.configUpdating",
            "type": "state",
            "common": {
                "role": "state",
                "name": "Whether the adapter is currently updating the Z-Wave JS configuration DB",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}