{
    "common": {
        "name": "zwave2",
        "version": "2.4.2",
        "news": {
            "2.4.2": {
                "en": "Fix: Additional node-related commands now respect and update the node status\nFixed an issue where the communication could get stuck after aborting a command\nNew and updated configuration files, see [here](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.0) and [here](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.1)",
                "de": "Fix: Zusätzliche Befehle beachten nun den Status von Geräten und haben einen Einfluss auf diesen\nEin Problem wurde behoben, bei dem die Kommunikation nach dem Abbruch eines Befehls hängen bleiben konnte\nNeue und aktualisierte Konfigurationsdateien, siehe [hier](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.0) und [hier](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.1)",
                "ru": "Исправлено: дополнительные команды, связанные с узлами, теперь учитывают и обновляют статус узла.\nИсправлена ошибка, из-за которой связь могла зависнуть после отмены команды.\nНовые и обновленные файлы конфигурации см. [Здесь](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.0) и [здесь](https://github.com/zwave-js/node-zwave-js/Release/tag/v8.9.1)",
                "pt": "Correção: comandos adicionais relacionados ao nó agora respeitam e atualizam o status do nó\nCorrigido um problema em que a comunicação poderia travar após abortar um comando\nArquivos de configuração novos e atualizados, veja [aqui](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.0) e [aqui](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.1)",
                "nl": "Oplossing: extra knooppuntgerelateerde opdrachten respecteren en updaten nu de knooppuntstatus\nEr is een probleem opgelost waarbij de communicatie vastliep na het afbreken van een opdracht\nNieuwe en bijgewerkte configuratiebestanden, zie [hier](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.0) en [hier](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.1)",
                "fr": "Correctif : les commandes supplémentaires liées aux nœuds respectent et mettent à jour désormais l'état du nœud\nCorrection d'un problème où la communication pouvait rester bloquée après l'abandon d'une commande\nFichiers de configuration nouveaux et mis à jour, voir [ici](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.0) et [ici](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.1)",
                "it": "Correzione: i comandi aggiuntivi relativi al nodo ora rispettano e aggiornano lo stato del nodo\nRisolto un problema per cui la comunicazione poteva bloccarsi dopo aver interrotto un comando\nFile di configurazione nuovi e aggiornati, vedere [qui](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.0) e [qui](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.1)",
                "es": "Solución: los comandos adicionales relacionados con el nodo ahora respetan y actualizan el estado del nodo\nSe solucionó un problema por el cual la comunicación podía atascarse después de abortar un comando.\nArchivos de configuración nuevos y actualizados, consulte [aquí](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.0) y [aquí](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.1)",
                "pl": "Poprawka: Dodatkowe polecenia związane z węzłem uwzględniają teraz i aktualizują stan węzła\nNaprawiono problem, w którym komunikacja mogła się utknąć po przerwaniu polecenia;\nNowe i zaktualizowane pliki konfiguracyjne, zobacz [tutaj](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.0) i [tutaj](https://github.com/zwave-js/node-zwave-js/wydania/tag/v8.9.1)",
                "zh-cn": "修复：其他节点相关命令现在尊重并更新节点状态\n修复了中止命令后通信可能卡住的问题\n新的和更新的配置文件，见[这里](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.0)和[这里](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.1)"
            },
            "2.4.2-beta.1": {
                "en": "Fixed the check for incomplete or incorrect value IDs",
                "de": "Die Prüfung auf unvollständige oder falsche value IDs wurde korrigiert",
                "ru": "Исправлена проверка на неполные или неправильные идентификаторы значений.",
                "pt": "Corrigida a verificação de IDs de valor incompletos ou incorretos",
                "nl": "De controle op onvolledige of onjuiste waarde-ID's gerepareerd",
                "fr": "Correction de la vérification des ID de valeur incomplets ou incorrects",
                "it": "Risolto il problema con il controllo degli ID dei valori incompleti o errati",
                "es": "Se corrigió la verificación de ID de valor incompletos o incorrectos",
                "pl": "Naprawiono sprawdzanie pod kątem niekompletnych lub nieprawidłowych identyfikatorów wartości",
                "zh-cn": "修复了对不完整或不正确的值 ID 的检查"
            },
            "2.4.2-beta.0": {
                "en": "Experimental: The handling of messages has been rewritten from scratch and simplified. This may cause some unintended behavior.\nAvoid interruption of the communication with a node by other nodes requesting responses from the controller\nImproved reliability of encrypted communication\nBattery-powered devices are nore sent to sleep more reliably\nFixed encoding of some configuration parameters\nFix: Limit allowed Node.js versions to `12.22.2+`, `14.13.0+`, `16+` and forbid installation on development Node.js versions\nFixed some crashes\nFixed an issue where healing the network would fail due to a too low timeout\nImproved detection of sticks that do not support soft reset\nNew and updated configuration files, see [here](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.8.0) and [here](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.0-beta.3)",
                "de": "Experimentell: Die Handhabung von Kommandos wurde von Grund auf neu geschrieben und vereinfacht. Dadurch kann es jedoch zu unbeabsichtigtem Verhalten kommen.\nVermeidung von Unterbrechungen der Kommunikation mit einem Node durch andere Nodes, die währenddessen eine Antwort vom Controller anfordern\nVerbesserte Zuverlässigkeit der verschlüsselten Kommunikation\nBatteriebetriebene Geräte werden nun zuverlässiger in den Schlaf geschickt\nSerialisierung einiger Konfigurationsparameter korrigiert\nBehoben: Die erlaubten Node.js-Versionen wurden auf `12.22.2+`, `14.13.0+`, `16+` begrenzt und die Installation auf Entwickler-Node.js-Versionen werden jetzt verhindert.\nEinige Abstürze behoben\nEin Problem wurde behoben, bei dem das Heilen des Netzwerks aufgrund eines zu niedrigen Timeouts fehlschlug\nVerbesserte Erkennung von Sticks, die keinen Soft-Reset unterstützen\nNeue und aktualisierte Konfigurationsdateien, siehe [hier](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.8.0) und [hier](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.0-beta.3)",
                "ru": "Экспериментально: обработка сообщений была переписана с нуля и упрощена. Это может вызвать непредвиденное поведение.\nИзбегайте прерывания связи с узлом другими узлами, запрашивающими ответы от контроллера.\nПовышенная надежность зашифрованной связи\nУстройства с батарейным питанием больше не переводятся в спящий режим более надежно\nИсправлена кодировка некоторых параметров конфигурации\nИсправление: Ограничьте допустимые версии Node.js до `12.22.2 +`, `14.13.0 +`, `16 +` и запретите установку на разрабатываемых версиях Node.js\nИсправлены некоторые сбои\nИсправлена ошибка, из-за которой восстановление сети не удавалось из-за слишком малого тайм-аута.\nУлучшено обнаружение джойстиков, не поддерживающих мягкий сброс.\nНовые и обновленные файлы конфигурации см. [Здесь](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.8.0) и [здесь](https://github.com/zwave-js/node-zwave-js/Release/tag/v8.9.0-beta.3)",
                "pt": "Experimental: o tratamento das mensagens foi reescrito do zero e simplificado. Isso pode causar algum comportamento indesejado.\nEvite a interrupção da comunicação com um nó por outros nós solicitando respostas do controlador\nMaior confiabilidade da comunicação criptografada\nDispositivos alimentados por bateria não são enviados para dormir de forma mais confiável\nCodificação fixa de alguns parâmetros de configuração\nCorreção: limita as versões permitidas do Node.js para `12.22.2 +`, `14.13.0 +`, `16 +` e proíbe a instalação nas versões de desenvolvimento do Node.js.\nConsertou algumas falhas\nCorrigido um problema em que a recuperação da rede falhava devido a um tempo limite muito baixo\nDetecção aprimorada de manípulos que não suportam reinicialização suave\nArquivos de configuração novos e atualizados, veja [aqui](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.8.0) e [aqui](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.0-beta.3)",
                "nl": "Experimenteel: de afhandeling van berichten is van de grond af herschreven en vereenvoudigd. Dit kan onbedoeld gedrag veroorzaken.\nVoorkom onderbreking van de communicatie met een knooppunt door andere knooppunten die om reacties van de controller vragen\nVerbeterde betrouwbaarheid van versleutelde communicatie\nApparaten op batterijen worden niet betrouwbaarder in de slaapstand gestuurd\nVaste codering van sommige configuratieparameters\nFix: Beperk toegestane Node.js-versies tot `12.22.2+`, `14.13.0+`, `16+` en verbied de installatie op Node.js-ontwikkelingsversies\nEnkele crashes verholpen\nEr is een probleem opgelost waarbij het herstellen van het netwerk mislukte vanwege een te lage time-out\nVerbeterde detectie van sticks die geen zachte reset ondersteunen\nNieuwe en bijgewerkte configuratiebestanden, zie [hier](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.8.0) en [hier](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.0-beta.3)",
                "fr": "Expérimental : La gestion des messages a été entièrement réécrite et simplifiée. Cela peut provoquer un comportement inattendu.\nÉviter l'interruption de la communication avec un nœud par d'autres nœuds demandant des réponses du contrôleur\nFiabilité améliorée de la communication cryptée\nLes appareils alimentés par batterie ne sont pas mis en veille de manière plus fiable\nEncodage fixe de certains paramètres de configuration\nCorrectif : limitez les versions autorisées de Node.js à « 12.22.2+ », « 14.13.0+ », « 16+ » et interdisez l'installation sur les versions de développement de Node.js\nCorrection de quelques plantages\nCorrection d'un problème où la guérison du réseau échouait en raison d'un délai d'attente trop faible\nDétection améliorée des bâtons qui ne prennent pas en charge la réinitialisation logicielle\nFichiers de configuration nouveaux et mis à jour, voir [ici](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.8.0) et [ici](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.0-beta.3)",
                "it": "Sperimentale: la gestione dei messaggi è stata riscritta da zero e semplificata. Ciò potrebbe causare alcuni comportamenti involontari.\nEvitare l'interruzione della comunicazione con un nodo da parte di altri nodi che richiedono risposte dal controller\nMaggiore affidabilità della comunicazione crittografata\nI dispositivi alimentati a batteria non vengono inviati a dormire in modo più affidabile\nCodifica fissa di alcuni parametri di configurazione\nCorrezione: limita le versioni Node.js consentite a `12.22.2+`, `14.13.0+`, `16+` e vieta l'installazione sulle versioni di sviluppo Node.js\nRisolti alcuni crash\nRisolto un problema per cui la riparazione della rete falliva a causa di un timeout troppo basso\nRilevamento migliorato di stick che non supportano il soft reset\nFile di configurazione nuovi e aggiornati, vedere [qui](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.8.0) e [qui](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.0-beta.3)",
                "es": "Experimental: El manejo de mensajes se ha reescrito desde cero y se ha simplificado. Esto puede provocar algún comportamiento no deseado.\nEvite la interrupción de la comunicación con un nodo por otros nodos que soliciten respuestas del controlador.\nFiabilidad mejorada de la comunicación cifrada\nLos dispositivos que funcionan con baterías ya no se envían a dormir de manera más confiable\nCodificación fija de algunos parámetros de configuración\nSolución: limite las versiones permitidas de Node.js a `12.22.2 +`, `14.13.0 +`, `16 +` y prohíba la instalación en las versiones de desarrollo de Node.js\nSe corrigieron algunos bloqueos.\nSe solucionó un problema por el cual la recuperación de la red fallaba debido a un tiempo de espera demasiado bajo.\nDetección mejorada de palos que no admiten reinicio suave\nArchivos de configuración nuevos y actualizados, consulte [aquí](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.8.0) y [aquí](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.0-beta.3)",
                "pl": "Eksperymentalne: Obsługa wiadomości została napisana od nowa i uproszczona. Może to spowodować niezamierzone zachowanie.\nUnikaj przerw w komunikacji z węzłem przez inne węzły żądające odpowiedzi od kontrolera\nPoprawiona niezawodność szyfrowanej komunikacji\nUrządzenia zasilane bateryjnie nie są bardziej niezawodne w stan uśpienia\nNaprawiono kodowanie niektórych parametrów konfiguracyjnych\nPoprawka: Ogranicz dozwolone wersje Node.js do `12.22.2+`, `14.13.0+`, `16+` i zabroń instalacji na deweloperskich wersjach Node.js\nNaprawiono niektóre awarie\nNaprawiono błąd powodujący niepowodzenie leczenia sieci z powodu zbyt niskiego limitu czasu\nUlepszone wykrywanie drążków, które nie obsługują miękkiego resetu\nNowe i zaktualizowane pliki konfiguracyjne, zobacz [tutaj](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.8.0) i [tutaj](https://github.com/zwave-js/node-zwave-js/wydania/tag/v8.9.0-beta.3)",
                "zh-cn": "实验性：消息的处理已从头开始重写并简化。这可能会导致一些意外行为。\n避免其他节点向控制器请求响应而中断与节点的通信\n提高加密通信的可靠性\n电池供电的设备不会更可靠地进入睡眠状态\n一些配置参数的固定编码\n修复：将允许的 Node.js 版本限制为 `12.22.2+`、`14.13.0+`、`16+` 并禁止在开发 Node.js 版本上安装\n修复了一些崩溃\n修复了由于超时时间太短而导致修复网络失败的问题\n改进了对不支持软复位的棒的检测\n新的和更新的配置文件，见[这里](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.8.0)和[这里](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.9.0-beta.3)"
            },
            "2.4.1": {
                "en": "Fix: Correctly update UI when canceling an inclusion process\nFix: Check for SmartStart support before using it\nFix: Add missing translations\nFixed the automatic lifeline association for some devices\nNew and updated configuration files, see [here](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.7.3)",
                "de": "Fix: Die Benutzeroberfläche wird beim Abbrechen eines Inklusionsprozesses jetzt korrekt aktualisiert\nFix: Vorm Nutzen von SmartStart wird geprüft, ob es unterstützt ist\nFix: Fehlende Übersetzungen hinzufügen\nAutomatische Konfiguration der Lifeline für einige Geräte korrigiert\nNeue und aktualisierte Konfigurationsdateien, siehe [hier](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.7.3)",
                "ru": "Исправлено: правильно обновлять пользовательский интерфейс при отмене процесса включения.\nИсправление: проверьте наличие поддержки SmartStart перед его использованием\nИсправлено: добавить недостающие переводы\nИсправлена автоматическая привязка к линии жизни для некоторых устройств.\nНовые и обновленные файлы конфигурации см. [Здесь](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.7.3)",
                "pt": "Correção: atualizar corretamente a IU ao cancelar um processo de inclusão\nCorreção: verifique se há suporte para SmartStart antes de usá-lo\nCorreção: Adicionar traduções ausentes\nCorrigida a associação automática da linha de vida para alguns dispositivos\nArquivos de configuração novos e atualizados, veja [aqui](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.7.3)",
                "nl": "Oplossing: UI correct bijwerken bij het annuleren van een opnameproces\nOplossing: controleer op SmartStart-ondersteuning voordat u het gebruikt\nOplossing: ontbrekende vertalingen toevoegen\nDe automatische koppeling van de reddingslijn voor sommige apparaten opgelost\nNieuwe en bijgewerkte configuratiebestanden, zie [hier](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.7.3)",
                "fr": "Correctif : Mettre à jour correctement l'interface utilisateur lors de l'annulation d'un processus d'inclusion\nCorrectif : vérifiez la prise en charge de SmartStart avant de l'utiliser\nCorrectif : ajouter les traductions manquantes\nCorrection de l'association automatique de ligne de vie pour certains appareils\nFichiers de configuration nouveaux et mis à jour, voir [ici](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.7.3)",
                "it": "Correzione: aggiorna correttamente l'interfaccia utente quando si annulla un processo di inclusione\nCorrezione: verifica il supporto SmartStart prima di utilizzarlo\nCorrezione: aggiungi traduzioni mancanti\nRisolto il problema con l'associazione automatica della linea di vita per alcuni dispositivi\nFile di configurazione nuovi e aggiornati, vedere [qui](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.7.3)",
                "es": "Solución: actualice correctamente la interfaz de usuario al cancelar un proceso de inclusión\nSolución: compruebe la compatibilidad con SmartStart antes de usarlo\nSolución: agregue las traducciones que faltan\nSe corrigió la asociación automática de la línea de vida para algunos dispositivos.\nArchivos de configuración nuevos y actualizados, consulte [aquí](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.7.3)",
                "pl": "Poprawka: Poprawnie zaktualizuj interfejs użytkownika podczas anulowania procesu włączania\nPoprawka: Przed użyciem sprawdź obsługę SmartStart\nPoprawka: Dodaj brakujące tłumaczenia\nNaprawiono automatyczne skojarzenie linii życia dla niektórych urządzeń\nNowe i zaktualizowane pliki konfiguracyjne, zobacz [tutaj](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.7.3)",
                "zh-cn": "修复：取消包含过程时正确更新 UI\n修复：使用前检查 SmartStart 支持\n修复：添加缺少的翻译\n修复了某些设备的自动生命线关联\n新的和更新的配置文件，见[这里](https://github.com/zwave-js/node-zwave-js/releases/tag/v8.7.3)"
            },
            "2.4.0": {
                "en": "Add support for SmartStart and inclusion of nodes with QR codes",
                "de": "Unterstützung für SmartStart und Inklusion von Geräten mittels QR-Codes",
                "ru": "Добавить поддержку SmartStart и включение узлов с QR-кодами",
                "pt": "Adicione suporte para SmartStart e inclusão de nós com códigos QR",
                "nl": "Ondersteuning toevoegen voor SmartStart en opname van nodes met QR-codes",
                "fr": "Ajout de la prise en charge de SmartStart et inclusion de nœuds avec des codes QR",
                "it": "Aggiungi supporto per SmartStart e inclusione di nodi con codici QR",
                "es": "Agregue soporte para SmartStart e inclusión de nodos con códigos QR",
                "pl": "Dodaj obsługę SmartStart i dołączanie węzłów z kodami QR",
                "zh-cn": "添加对 SmartStart 的支持并包含带有二维码的节点"
            },
            "2.3.2": {
                "en": "Try to detect sticks (like UZB and UZB1) that are incompatible with soft-reset and automatically disable it",
                "de": "Es wird versucht, Sticks (wie UZB und UZB1) zu erkennen, die mit Soft-Reset nicht kompatibel sind, und die Funktion automatisch zu deaktivieren",
                "ru": "Попытайтесь обнаружить палки (например, UZB и UZB1), несовместимые с soft-reset, и автоматически отключите его.",
                "pt": "Tente detectar varas (como UZB e UZB1) que são incompatíveis com soft-reset e desabilite-o automaticamente",
                "nl": "Probeer sticks (zoals UZB en UZB1) te detecteren die niet compatibel zijn met soft-reset en schakel deze automatisch uit",
                "fr": "Essayez de détecter les bâtons (comme UZB et UZB1) qui sont incompatibles avec la réinitialisation logicielle et désactivez-le automatiquement",
                "it": "Prova a rilevare gli stick (come UZB e UZB1) che sono incompatibili con il soft-reset e disabilitalo automaticamente",
                "es": "Intente detectar sticks (como UZB y UZB1) que sean incompatibles con el reinicio por software y deshabilítelo automáticamente",
                "pl": "Spróbuj wykryć drążki (takie jak UZB i UZB1), które nie są kompatybilne z miękkim resetem i automatycznie go wyłącz",
                "zh-cn": "尝试检测与软复位不兼容的棒（如 UZB 和 UZB1）并自动禁用它"
            },
            "2.3.1": {
                "en": "Add option to disable soft-reset, mention better solution in troubleshooting docs",
                "de": "Option zur Deaktivierung des Soft-Resets beim Adapterstart hinzugefügt, bessere Lösung zur Fehlerbehebung in der Dokumentation erwähnt",
                "ru": "Добавить параметр для отключения мягкого сброса, указать лучшее решение в документации по устранению неполадок",
                "pt": "Adicione a opção de desativar a reinicialização suave, mencione a melhor solução na documentação de solução de problemas",
                "nl": "Optie toevoegen om soft-reset uit te schakelen, betere oplossing vermelden in documenten voor probleemoplossing",
                "fr": "Ajouter une option pour désactiver la réinitialisation logicielle, mentionner une meilleure solution dans les documents de dépannage",
                "it": "Aggiungi l'opzione per disabilitare il soft-reset, menziona una soluzione migliore nei documenti di risoluzione dei problemi",
                "es": "Agregue la opción para deshabilitar el restablecimiento parcial, mencione una mejor solución en los documentos de solución de problemas",
                "pl": "Dodaj opcję wyłączenia miękkiego resetu, wspomnij o lepszym rozwiązaniu w dokumentacji rozwiązywania problemów",
                "zh-cn": "添加禁用软重置的选项，在故障排除文档中提及更好的解决方案"
            }
        },
        "title": "Z-Wave 2",
        "titleLang": {
            "en": "Z-Wave 2",
            "de": "Z-Wave 2",
            "ru": "Z-Wave 2",
            "pt": "Z-Wave 2",
            "nl": "Z-Wave 2",
            "fr": "Z-Wave 2",
            "it": "Z-Wave 2",
            "es": "Z-Wave 2",
            "pl": "Z-Wave 2",
            "zh-cn": "Z-Wave 2"
        },
        "desc": {
            "en": "The better Z-Wave integration",
            "de": "Die bessere Z-Wave-Integration",
            "ru": "Лучшая интеграция Z-Wave",
            "pt": "A melhor integração do Z-Wave",
            "nl": "De betere Z-Wave-integratie",
            "fr": "La meilleure intégration Z-Wave",
            "it": "La migliore integrazione di Z-Wave",
            "es": "La mejor integración de Z-Wave",
            "pl": "Lepsza integracja Z-Wave",
            "zh-cn": "更好的Z-Wave集成"
        },
        "authors": ["AlCalzone <d.griesel@gmx.net>"],
        "keywords": ["zwave", "z-wave", "zwave2", "z-wave 2"],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "build/main.js",
        "icon": "zwave2.svg",
        "enabled": true,
        "dataFolder": "zwave2.%INSTANCE%",
        "extIcon": "https://raw.githubusercontent.com/AlCalzone/ioBroker.zwave2/master/admin/zwave2.svg?sanitize=true",
        "readme": "https://github.com/AlCalzone/ioBroker.zwave2/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "hardware",
        "compact": true,
        "materialize": true,
        "materializeTab": true,
        "adminTab": {
            "name": {
                "en": "Z-Wave",
                "de": "Z-Wave"
            },
            "link": "",
            "fa-icon": "wifi"
        },
        "messagebox": true,
        "connectionType": "local",
        "dataSource": "push",
        "dependencies": [
            {
                "js-controller": ">=2.0.0"
            }
        ]
    },
    "native": {
        "serialport": "",
        "writeLogFile": false,
        "networkKey_S0": "",
        "networkKey_S2_AccessControl": "",
        "networkKey_S2_Authenticated": "",
        "networkKey_S2_Unauthenticated": "",
        "driver_increaseTimeouts": false,
        "driver_increaseSendAttempts": false,
        "switchCompat": false,
        "preserveStateNames": false,
        "notificationEventValidity": 1000,
        "disableSoftReset": false
    },
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info",
            "type": "channel",
            "common": {
                "name": "Information"
            },
            "native": {}
        },
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "Whether the Z-Wave driver is ready",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.inclusion",
            "type": "state",
            "common": {
                "role": "indicator",
                "name": "Whether the inclusion of nodes is active",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.exclusion",
            "type": "state",
            "common": {
                "role": "state",
                "name": "Whether the exclusion of nodes is active",
                "type": "boolean",
                "read": true,
                "write": true,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.healingNetwork",
            "type": "state",
            "common": {
                "role": "state",
                "name": "Whether a network heal is currently in progress",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.configVersion",
            "type": "state",
            "common": {
                "role": "state",
                "name": "The installed version of the Z-Wave JS configuration DB",
                "type": "string",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.configUpdate",
            "type": "state",
            "common": {
                "role": "state",
                "name": "The version of an available update for the Z-Wave JS configuration DB",
                "type": "string",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.configUpdating",
            "type": "state",
            "common": {
                "role": "state",
                "name": "Whether the adapter is currently updating the Z-Wave JS configuration DB",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}
