{
    "common": {
        "name": "zwave2",
        "version": "0.13.3",
        "news": {
            "0.13.3": {
                "en": "Initial values for `ready` and `status` states are now read from the nodes\nEnsure that the adapter notices when a node is ready",
                "de": "Anfangswerte für \"Bereit\" - und \"Status\" -Zustände werden jetzt von den Knoten gelesen\nStellen Sie sicher, dass der Adapter erkennt, wenn ein Knoten bereit ist",
                "ru": "Начальные значения для состояний `ready` и` status` теперь считываются с узлов\nУбедитесь, что адаптер замечает, когда узел готов",
                "pt": "Os valores iniciais dos estados `ready` e` status` agora são lidos nos nós\nCertifique-se de que o adaptador observe quando um nó está pronto",
                "nl": "De beginwaarden voor de status 'gereed' en 'status' worden nu gelezen uit de knooppunten\nZorg ervoor dat de adapter opmerkt wanneer een knooppunt gereed is",
                "fr": "Les valeurs initiales pour les états `ready` et` status` sont maintenant lues à partir des nœuds\nAssurez-vous que l'adaptateur remarque lorsqu'un nœud est prêt",
                "it": "I valori iniziali per gli stati `ready` e` status` vengono ora letti dai nodi\nAssicurarsi che l'adattatore noti quando un nodo è pronto",
                "es": "Los valores iniciales para los estados `ready` y` status` ahora se leen desde los nodos\nAsegúrese de que el adaptador se da cuenta cuando un nodo está listo",
                "pl": "Początkowe wartości dla stanów „gotowy” i „status” są teraz odczytywane z węzłów\nUpewnij się, że adapter zauważa, gdy węzeł jest gotowy",
                "zh-cn": "现在可以从节点读取“就绪”和“状态”状态的初始值\n确保适配器在节点准备就绪时发出通知"
            },
            "0.13.2": {
                "en": "Various stability and speed improvements during the interview\nConfig parameter \\#5 has been removed from the `Aeotec WallMote Quad` for firmware versions `<= 1.5`",
                "de": "Verschiedene Stabilitäts- und Geschwindigkeitsverbesserungen während des Interviews\nDer Konfigurationsparameter \\ # 5 wurde aus dem Aeotec WallMote Quad für Firmware-Versionen `<= 1.5` entfernt",
                "ru": "Различные улучшения стабильности и скорости во время интервью\nПараметр конфигурации \\ # 5 был удален из `Aeotec WallMote Quad` для версий прошивки` <= 1.5`",
                "pt": "Várias melhorias de estabilidade e velocidade durante a entrevista\nO parâmetro de configuração \\ # 5 foi removido do `Aeotec WallMote Quad` para versões de firmware` <= 1,5`",
                "nl": "Diverse stabiliteits- en snelheidsverbeteringen tijdens het interview\nConfiguratieparameter \\ # 5 is verwijderd van de `Aeotec WallMote Quad` voor firmwareversies` <= 1.5`",
                "fr": "Diverses améliorations de stabilité et de vitesse lors de l'entretien\nLe paramètre de configuration \\ # 5 a été supprimé du `Aeotec WallMote Quad` pour les versions de firmware` <= 1.5`",
                "it": "Vari miglioramenti di stabilità e velocità durante l'intervista\nIl parametro di configurazione \\ # 5 è stato rimosso da `Aeotec WallMote Quad` per le versioni del firmware` <= 1.5`",
                "es": "Varias mejoras de estabilidad y velocidad durante la entrevista.\nEl parámetro de configuración \\ # 5 se ha eliminado del `Aeotec WallMote Quad` para las versiones de firmware` <= 1.5`",
                "pl": "Różne poprawki stabilności i prędkości podczas wywiadu\nParametr konfiguracyjny \\ # 5 został usunięty z `Aeotec WallMote Quad` dla wersji oprogramowania <<1,5`",
                "zh-cn": "面试中的各种稳定性和速度改进\n固件版本“ <= 1.5”的配置参数\\＃5已从“ Aeotec WallMote Quad”中删除。"
            },
            "0.13.1": {
                "en": "Empty node names are now overwritten with the default name\nFixed an issue where Multi Channel Associations for older devices were missing",
                "de": "Leere Knotennamen werden jetzt mit dem Standardnamen überschrieben\nEs wurde ein Problem behoben, bei dem Mehrkanalzuordnungen für ältere Geräte fehlten",
                "ru": "Пустые имена узлов теперь перезаписываются именем по умолчанию\nИсправлена проблема, при которой многоканальные ассоциации для старых устройств отсутствовали",
                "pt": "Os nomes de nós vazios agora são substituídos pelo nome padrão\nCorrigido um problema em que as associações multicanal para dispositivos mais antigos estavam ausentes",
                "nl": "Lege knooppuntnamen worden nu overschreven door de standaardnaam\nEr is een probleem opgelost waarbij Multi Channel Associations voor oudere apparaten ontbraken",
                "fr": "Les noms de nœuds vides sont désormais remplacés par le nom par défaut\nCorrection d'un problème où les associations multicanaux pour les appareils plus anciens manquaient",
                "it": "I nomi dei nodi vuoti ora vengono sovrascritti con il nome predefinito\nRisolto il problema per cui mancavano le Associazioni multicanale per dispositivi meno recenti",
                "es": "Los nombres de nodo vacíos ahora se sobrescriben con el nombre predeterminado\nSe solucionó un problema en el que faltaban las asociaciones multicanal para dispositivos más antiguos.",
                "pl": "Puste nazwy węzłów są teraz zastępowane nazwą domyślną\nNaprawiono problem z brakiem powiązań wielokanałowych dla starszych urządzeń",
                "zh-cn": "现在，空节点名称将被默认名称覆盖\n修复了缺少旧设备的多渠道关联的问题"
            },
            "0.13.0": {
                "en": "Added a user interface to manage associations between nodes",
                "de": "Eine Benutzeroberfläche zum Verwalten von Zuordnungen zwischen Knoten wurde hinzugefügt",
                "ru": "Добавлен пользовательский интерфейс для управления связями между узлами",
                "pt": "Adicionada uma interface com o usuário para gerenciar associações entre nós",
                "nl": "Een gebruikersinterface toegevoegd om associaties tussen knooppunten te beheren",
                "fr": "Ajout d'une interface utilisateur pour gérer les associations entre les nœuds",
                "it": "Aggiunta un'interfaccia utente per gestire le associazioni tra nodi",
                "es": "Se agregó una interfaz de usuario para administrar asociaciones entre nodos",
                "pl": "Dodano interfejs użytkownika do zarządzania powiązaniami między węzłami",
                "zh-cn": "添加了一个用户界面来管理节点之间的关联"
            },
            "0.12.2": {
                "en": "Previously missing updates from multi channel devices should now be received again\nFixed an issue where the interview process was stalled by requesting information the devices don't understand\nFixed a crash that could happen when the adapter is restarted",
                "de": "Zuvor fehlende Updates von Mehrkanalgeräten sollten jetzt erneut empfangen werden\nEs wurde ein Problem behoben, bei dem der Interviewprozess unterbrochen wurde, indem Informationen angefordert wurden, die die Geräte nicht verstehen\nEs wurde ein Absturz behoben, der beim Neustart des Adapters auftreten konnte",
                "ru": "Ранее пропущенные обновления от многоканальных устройств теперь должны быть получены снова\nИсправлена ошибка, из-за которой процесс интервью зависал из-за запроса информации, которую устройства не понимают\nИсправлен сбой, который мог произойти при перезапуске адаптера",
                "pt": "Atualizações anteriormente ausentes de dispositivos multicanais agora devem ser recebidas novamente\nCorrigido um problema em que o processo de entrevista era interrompido solicitando informações que os dispositivos não entendiam\nCorrigida uma falha que poderia ocorrer quando o adaptador era reiniciado",
                "nl": "Eerder ontbrekende updates van apparaten met meerdere kanalen moeten nu opnieuw worden ontvangen\nEr is een probleem opgelost waarbij het interviewproces werd stopgezet door informatie op te vragen die de apparaten niet begrijpen\nEen crash verholpen die kon optreden wanneer de adapter opnieuw werd opgestart",
                "fr": "Les mises à jour précédemment manquantes des appareils multicanaux devraient maintenant être reçues à nouveau\nCorrection d'un problème où le processus d'entrevue était bloqué en demandant des informations que les appareils ne comprennent pas\nCorrection d'un plantage pouvant survenir au redémarrage de l'adaptateur",
                "it": "Gli aggiornamenti precedentemente mancanti dai dispositivi multicanale dovrebbero ora essere ricevuti di nuovo\nRisolto il problema per cui il processo di intervista era bloccato bloccando la richiesta di informazioni che i dispositivi non capivano\nRisolto un crash che poteva verificarsi al riavvio dell'adattatore",
                "es": "Las actualizaciones que faltaban anteriormente de dispositivos multicanal ahora deberían recibirse nuevamente\nSe solucionó un problema en el que el proceso de la entrevista se detenía al solicitar información que los dispositivos no entendían\nSe corrigió un bloqueo que podría ocurrir cuando se reinicia el adaptador",
                "pl": "Wcześniej brakujące aktualizacje z urządzeń wielokanałowych powinny być teraz odbierane ponownie\nNaprawiono problem polegający na tym, że proces przesłuchania był zawieszony przez żądanie informacji, których urządzenia nie rozumieją\nNaprawiono awarię, która mogła wystąpić po ponownym uruchomieniu adaptera",
                "zh-cn": "现在应该再次收到多通道设备以前缺少的更新\n修复了以下问题：通过请求设备不了解的信息而使采访过程停顿了\n修复了重启适配器后可能发生的崩溃"
            },
            "0.12.1": {
                "en": "The cache file is now loaded again correctly. This fixes some missing reports from newer multi channel devices.\nNodes are now sent to sleep 1 second after waking up if there are no pending messages. This fixes issues with some devices that expect this behavior.",
                "de": "Die Cache-Datei wird nun wieder korrekt geladen. Dies behebt einige fehlende Berichte von neueren Mehrkanalgeräten.\nKnoten werden jetzt 1 Sekunde nach dem Aufwachen in den Ruhezustand versetzt, wenn keine ausstehenden Nachrichten vorliegen. Dies behebt Probleme mit einigen Geräten, die dieses Verhalten erwarten.",
                "ru": "Файл кэша теперь снова загружен правильно. Это исправляет некоторые пропущенные отчеты от новых многоканальных устройств.\nУзлы теперь отправляются в спящий режим через 1 секунду после пробуждения, если нет ожидающих сообщений. Это устраняет проблемы с некоторыми устройствами, которые ожидают такого поведения.",
                "pt": "O arquivo de cache agora está carregado novamente corretamente. Isso corrige alguns relatórios ausentes de dispositivos multicanais mais recentes.\nAgora, os nós são enviados para dormir 1 segundo após a ativação, se não houver mensagens pendentes. Isso corrige problemas com alguns dispositivos que esperam esse comportamento.",
                "nl": "Het cachebestand is nu opnieuw correct geladen. Dit lost een aantal ontbrekende rapporten op van nieuwere multi-channel apparaten.\nKnooppunten worden nu 1 seconde na het ontwaken in de slaapstand gezet als er geen berichten in behandeling zijn. Dit lost problemen op met sommige apparaten die dit gedrag verwachten.",
                "fr": "Le fichier cache est à nouveau correctement chargé. Cela corrige certains rapports manquants des nouveaux appareils multicanaux.\nLes nœuds sont maintenant envoyés en veille 1 seconde après le réveil s'il n'y a aucun message en attente. Cela corrige des problèmes avec certains appareils qui s'attendent à ce comportement.",
                "it": "Il file della cache è ora nuovamente caricato correttamente. Questo risolve alcuni rapporti mancanti dai più recenti dispositivi multicanale.\nI nodi vengono ora messi in modalità sospensione 1 secondo dopo essersi svegliati se non ci sono messaggi in sospeso. Questo risolve i problemi con alcuni dispositivi che prevedono questo comportamento.",
                "es": "El archivo de caché ahora se vuelve a cargar correctamente. Esto corrige algunos informes faltantes de dispositivos multicanal más nuevos.\nLos nodos ahora se envían a dormir 1 segundo después de despertarse si no hay mensajes pendientes. Esto soluciona problemas con algunos dispositivos que esperan este comportamiento.",
                "pl": "Plik pamięci podręcznej jest teraz poprawnie ładowany ponownie. To naprawia niektóre brakujące raporty z nowszych urządzeń wielokanałowych.\nWęzły są teraz wysyłane do trybu uśpienia 1 sekundę po przebudzeniu, jeśli nie ma żadnych oczekujących wiadomości. To rozwiązuje problemy z niektórymi urządzeniami, które oczekują takiego zachowania.",
                "zh-cn": "现在，缓存文件已重新正确加载。这样可以修复较新的多渠道设备缺少的一些报告。\n现在，如果没有待处理的消息，则在唤醒后1秒钟将节点发送到睡眠状态。这可以修复某些设备会出现此问题的问题。"
            },
            "0.12.0": {
                "en": "* **BREAKING**: Raised minimum Node.js version to 10\n* **BREAKING**: Some duplicate states for the root endpoint have been removed\n* The network heal now updates the routes from all nodes to the controller and between associated nodes\n* Significantly reduced CPU consumption and filesystem accesses during the adapter startup\n* Added support for the `Color Switch CC`\n* Fixed a crash that happened when trying to set an invalid configuration value\n* Updated dependencies",
                "de": "* **BREAKING** Die Mindestversion von Node.js wurde auf 10 erhöht \n* **BREAKING** Einige doppelte Zustände für den Root-Endpunkt wurden entfernt \n* Die Netzwerkheilung aktualisiert jetzt die Routen von allen Knoten zum Controller und zwischen zugeordneten Knoten\n* Deutlich reduzierter CPU-Verbrauch und Dateisystemzugriffe während des Adapterstarts\n* Unterstützung für den \"Color Switch CC\" hinzugefügt\n* Ein Absturz beim Versuch, einen ungültigen Konfigurationswert festzulegen, wurde behoben\n* Abhängigkeiten aktualisiert",
                "ru": "* **BREAKING** повышена минимальная версия Node.js до 10 \n* **BREAKING** некоторые дубликаты состояний для корневой конечной точки были удалены \n* Исцеление сети теперь обновляет маршруты от всех узлов к контроллеру и между связанными узлами\n* Значительно уменьшено потребление ресурсов процессора и файловой системы при запуске адаптера.\n* Добавлена поддержка `Color Switch CC`\n* Исправлен сбой, возникающий при попытке установить неверное значение конфигурации\n* Обновлены зависимости",
                "pt": "* **BREAKING** versão mínima do Node.js aumentada para 10 \n* **BREAKING** alguns estados duplicados do terminal raiz foram removidos \n* A reparação da rede agora atualiza as rotas de todos os nós para o controlador e entre os nós associados\n* Consumo de CPU e acessos ao sistema de arquivos significativamente reduzidos durante a inicialização do adaptador\n* Adicionado suporte para o `Color Switch CC`\n* Corrigida uma falha que acontecia ao tentar definir um valor de configuração inválido\n* Dependências atualizadas",
                "nl": "* **BREAKING** Verhoogde minimale Node.js-versie naar 10 \n* **BREAKING** Sommige dubbele staten voor het root-eindpunt zijn verwijderd \n* Het netwerk genezen werkt nu de routes bij van alle knooppunten naar de controller en tussen de bijbehorende knooppunten\n* Aanzienlijk verminderd CPU-verbruik en toegang tot het bestandssysteem tijdens het opstarten van de adapter\n* Ondersteuning toegevoegd voor de `Color Switch CC`\n* Een crash verholpen die optrad bij het instellen van een ongeldige configuratiewaarde\n* Bijgewerkte afhankelijkheden",
                "fr": "* **RUPTURE** Version Node.js minimale augmentée à 10 \n* **RUPTURE** certains états en double pour le point de terminaison racine ont été supprimés \n* Le réseau soigne maintenant les itinéraires de tous les nœuds vers le contrôleur et entre les nœuds associés\n* Consommation CPU et accès au système de fichiers considérablement réduits lors du démarrage de l'adaptateur\n* Ajout de la prise en charge du «Color Switch CC»\n* Correction d'un plantage survenu lors de la tentative de définition d'une valeur de configuration non valide\n* Dépendances mises à jour",
                "it": "* **BREAKING** versione minima di Node.js aumentata a 10 \n* **BREAKING** alcuni stati duplicati per l'endpoint radice sono stati rimossi \n* La cura della rete ora aggiorna le rotte da tutti i nodi al controller e tra i nodi associati\n* Riduzione significativa del consumo di CPU e degli accessi al filesystem durante l'avvio dell'adattatore\n* Aggiunto supporto per `Color Switch CC`\n* Risolto un crash che si verificava quando si tentava di impostare un valore di configurazione non valido\n* Dipendenze aggiornate",
                "es": "* **BREAKING** versión mínima de Node.js aumentada a 10 \n* **BREAKING** se han eliminado algunos estados duplicados para el punto final raíz \n* La curación de la red ahora actualiza las rutas de todos los nodos al controlador y entre los nodos asociados\n* Consumo de CPU y acceso al sistema de archivos significativamente reducidos durante el inicio del adaptador\n* Soporte agregado para el `Color Switch CC`\n* Se corrigió un bloqueo que ocurría al intentar establecer un valor de configuración no válido\n* Dependencias actualizadas",
                "pl": "* **ŁAMANIE** Podniesiono minimalną wersję Node.js do 10 \n* **ZŁAMANIE** Niektóre zduplikowane stany dla głównego punktu końcowego zostały usunięte \n* Funkcja uzdrawiania sieci aktualizuje teraz trasy ze wszystkich węzłów do kontrolera i między powiązanymi węzłami\n* Znacząco zmniejszone zużycie procesora i dostęp do systemu plików podczas uruchamiania adaptera\n* Dodano wsparcie dla `Color Switch CC`\n* Naprawiono awarię występującą podczas próby ustawienia nieprawidłowej wartości konfiguracji\n* Zaktualizowano zależności",
                "zh-cn": "* **BREAKING** 将最低Node.js版本提高到10 \n* **BREAKING** 根端点的某些重复状态已被删除 \n*网络修复现在可以更新从所有节点到控制器以及关联节点之间的路由\n*在适配器启动期间显着减少了CPU消耗和文件系统访问\n*增加了对`Color Switch CC`的支持\n*修复了尝试设置无效配置值时发生的崩溃\n*更新了依赖"
            },
            "0.11.7": {
                "en": "* Fixed a crash that happened when setting invalid values in ioBroker\n* Fixed some compilation issues with newer typings",
                "de": "* Es wurde ein Absturz behoben, der beim Festlegen ungültiger Werte in ioBroker auftrat\n* Einige Kompilierungsprobleme mit neueren Typisierungen wurden behoben",
                "ru": "* Исправлен сбой, возникающий при установке недопустимых значений в ioBroker\n* Исправлены некоторые проблемы компиляции с новыми наборами",
                "pt": "* Corrigida uma falha que acontecia ao definir valores inválidos no ioBroker\n* Corrigidos alguns problemas de compilação com novas digitações",
                "nl": "* Een crash opgelost die optrad bij het instellen van ongeldige waarden in ioBroker\n* Enkele compilatieproblemen opgelost met nieuwere typen",
                "fr": "* Correction d'un plantage qui se produisait lors de la définition de valeurs non valides dans ioBroker\n* Correction de quelques problèmes de compilation avec des typages plus récents",
                "it": "* Risolto un crash che si verificava quando si impostavano valori non validi in ioBroker\n* Risolti alcuni problemi di compilazione con le nuove digitazioni",
                "es": "* Se corrigió un bloqueo que ocurría al establecer valores no válidos en ioBroker\n* Se corrigieron algunos problemas de compilación con tipings más nuevos",
                "pl": "* Naprawiono awarię występującą podczas ustawiania nieprawidłowych wartości w ioBroker\n* Naprawiono niektóre problemy z kompilacją przy nowszych typach",
                "zh-cn": "*修复了在ioBroker中设置无效值时发生的崩溃\n*修复了一些新类型的编译问题"
            },
            "0.11.6": {
                "en": "Changing values of the `Fibaro CC` now sends commands to the device",
                "de": "Das Ändern der Werte des Fibaro CC sendet jetzt Befehle an das Gerät",
                "ru": "Изменение значений `Fibaro CC` теперь отправляет команды на устройство",
                "pt": "A alteração dos valores do `Fibaro CC` agora envia comandos para o dispositivo",
                "nl": "Door de waarden van de `Fibaro CC` te wijzigen, worden nu opdrachten naar het apparaat gestuurd",
                "fr": "La modification des valeurs du `Fibaro CC` envoie désormais des commandes à l'appareil",
                "it": "La modifica dei valori di `Fibaro CC` ora invia comandi al dispositivo",
                "es": "Cambiar los valores del `Fibaro CC` ahora envía comandos al dispositivo",
                "pl": "Zmiana wartości `Fibaro CC` wysyła teraz polecenia do urządzenia",
                "zh-cn": "现在，更改“ Fibaro CC”的值会将命令发送到设备"
            },
            "0.11.5": {
                "en": "Fixed a bug that caused the interview process to be stuck on the `Fibaro CC`",
                "de": "Es wurde ein Fehler behoben, der dazu führte, dass der Interviewprozess auf dem \"Fibaro CC\" hängen blieb",
                "ru": "Исправлена ошибка, из-за которой процесс интервью зависал на `Fibaro CC`",
                "pt": "Corrigido um erro que fazia com que o processo de entrevista fosse travado no `Fibaro CC`",
                "nl": "Een bug gerepareerd waardoor het interviewproces op de `Fibaro CC` bleef steken",
                "fr": "Correction d'un bug qui bloquait le processus d'interview sur le `Fibaro CC`",
                "it": "Risolto un bug che causava il blocco del processo di intervista sul `Fibaro CC`",
                "es": "Se corrigió un error que causaba que el proceso de la entrevista se atascara en el `Fibaro CC`",
                "pl": "Naprawiono błąd, który powodował, że proces wywiadu blokował się na `Fibaro CC`",
                "zh-cn": "修复了导致采访过程卡在“ Fibaro CC”上的错误"
            },
            "0.11.4": {
                "en": "Fixed a crash that happened when saving the network state including a `Manufacturer Proprietary CC` to cache",
                "de": "Es wurde ein Absturz behoben, der beim Speichern des Netzwerkstatus einschließlich eines \"Manufacturer Proprietary CC\" zum Zwischenspeichern auftrat",
                "ru": "Исправлен сбой, который происходил при сохранении состояния сети, включая `проприетарный CC производителя 'в кеш",
                "pt": "Corrigida uma falha que acontecia ao salvar o estado da rede, incluindo um `CC proprietário do fabricante 'no cache",
                "nl": "Een crash verholpen die zich voordeed bij het opslaan van de netwerkstatus inclusief een `Manufacturer Proprietary CC` naar cache",
                "fr": "Correction d'un plantage qui se produisait lors de l'enregistrement de l'état du réseau, y compris un «CC propriétaire du fabricant» à mettre en cache",
                "it": "Risolto un crash che si verificava quando si salvava lo stato della rete incluso un \"CC proprietario del produttore\" nella cache",
                "es": "Se corrigió un bloqueo que ocurría al guardar el estado de la red, incluido un `CC propietario del fabricante` en caché",
                "pl": "Naprawiono awarię, która występowała podczas zapisywania stanu sieci, w tym „Producent zastrzeżony CC” do pamięci podręcznej",
                "zh-cn": "修复了将包含“制造商专有CC”的网络状态保存到缓存时发生的崩溃"
            },
            "0.11.3": {
                "en": "Fixed a crash that happens when controlling blinds using the `Fibaro Venetian Blind CC`",
                "de": "Es wurde ein Absturz behoben, der beim Steuern von Jalousien mit dem \"Fibaro Venetian Blind CC\" auftrat",
                "ru": "Исправлен сбой, возникающий при управлении блайндами с помощью `Fibaro Venetian Blind CC`",
                "pt": "Corrigida uma falha que acontecia ao controlar os blinds usando o `Fibaro Venetian Blind CC`",
                "nl": "Een crash gerepareerd die optreedt bij het bedienen van blinds met de `Fibaro Venetian Blind CC`",
                "fr": "Correction d'un crash qui se produisait lors du contrôle des stores à l'aide du `Fibaro Venetian Blind CC`",
                "it": "Risolto un crash che si verificava quando si controllavano i blind usando il `Fibaro Venetian Blind CC`",
                "es": "Se corrigió un bloqueo que ocurre al controlar las persianas usando el `Fibaro Venetian Blind CC`",
                "pl": "Naprawiono awarię występującą podczas kontrolowania żaluzji za pomocą `Fibaro Venetian Blind CC`",
                "zh-cn": "修复了使用“ Fibaro Venetian Blind CC”控制百叶窗时发生的崩溃"
            },
            "0.11.2": {
                "en": "Updated `zwave-js` to v2.15.3. This includes the following fixes:\n* Fixed an issue where the firmware version of nodes would not be read correctly\n* Fixed an issue that caused the interview procedure for the `Manufacturer Proprietary CC` to be skipped",
                "de": "`Zwave-js` wurde auf v2.15.3 aktualisiert. Dies beinhaltet die folgenden Korrekturen:\n* Es wurde ein Problem behoben, bei dem die Firmware-Version von Knoten nicht korrekt gelesen wurde\n* Es wurde ein Problem behoben, durch das das Interviewverfahren für das \"Manufacturer Proprietary CC\" übersprungen wurde",
                "ru": "Обновлен `zwave-js` до v2.15.3. Это включает в себя следующие исправления:\n* Исправлена ошибка, из-за которой версия прошивки узлов не читалась правильно\n* Исправлена ошибка, приводившая к пропуску процедуры собеседования для «Проприетарной CC производителя».",
                "pt": "Atualizado `zwave-js` para a v2.15.3. Isso inclui as seguintes correções:\n* Corrigido um problema em que a versão do firmware dos nós não era lida corretamente.\n* Corrigido um problema que fazia com que o procedimento de entrevista para o `Fabricante Proprietário CC 'fosse ignorado",
                "nl": "`Zwave-js` bijgewerkt naar v2.15.3. Dit omvat de volgende fixes:\n* Probleem opgelost waarbij de firmwareversie van knooppunten niet correct zou worden gelezen\n* Probleem opgelost waardoor de interviewprocedure voor de `Manufacturer Proprietary CC` werd overgeslagen",
                "fr": "Mise à jour de `zwave-js` vers v2.15.3. Cela inclut les correctifs suivants:\n* Correction d'un problème où la version du firmware des nœuds ne serait pas lue correctement\n* Correction d'un problème qui faisait que la procédure d'entrevue pour le «CC propriétaire du fabricant» était sautée",
                "it": "`Zwave-js` aggiornato alla v2.15.3. Ciò include le seguenti correzioni:\n* Risolto il problema per cui la versione del firmware dei nodi non veniva letta correttamente\n* Risolto un problema che causava il salto della procedura di intervista per il \"CC proprietario del produttore\"",
                "es": "Actualizado `zwave-js` a v2.15.3. Esto incluye las siguientes correcciones:\n* Se solucionó un problema por el cual la versión de firmware de los nodos no se leía correctamente\n* Se solucionó un problema que hacía que se omitiera el procedimiento de entrevista para el `CC propietario del fabricante`",
                "pl": "Zaktualizowano `zwave-js` do v2.15.3. Obejmuje to następujące poprawki:\n* Naprawiono problem polegający na tym, że wersja oprogramowania węzłów nie była poprawnie odczytywana\n* Naprawiono problem, który powodował pominięcie procedury wywiadu dla „Zastrzeżonego CC producenta”",
                "zh-cn": "将`zwave-js`更新为v2.15.3。其中包括以下修复程序：\n*修复了无法正确读取节点的固件版本的问题\n*修复了导致“制造商专有CC”的面试程序被跳过的问题"
            },
            "0.11.1": {
                "en": "Updated `zwave-js` to v2.15.2. This includes the following improvements and fixes:\n* Shortened the interview procedure for some multichannel devices\n* Updated `ZHC5002` configuration for firmware versions starting with 2.02\n* The clock of devices supporting `Clock CC` can now be automatically kept in sync with the controller\n* Completed support for the `Fibaro Venetian Blind CC`\n* Added support for older devices supporting `Multi Instance CC`\n* The name and status of the controller is now correctly shown in the objects list\n* Values for the root endpoint are now hidden if a corresponding values exists on at least one endpoint",
                "de": "`Zwave-js` wurde auf v2.15.2 aktualisiert. Dies umfasst die folgenden Verbesserungen und Korrekturen:\n* Das Interviewverfahren für einige Mehrkanalgeräte wurde verkürzt\n* Aktualisierte `ZHC5002` Konfiguration für Firmware-Versionen ab 2.02\n* Die Uhr von Geräten, die \"Clock CC\" unterstützen, kann jetzt automatisch mit der Steuerung synchronisiert werden\n* Unterstützung für den \"Fibaro Venetian Blind CC\" abgeschlossen\n* Unterstützung für ältere Geräte hinzugefügt, die \"Multi Instance CC\" unterstützen\n* Der Name und der Status des Controllers werden jetzt korrekt in der Objektliste angezeigt\n* Werte für den Stammendpunkt werden jetzt ausgeblendet, wenn auf mindestens einem Endpunkt entsprechende Werte vorhanden sind",
                "ru": "Обновлен `zwave-js` до v2.15.2. Это включает в себя следующие улучшения и исправления:\n* Сокращена процедура интервью для некоторых многоканальных устройств\n* Обновлена конфигурация `ZHC5002` для версий прошивки, начиная с 2.02\n* Часы устройств, поддерживающих Clock CC, теперь могут автоматически синхронизироваться с контроллером.\n* Завершена поддержка `Fibaro Venetian Blind CC`\n* Добавлена поддержка старых устройств, поддерживающих `Multi Instance CC`\n* Имя и статус контроллера теперь правильно отображаются в списке объектов.\n* Значения для корневой конечной точки теперь скрыты, если соответствующие значения существуют хотя бы на одной конечной точке",
                "pt": "Atualizado `zwave-js` para a v2.15.2. Isso inclui os seguintes aprimoramentos e correções:\n* Encurtou o procedimento de entrevista para alguns dispositivos multicanal\n* Configuração `ZHC5002` atualizada para versões de firmware começando com 2.02\n* O relógio dos dispositivos que suportam o `Clock CC` agora pode ser automaticamente sincronizado com o controlador\n* Suporte completo para o `Fibaro Venetian Blind CC`\n* Adicionado suporte para dispositivos mais antigos que suportam o `Multi Instance CC`\n* O nome e o status do controlador agora são mostrados corretamente na lista de objetos\n* Os valores para o terminal raiz agora estão ocultos se existir um valor correspondente em pelo menos um terminal",
                "nl": "`Zwave-js` bijgewerkt naar v2.15.2. Dit omvat de volgende verbeteringen en fixes:\n* Verkorte interviewprocedure voor sommige apparaten met meerdere kanalen\n* Bijgewerkte `ZHC5002`-configuratie voor firmwareversies beginnend met 2.02\n* De klok van apparaten die `Clock CC` ondersteunen, kan nu automatisch synchroon worden gehouden met de controller\n* Voltooide ondersteuning voor de `Fibaro Venetian Blind CC`\n* Ondersteuning toegevoegd voor oudere apparaten die `Multi Instance CC` ondersteunen\n* De naam en status van de controller worden nu correct weergegeven in de objectenlijst\n* Waarden voor het root-eindpunt zijn nu verborgen als er een overeenkomstige waarde bestaat voor ten minste één eindpunt",
                "fr": "`Zwave-js` mis à jour vers v2.15.2. Cela inclut les améliorations et correctifs suivants:\n* Raccourci la procédure d'entretien pour certains appareils multicanaux\n* Configuration `ZHC5002` mise à jour pour les versions de firmware commençant par 2.02\n* L'horloge des appareils prenant en charge «Clock CC» peut maintenant être automatiquement synchronisée avec le contrôleur\n* Prise en charge complète du «Fibaro Venetian Blind CC»\n* Ajout de la prise en charge des appareils plus anciens prenant en charge «Multi Instance CC»\n* Le nom et l'état du contrôleur sont désormais correctement affichés dans la liste des objets\n* Les valeurs du point de terminaison racine sont désormais masquées s'il existe des valeurs correspondantes sur au moins un point de terminaison",
                "it": "`Zwave-js` aggiornato alla v2.15.2. Ciò include i seguenti miglioramenti e correzioni:\n* Ridotta la procedura di intervista per alcuni dispositivi multicanale\n* Aggiornata la configurazione `ZHC5002` per le versioni del firmware che iniziano con 2.02\n* L'orologio dei dispositivi che supportano `Clock CC` ora può essere automaticamente sincronizzato con il controller\n* Supporto completo per il `Fibaro Venetian Blind CC`\n* Aggiunto supporto per dispositivi più vecchi che supportano `Multi Instance CC`\n* Il nome e lo stato del controller ora vengono visualizzati correttamente nell'elenco degli oggetti\n* I valori per l'endpoint radice sono ora nascosti se esistono almeno valori corrispondenti su almeno un endpoint",
                "es": "Actualizado `zwave-js` a v2.15.2. Esto incluye las siguientes mejoras y correcciones:\n* Se acortó el procedimiento de entrevista para algunos dispositivos multicanal.\n* Configuración actualizada de `ZHC5002` para versiones de firmware que comienzan con2.02\n* El reloj de los dispositivos compatibles con `Clock CC` ahora se puede mantener sincronizado automáticamente con el controlador\n* Soporte completo para el `Fibaro Venetian Blind CC`\n* Se agregó soporte para dispositivos más antiguos que admiten `Multi Instance CC`\n* El nombre y el estado del controlador ahora se muestran correctamente en la lista de objetos\n* Los valores para el punto final raíz ahora están ocultos si existe un valor correspondiente en al menos un punto final",
                "pl": "Zaktualizowano `zwave-js` do v2.15.2. Obejmuje to następujące ulepszenia i poprawki:\n* Skrócono procedurę wywiadu dla niektórych urządzeń wielokanałowych\n* Zaktualizowana konfiguracja `ZHC5002` dla wersji oprogramowania układowego zaczynających się od 2.02\n* Zegar urządzeń obsługujących `Clock CC` może być teraz automatycznie synchronizowany z kontrolerem\n* Ukończono wsparcie dla `Fibaro Venetian Blind CC`\n* Dodano obsługę starszych urządzeń obsługujących `Multi Instance CC`\n* Nazwa i status kontrolera jest teraz poprawnie wyświetlany na liście obiektów\n* Wartości dla głównego punktu końcowego są teraz ukryte, jeśli istnieją odpowiednie wartości w co najmniej jednym punkcie końcowym",
                "zh-cn": "将`zwave-js`更新为v2.15.2。这包括以下改进和修复：\n*缩短了某些多通道设备的采访程序\n*更新了“ZHC5002”配置，固件版本从2.02开始\n*现在可以将支持“ Clock CC”的设备的时钟自动与控制器保持同步\n*完全支持“ Fibaro百叶帘CC”\n*增加了对支持“多实例CC”的旧设备的支持\n*控制器的名称和状态现在可以正确显示在对象列表中\n*如果至少一个端点上存在相应的值，则根端点的值现在被隐藏"
            },
            "0.10.0": {
                "en": "* Updated `zwave-js` to v2.13.3 to improve support for older `Multi Channel` devices\n* Added an *actions* dialog to the device overview, which allows performing node-specific actions. The first available action is removing failed nodes.\n* Added a `ready` state for nodes which can be used in scripts to check if the node is ready to accept commands\n* Value that are set to `undefined` are now converted to `null` before being passed to ioBroker. This avoids a bug in the javascript adapter where triggers would be called with wrong state values.",
                "de": "* `Zwave-js` wurde auf v2.13.3 aktualisiert, um die Unterstützung für ältere` Multi Channel`-Geräte zu verbessern\n* Der Geräteübersicht wurde ein Dialogfeld *Aktionen* hinzugefügt, in dem knotenspezifische Aktionen ausgeführt werden können. Die erste verfügbare Aktion ist das Entfernen ausgefallener Knoten. \n* Bereitschaftsstatus für Knoten hinzugefügt, der in Skripten verwendet werden kann, um zu prüfen, ob der Knoten bereit ist, Befehle anzunehmen\n* Werte, die auf \"undefined\" gesetzt sind, werden jetzt in \"null\" konvertiert, bevor sie an ioBroker übergeben werden. Dies vermeidet einen Fehler im Javascript-Adapter, bei dem Trigger mit falschen Statuswerten aufgerufen werden.",
                "ru": "* Обновлен `zwave-js` до v2.13.3 для улучшения поддержки старых` Многоканальных` устройств\n* В обзор устройства добавлен диалог *actions* который позволяет выполнять специфичные для узла действия. Первое доступное действие - удаление неисправных узлов. \n* Добавлено состояние `ready` для узлов, которые можно использовать в скриптах для проверки готовности узла принимать команды\n* Значение, для которого установлено значение «undefined», теперь преобразуется в «null» перед передачей в ioBroker. Это позволяет избежать ошибки в адаптере javascript, когда триггеры будут вызываться с неправильными значениями состояния.",
                "pt": "* Atualizado zwave-js` para a v2.13.3 para melhorar o suporte a dispositivos antigos multicanais\n* Foi adicionada uma caixa de diálogo *actions* à visão geral do dispositivo, que permite executar ações específicas do nó. A primeira ação disponível é remover nós com falha. \n* Adicionado um estado `pronto 'para nós, que pode ser usado em scripts para verificar se o nó está pronto para aceitar comandos\n* O valor definido como `indefinido` agora é convertido em` null` antes de ser passado para o ioBroker. Isso evita um erro no adaptador javascript, em que os acionadores seriam chamados com valores de estado incorretos.",
                "nl": "* Bijgewerkt `zwave-js` naar v2.13.3 om de ondersteuning voor oudere` Multi Channel`-apparaten te verbeteren\n* Een *acties* dialoogvenster toegevoegd aan het apparaatoverzicht, waarmee knooppuntspecifieke acties kunnen worden uitgevoerd. De eerste beschikbare actie is het verwijderen van mislukte knooppunten. \n* Een `ready'-status toegevoegd voor knooppunten die in scripts kunnen worden gebruikt om te controleren of het knooppunt klaar is om opdrachten te accepteren\n* Waarde die is ingesteld op `undefined` wordt nu geconverteerd naar` null` voordat deze wordt doorgegeven aan ioBroker. Dit voorkomt een fout in de javascript-adapter waarbij triggers met verkeerde statuswaarden worden aangeroepen.",
                "fr": "* Mise à jour de `zwave-js` vers v2.13.3 pour améliorer la prise en charge des anciens appareils` Multi Channel`\n* Ajout d'une boîte de dialogue *actions* à la vue d'ensemble de l'appareil, qui permet d'effectuer des actions spécifiques au nœud. La première action disponible consiste à supprimer les nœuds défaillants. \n* Ajout d'un état «prêt» pour les nœuds qui peut être utilisé dans les scripts pour vérifier si le nœud est prêt à accepter les commandes\n* Les valeurs définies sur «undefined» sont désormais converties en «null» avant d'être transmises à ioBroker. Cela évite un bogue dans l'adaptateur javascript où les déclencheurs seraient appelés avec des valeurs d'état incorrectes.",
                "it": "* Aggiornato `zwave-js` a v2.13.3 per migliorare il supporto per i vecchi dispositivi` Multi Channel`\n* Aggiunta una finestra di dialogo *azioni* alla panoramica del dispositivo, che consente di eseguire azioni specifiche del nodo. La prima azione disponibile è la rimozione di nodi non riusciti. \n* Aggiunto uno stato `ready` per i nodi che può essere usato negli script per verificare se il nodo è pronto ad accettare comandi\n* I valori impostati su `undefined` vengono ora convertiti in` null` prima di essere passati a ioBroker. Ciò evita un bug nell'adattatore javascript in cui i trigger verrebbero chiamati con valori di stato errati.",
                "es": "* Se actualizó `zwave-js` a v2.13.3 para mejorar la compatibilidad con dispositivos más antiguos de` Multi Channel`\n* Se agregó un cuadro de diálogo *acciones* a la descripción general del dispositivo, que permite realizar acciones específicas de nodo. La primera acción disponible es eliminar nodos fallidos. \n* Se agregó un estado 'listo' para los nodos que se puede usar en scripts para verificar si el nodo está listo para aceptar comandos\n* Los valores configurados en `undefined` ahora se convierten en` null` antes de pasarlos a ioBroker. Esto evita un error en el adaptador de JavaScript donde los disparadores se llamarían con valores de estado incorrectos.",
                "pl": "* Zaktualizowano `zwave-js` do wersji 2.13.3, aby poprawić obsługę starszych urządzeń` Multi Channel`\n* Dodano okno dialogowe *akcji* do przeglądu urządzenia, które umożliwia wykonywanie akcji specyficznych dla węzła. Pierwszą dostępną akcją jest usunięcie uszkodzonych węzłów. \n* Dodano stan „gotowy” dla węzłów, którego można używać w skryptach do sprawdzania, czy węzeł jest gotowy do przyjmowania poleceń\n* Wartości, które są ustawione na „niezdefiniowane” są teraz konwertowane na „null” przed przekazaniem do ioBroker. Pozwala to uniknąć błędu w adapterze javascript, w którym wyzwalacze byłyby wywoływane z nieprawidłowymi wartościami stanu.",
                "zh-cn": "*将`zwave-js`更新为v2.13.3，以改进对较旧`Multi Channel`设备的支持\n*在设备概述中添加了“操作”对话框，该对话框允许执行特定于节点的操作。第一个可用的操作是删除故障节点。\n*为节点添加了“就绪”状态，可以在脚本中使用该状态来检查节点是否准备好接受命令\n*设置为“未定义”的值在传递给ioBroker之前已转换为“空”。这避免了JavaScript适配器中的错误，该错误会以错误的状态值调用触发器。"
            },
            "0.9.6": {
                "en": "Updated `zwave-js` to v2.13.2. This includes the following fixes:\n* Improved support for older devices with multiple endpoints\n* The *HeatIt Z-Push Button 8* should now correctly be detected\n* Potential fix for weird behavior of Start Level Change commands in some devices.",
                "de": "`Zwave-js` wurde auf v2.13.2 aktualisiert. Dies beinhaltet die folgenden Korrekturen:\n* Verbesserte Unterstützung für ältere Geräte mit mehreren Endpunkten\n* Der *HeatIt Z-Push Button 8* sollte nun korrekt erkannt werden \n* Mögliche Korrektur für seltsames Verhalten der Befehle zum Ändern der Startebene in einigen Geräten.",
                "ru": "Обновлен `zwave-js` до v2.13.2. Это включает в себя следующие исправления:\n* Улучшена поддержка старых устройств с несколькими конечными точками\n* Кнопка HeatIt Z-Push 8 * теперь должна правильно определяться\n* Возможное исправление странного поведения команд Start Level Change в некоторых устройствах.",
                "pt": "Atualizado `zwave-js` para a v2.13.2. Isso inclui as seguintes correções:\n* Suporte aprimorado para dispositivos mais antigos com vários pontos de extremidade\n* O *HeatIt Z-Push Button 8* deve agora ser corretamente detectado \n* Correção potencial para um comportamento estranho dos comandos Iniciar mudança de nível em alguns dispositivos.",
                "nl": "`Zwave-js` bijgewerkt naar v2.13.2. Dit omvat de volgende fixes:\n* Verbeterde ondersteuning voor oudere apparaten met meerdere eindpunten\n* De *HeatIt Z-drukknop 8* moet nu correct worden gedetecteerd \n* Mogelijke oplossing voor raar gedrag van Start Level Change-opdrachten op sommige apparaten.",
                "fr": "`Zwave-js` mis à jour vers v2.13.2. Cela inclut les correctifs suivants:\n* Prise en charge améliorée des appareils plus anciens avec plusieurs points de terminaison\n* Le *HeatIt Z-Push Button 8* devrait maintenant être correctement détecté \n* Correction potentielle d'un comportement étrange des commandes de changement de niveau de démarrage sur certains appareils.",
                "it": "Aggiornato `zwave-js` a v2.13.2. Ciò include le seguenti correzioni:\n* Supporto migliorato per dispositivi meno recenti con più endpoint\n* Il *pulsante HeatIt Z-Push 8* ora dovrebbe essere rilevato correttamente \n* Potenziale correzione per il comportamento strano dei comandi di modifica del livello iniziale in alcuni dispositivi.",
                "es": "Actualizado `zwave-js` a v2.13.2. Esto incluye las siguientes correcciones:\n* Soporte mejorado para dispositivos más antiguos con múltiples puntos finales\n* El *HeatIt Z-Push Button 8* ahora debería detectarse correctamente \n* Posible solución para el comportamiento extraño de los comandos de inicio de cambio de nivel en algunos dispositivos.",
                "pl": "Zaktualizowano `zwave-js` do wersji 2.13.2. Obejmuje to następujące poprawki:\n* Poprawiona obsługa starszych urządzeń z wieloma punktami końcowymi\n*Teraz należy poprawnie wykryć przycisk * HeatIt Z-Push 8*\n* Potencjalna poprawka dla dziwnego zachowania poleceń zmiany poziomu początkowego w niektórych urządzeniach.",
                "zh-cn": "将`zwave-js`更新为v2.13.2。其中包括以下修复程序：\n*改进了对具有多个端点的旧设备的支持\n*现在可以正确检测到* HeatIt Z-Push Button 8 *\n*修复了某些设备中“开始级别更改”命令怪异行为的潜在修复。"
            },
            "0.9.5": {
                "en": "Updated `zwave-js` to v2.13.0. This includes the following changes:\n* Improved support for some notifications types\n* Added support for the `Clock CC`.\n* Fixed a bug where unsolicited commands could wrongly be interpreted as a response to the current request",
                "de": "`Zwave-js` wurde auf v2.13.0 aktualisiert. Dies beinhaltet die folgenden Änderungen:\n* Verbesserte Unterstützung für einige Benachrichtigungstypen\n* Unterstützung für \"Clock CC\" hinzugefügt.\n* Ein Fehler wurde behoben, durch den unerwünschte Befehle fälschlicherweise als Antwort auf die aktuelle Anfrage interpretiert wurden",
                "ru": "Обновлен `zwave-js` до v2.13.0. Это включает в себя следующие изменения:\n* Улучшена поддержка некоторых типов уведомлений\n* Добавлена поддержка `Clock CC`.\n* Исправлена ошибка, при которой нежелательные команды могли ошибочно интерпретироваться как ответ на текущий запрос",
                "pt": "Atualizado `zwave-js` para a v2.13.0. Isso inclui as seguintes alterações:\n* Suporte aprimorado para alguns tipos de notificações\n* Adicionado suporte para o `Clock CC`.\n* Corrigido um erro em que comandos não solicitados podiam ser interpretados erroneamente como uma resposta à solicitação atual",
                "nl": "`Zwave-js` bijgewerkt naar v2.13.0. Dit omvat de volgende wijzigingen:\n* Verbeterde ondersteuning voor sommige typen meldingen\n* Ondersteuning toegevoegd voor de `Clock CC`.\n* Een bug opgelost waarbij ongevraagde commando's ten onrechte als een reactie op het huidige verzoek konden worden geïnterpreteerd",
                "fr": "Mise à jour de `zwave-js` vers v2.13.0. Cela inclut les modifications suivantes:\n* Prise en charge améliorée de certains types de notifications\n* Ajout du support pour le `Clock CC`.\n* Correction d'un bug où les commandes non sollicitées pouvaient être interprétées à tort comme une réponse à la demande en cours",
                "it": "`Zwave-js` aggiornato alla v2.13.0. Ciò include le seguenti modifiche:\n* Supporto migliorato per alcuni tipi di notifiche\n* Aggiunto il supporto per il `Clock CC`.\n* Risolto un bug in cui i comandi non richiesti potevano essere erroneamente interpretati come una risposta alla richiesta corrente",
                "es": "Actualizado `zwave-js` a v2.13.0. Esto incluye los siguientes cambios:\n* Soporte mejorado para algunos tipos de notificaciones\n* Se agregó soporte para el `Clock CC`.\n* Se corrigió un error por el cual los comandos no solicitados podían interpretarse erróneamente como una respuesta a la solicitud actual",
                "pl": "Zaktualizowano `zwave-js` do v2.13.0. Obejmuje to następujące zmiany:\n* Ulepszona obsługa niektórych typów powiadomień\n* Dodano obsługę `Clock CC`.\n* Naprawiono błąd, w którym niezamówione polecenia mogły być błędnie interpretowane jako odpowiedź na bieżące żądanie",
                "zh-cn": "将`zwave-js`更新为v2.13.0。这包括以下更改：\n*改进了对某些通知类型的支持\n*增加了对“时钟CC”的支持。\n*修复了一个错误，该错误将未经请求的命令错误地解释为对当前请求的响应"
            },
            "0.9.4": {
                "en": "* Small performance improvements\n* Fixed an error that could happen when a state was changed before the driver is ready\n* Updated `zwave-js` to v2.12.3. This includes the following changes:\n\t* The interview sequence for `Thermostat CC` V1/V2 should no longer get stuck\n\t* Improved handling of nodes that don't respond to a request\n\t* Minor stability improvements and bugfixes",
                "de": "* Kleine Leistungsverbesserungen\n* Es wurde ein Fehler behoben, der auftreten konnte, wenn ein Status geändert wurde, bevor der Treiber bereit war\n* `Zwave-js` wurde auf v2.12.3 aktualisiert. Dies beinhaltet die folgenden Änderungen:\n* Die Interviewsequenz für `Thermostat CC` V1 / V2 sollte nicht mehr hängen bleiben\n* Verbesserte Behandlung von Knoten, die nicht auf eine Anfrage antworten\n* Kleinere Stabilitätsverbesserungen und Bugfixes",
                "ru": "* Небольшие улучшения производительности\n* Исправлена ошибка, которая могла произойти при изменении состояния до того, как драйвер будет готов\n* Обновлен `zwave-js` до v2.12.3. Это включает в себя следующие изменения:\n* Последовательность интервью для «Термостата CC» V1 / V2 больше не должна застрять\n* Улучшена обработка узлов, которые не отвечают на запрос\n* Незначительные улучшения стабильности и исправления ошибок",
                "pt": "* Pequenas melhorias de desempenho\n* Corrigido um erro que poderia acontecer quando um estado era alterado antes do driver estar pronto\n* Atualizado `zwave-js` para a v2.12.3. Isso inclui as seguintes alterações:\n* A sequência de entrevistas para `Thermostat CC` V1 / V2 não deve mais ficar presa\n* Manipulação aprimorada de nós que não respondem a uma solicitação\n* Pequenas melhorias de estabilidade e correções",
                "nl": "* Kleine prestatieverbeteringen\n* Een fout opgelost die kon optreden wanneer een status werd gewijzigd voordat het stuurprogramma gereed was\n* Bijgewerkt `zwave-js` naar v2.12.3. Dit omvat de volgende wijzigingen:\n* De interviewsequentie voor `Thermostat CC` V1 / V2 moet niet meer vastlopen\n* Verbeterde afhandeling van knooppunten die niet op een verzoek reageren\n* Kleine stabiliteitsverbeteringen en bugfixes",
                "fr": "* Petites améliorations de performances\n* Correction d'une erreur qui pouvait survenir lorsqu'un état était modifié avant que le pilote ne soit prêt\n* Mise à jour de `zwave-js` vers v2.12.3. Cela inclut les modifications suivantes:\n* La séquence d'interview pour `Thermostat CC` V1 / V2 ne devrait plus rester bloquée\n* Gestion améliorée des nœuds qui ne répondent pas à une demande\n* Améliorations de stabilité mineures et corrections de bugs",
                "it": "* Piccoli miglioramenti delle prestazioni\n* Risolto un errore che poteva verificarsi quando uno stato veniva cambiato prima che il driver fosse pronto\n* Aggiornato `zwave-js` a v2.12.3. Ciò include le seguenti modifiche:\n* La sequenza di interviste per `Thermostat CC` V1 / V2 non dovrebbe più bloccarsi\n* Migliore gestione dei nodi che non rispondono a una richiesta\n* Miglioramenti e correzioni di stabilità minori",
                "es": "* Pequeñas mejoras de rendimiento\n* Se corrigió un error que podía ocurrir cuando se cambiaba un estado antes de que el controlador esté listo\n* Actualizado `zwave-js` a v2.12.3. Esto incluye los siguientes cambios:\n* La secuencia de la entrevista para `Thermostat CC` V1 / V2 ya no debería atascarse\n* Manejo mejorado de nodos que no responden a una solicitud\n* Pequeñas mejoras de estabilidad y correcciones de errores",
                "pl": "* Małe ulepszenia wydajności\n* Naprawiono błąd, który mógł wystąpić, gdy stan został zmieniony, zanim sterownik jest gotowy\n* Zaktualizowano `zwave-js` do v2.12.3. Obejmuje to następujące zmiany:\n* Sekwencja wywiadów dla „Thermostat CC” V1 / V2 nie powinna się już zacinać\n* Ulepszona obsługa węzłów, które nie odpowiadają na żądanie\n* Drobne ulepszenia stabilności i poprawki błędów",
                "zh-cn": "*小性能改进\n*修复了在驱动程序准备就绪之前更改状态时可能发生的错误\n*更新了`zwave-js`至v2.12.3。这包括以下更改：\n*“ Thermostat CC” V1 / V2的采访顺序不再受困\n*改进了对不响应请求的节点的处理\n*较小的稳定性改进和错误修正"
            },
            "0.9.3": {
                "en": "* Updated `zwave-js` to v2.12.2. This should fix issues with older Thermostats.",
                "de": "* `Zwave-js` wurde auf v2.12.2 aktualisiert. Dies sollte Probleme mit älteren Thermostaten beheben.",
                "ru": "* Обновлен `zwave-js` до v2.12.2. Это должно исправить проблемы со старыми термостатами.",
                "pt": "* Atualizado `zwave-js` para a v2.12.2. Isso deve corrigir problemas com termostatos mais antigos.",
                "nl": "* Bijgewerkt `zwave-js` naar v2.12.2. Dit zou problemen met oudere thermostaten moeten oplossen.",
                "fr": "* Mise à jour de `zwave-js` vers v2.12.2. Cela devrait résoudre les problèmes avec les anciens thermostats.",
                "it": "* Aggiornato `zwave-js` a v2.12.2. Ciò dovrebbe risolvere i problemi con i vecchi termostati.",
                "es": "* Actualizado `zwave-js` a v2.12.2. Esto debería solucionar problemas con termostatos antiguos.",
                "pl": "* Zaktualizowano `zwave-js` do v2.12.2. To powinno rozwiązać problemy ze starszymi termostatami.",
                "zh-cn": "*更新了`zwave-js`至v2.12.2。这应该可以解决旧式恒温器的问题。"
            },
            "0.9.2": {
                "en": "Updated `zwave-js` to v2.12.1. This includes the following changes:\n* When a node is removed from the network, all associations to it are also removed\n* The interview procedure is now canceled and retried when an error occurs instead of silently failing all futher steps\n* Improvents to the network heal process were made\n* Several stability improvements regarding the interview procedure and handling of sleeping nodes",
                "de": "`Zwave-js` wurde auf v2.12.1 aktualisiert. Dies beinhaltet die folgenden Änderungen:\n* Wenn ein Knoten aus dem Netzwerk entfernt wird, werden auch alle Zuordnungen zu diesem Knoten entfernt\n* Der Interview-Vorgang wird jetzt abgebrochen und wiederholt, wenn ein Fehler auftritt, anstatt stillschweigend alle weiteren Schritte fehlzuschlagen\n* Der Netzwerkheilungsprozess wurde verbessert\n* Verschiedene Stabilitätsverbesserungen bezüglich des Interviewverfahrens und des Umgangs mit schlafenden Knoten",
                "ru": "Обновлен `zwave-js` до v2.12.1. Это включает в себя следующие изменения:\n* Когда узел удаляется из сети, все связи с ним также удаляются\n* Процедура собеседования теперь отменяется и повторяется при возникновении ошибки, вместо того, чтобы молча пропустить все дальнейшие шаги\n* Были внесены улучшения в процесс лечения сети\n* Несколько улучшений стабильности в отношении процедуры интервью и обработки спящих узлов",
                "pt": "Atualizado `zwave-js` para a v2.12.1. Isso inclui as seguintes alterações:\n* Quando um nó é removido da rede, todas as associações a ele também são removidas\n* O procedimento de entrevista agora é cancelado e repetido quando ocorre um erro em vez de falhar silenciosamente em todas as etapas posteriores\n* Melhorias no processo de recuperação da rede foram feitas\n* Várias melhorias de estabilidade em relação ao procedimento de entrevista e manuseio de nós adormecidos",
                "nl": "`Zwave-js` bijgewerkt naar v2.12.1. Dit omvat de volgende wijzigingen:\n* Wanneer een knooppunt uit het netwerk wordt verwijderd, worden alle bijbehorende koppelingen ook verwijderd\n* De interviewprocedure is nu geannuleerd en opnieuw geprobeerd als er een fout optreedt in plaats van alle verdere stappen stilzwijgend te laten mislukken\n* Er zijn verbeteringen aangebracht in het netwerkherstelproces\n* Verschillende stabiliteitsverbeteringen met betrekking tot de interviewprocedure en de behandeling van slapende knopen",
                "fr": "Mise à jour de `zwave-js` vers v2.12.1. Cela inclut les modifications suivantes:\n* Lorsqu'un nœud est supprimé du réseau, toutes les associations avec lui sont également supprimées\n* La procédure d'entrevue est maintenant annulée et réessayée lorsqu'une erreur se produit au lieu d'échouer silencieusement à toutes les étapes ultérieures\n* Des améliorations ont été apportées au processus de guérison du réseau\n* Plusieurs améliorations de stabilité concernant la procédure d'entretien et la gestion des nœuds endormis",
                "it": "`Zwave-js` aggiornato alla v2.12.1. Ciò include le seguenti modifiche:\n* Quando un nodo viene rimosso dalla rete, vengono rimosse anche tutte le associazioni ad esso\n* La procedura di intervista ora viene annullata e riprovata quando si verifica un errore invece di fallire silenziosamente tutti i passaggi successivi\n* Sono stati apportati miglioramenti al processo di guarigione della rete\n* Diversi miglioramenti della stabilità relativi alla procedura di intervista e alla gestione dei nodi dormienti",
                "es": "Actualizado `zwave-js` a v2.12.1. Esto incluye los siguientes cambios:\n* Cuando se elimina un nodo de la red, también se eliminan todas sus asociaciones.\n* El procedimiento de entrevista ahora se cancela y se vuelve a intentar cuando ocurre un error en lugar de fallar silenciosamente todos los pasos posteriores\n* Se realizaron mejoras en el proceso de curación de la red.\n* Varias mejoras de estabilidad con respecto al procedimiento de entrevista y manejo de los nodos dormidos",
                "pl": "Zaktualizowano `zwave-js` do v2.12.1. Obejmuje to następujące zmiany:\n* Gdy węzeł zostanie usunięty z sieci, wszystkie powiązania z nim również zostaną usunięte\n* Procedura wywiadu jest teraz anulowana i ponawiana, gdy wystąpi błąd, zamiast po cichu zawieść wszystkie kolejne kroki\n* Wprowadzono usprawnienia procesu leczenia sieci\n* Kilka ulepszeń stabilności dotyczących procedury wywiadu i obsługi śpiących węzłów",
                "zh-cn": "将`zwave-js`更新为v2.12.1。这包括以下更改：\n*当节点从网络中删除时，与该节点的所有关联也将被删除\n*现在，发生错误时，面试程序将被取消并重试，而不会默默地使所有后续步骤失败\n*对网络修复过程进行了改进\n*关于采访过程和睡眠节点处理的一些稳定性改进"
            }
        },
        "title": "Z-Wave",
        "titleLang": {
            "en": "Z-Wave",
            "de": "Z-Wave",
            "ru": "Z-Wave",
            "pt": "Z-Wave",
            "nl": "Z-Wave",
            "fr": "Z-Wave",
            "it": "Z-Wave",
            "es": "Onda z",
            "pl": "Z-Wave",
            "zh-cn": "Z-波"
        },
        "desc": {
            "en": "Alternative Z-Wave implementation",
            "de": "Alternative Z-Wave-Implementierung",
            "ru": "Альтернативная реализация Z-Wave",
            "pt": "Implementação alternativa de Z-Wave",
            "nl": "Alternatieve Z-Wave-implementatie",
            "fr": "Mise en œuvre alternative de Z-Wave",
            "it": "Implementazione Z-Wave alternativa",
            "es": "Implementación alternativa de Z-Wave",
            "pl": "Alternatywna implementacja Z-Wave",
            "zh-cn": "替代Z-Wave实施"
        },
        "authors": [
            "AlCalzone <d.griesel@gmx.net>"
        ],
        "keywords": [
            "zwave",
            "z-wave"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "build/main.js",
        "icon": "zwave2.svg",
        "enabled": true,
        "dataFolder": "zwave2.%INSTANCE%",
        "extIcon": "https://raw.githubusercontent.com/AlCalzone/ioBroker.zwave2/master/admin/zwave2.svg?sanitize=true",
        "readme": "https://github.com/AlCalzone/ioBroker.zwave2/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "hardware",
        "compact": true,
        "materialize": true,
        "messagebox": true,
        "connectionType": "local",
        "dataSource": "push",
        "dependencies": [
            {
                "js-controller": ">=2.0.0"
            }
        ]
    },
    "native": {
        "serialport": "",
        "writeLogFile": false
    },
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info",
            "type": "channel",
            "common": {
                "name": "Information"
            },
            "native": {}
        },
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "Whether the Z-Wave driver is ready",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.inclusion",
            "type": "state",
            "common": {
                "role": "state",
                "name": "Whether the inclusion of nodes is active",
                "type": "boolean",
                "read": true,
                "write": true,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.exclusion",
            "type": "state",
            "common": {
                "role": "state",
                "name": "Whether the exclusion of nodes is active",
                "type": "boolean",
                "read": true,
                "write": true,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.healingNetwork",
            "type": "state",
            "common": {
                "role": "state",
                "name": "Whether a network heal is currently in progress",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}